[
  {
    "file": "1.mp3",
    "seconds": 0,
    "content": "Hello, and welcome back to another episode of Sharp Tech. I'm Andrew Sharp, and on the other line, Ben Thompson. Ben, how are you doing? I'm doing okay, Andrew. How are you? I'm doing pretty well. I feel good. Last week, I think it was last week we started the show, you were a little down about the Milwaukee Bucks, and we just kicked things off tonight with 10 or 15 minutes of the swagger coming back. I expressed a little bit of ambivalence about the Bucks, and that set you down a rabbit hole of rants, and there was some Celtics trash talk mixed in there. Everyone is overreacting. You should listen to Sharp Tech beat to be ahead of the curve. I was ahead of the curve in expressing concern. Now everyone has caught up. They're overshooting. The reality is the Bucks have been terrible. There's a big adjustment on offense. I underrated that for sure."
  },
  {
    "file": "2.mp3",
    "seconds": 60,
    "content": "that for sure of, of Yon, you know, Dame driving the offense and Yon is learning to work around that, but they'll figure it out. This is the worst their offense will ever be. They're still four and two with, they beat the 76ers. They beat the heat, you know, the, and they mess around all game and look terrible. And then they get to the last five minutes and they kill teams. I would rather be in that situation than have a team say, I don't know, like the Boston Celtics that can kill teams in the regular season. Congratulations. Your first time in the clutch. What do you do? Make all the same mistakes. Look just as bad. Have no rim pressure, no composure in the clutch. Yeah. I mean, so we went out and fixed our problem. They went out and got one of our problems as far as the clutch goes. So good luck to them. Oh boy. Oh boy. This is the Ben I know and love. I didn't recognize the Ben that I was podcasting with a week ago. So it's great to have you back. I am always, I do my best to always be honest. I admit my biases, but I try to tell the truth."
  },
  {
    "file": "3.mp3",
    "seconds": 120,
    "content": "I will not sugarcoat the fact like I did last week that that there's been challenges and there's going to be more They're probably gonna lose some more dumb games. It's probably going to happen. I now better appreciate like, you know It's a human story, right? Giannis has been the driving force of the Bucs now we have one of the best offensive players in the league He's gonna have to accommodate that's hard. We saw this with the heat a decade ago like it's a difficult transition to make but that doesn't change the fact that actually Amplifies the fact this is the worst they will be it is it is going to get better Obviously the whole point was to trade defense for offense. They actually shifted their defense again It's bothersome. They started with such a bad plan, but they actually change There was an adjustment. Okay, that's an upgrade over the Jason kid era and we'll take it. That's right. That's right I'm there, you know again. Everyone is just looking for an excuse to to you know Give compliments to the Boston Celtics. It's fine. I'm used to that but doing that with 40 for 40 years poor"
  },
  {
    "file": "4.mp3",
    "seconds": 180,
    "content": "Wow. Poor small market. Yep. Yeah. You know what? We will not know for sure till we get to the playoffs. But I would say after two weeks, I feel more confident about the playoffs or I feel affirmed in my beliefs, both about the buck sort of possibilities and the Celtics weaknesses. So let's let's go. There you go. Stay ahead of the curve. You heard it here first, America, a week ago, people were too high on the bucks. Now people are too low on the bucks. Get on the bandwagon with Ben and I, and we're going to start speaking of ahead of the curve. We're talking open AI at the start tonight. And we'll start with an email from Ben. Ben to Ben question here. Can we hear more from Ben on the universal interfaces he mentioned in this week's open AI article? It seemed most of the open AI demos were actually a worse interface than the tools we have for those specific tasks today. For example, the calendar they demoed gives a bulleted list of events, but Google's calendar is much more tailored."
  },
  {
    "file": "5.mp3",
    "seconds": 240,
    "content": "is much more tailored to the actual job of managing a calendar and tightly integrated with my phone, email, and contacts, why is asking a chat bot for my day's schedule a superior user experience? It feels like the opposite of your CarPlay argument to suggest chat GPT has some advantage here. So first and foremost, Ben, you can take it whichever direction you'd like, but for anybody who didn't read your article, can you explain what you mean by universal interface in Ben's question here? Well, I think this idea that if you wanna do a particular task, you need to get into that task mode and then do that task, that works in certain circumstances. And I think the calendar one is a good one. I will address that sort of specifically in a moment, but the idea is, and this goes to OpenAI, I wrote that in the context of these GPTs, these alternative interfaces. It's basically a replacement for the plugin architecture that they have and the underlying concept that chat GPT."
  },
  {
    "file": "6.mp3",
    "seconds": 300,
    "content": "that chat GPT is good at having a conversation. That doesn't mean it's good at everything. In fact, it means it's bad at some stuff because the entire things that make it good at having a conversation, the fact that it's probabilistic-based. And yeah, and it's sort of like is able to seem like an actual person. And as I talked about, if you use the voice interface, it's really quite remarkable. Like, and there's a sense of sort of immersion that you feel when you're talking to that, that you have never sort of experienced with sort of a computer previously. That is super powerful, but that's not necessarily doesn't make it good at like doing math, for example, or getting like certain specific details sort of right. There are certain things where you want the right answer. And so being probabilistic and being able to guess more accurately than anything we've ever seen before isn't a substitute for just the certainty of knowing you're getting the right answer. Right, and so you want it to be able to use tools and use other things to sort of get the right answer. The challenge right now is that ideally it should be able."
  },
  {
    "file": "7.mp3",
    "seconds": 360,
    "content": "it should be able to figure out how to use the right things without being prompted to. And so I think this entire interface, and this is applied to the plugins, which is go in and pick the plugin and then have a conversation. Well, that was weird because you'd start a conversation, realize you didn't pick a plugin, you had to go pick it, you had to start a new conversation. So you lost all your context of the previous conversation and then you had to start over again. It was just sort of a UI mess. This new one is, it at least forces you up front to think, oh, I want to make a restaurant reservation. I want to do XYZ. But that moment of consideration at the top where I would need to put the GPT in the right context to accomplish what I want to do is still not ideal. You want the universal interface. What I mean is you don't have to think about it. You don't have to context switch sort of your conversation. And I think there is a bit where the closer you get to that feeling that it's real, the more abrasive these shifts come, right? It may seem, oh, is it really a big deal to just click another icon on the sidebar? Well, yes, because now you're using the."
  },
  {
    "file": "8.mp3",
    "seconds": 420,
    "content": "now you're using the AI as a tool, right? And you're picking the right tool for the job and then trying to accomplish it instead of just sort of, hey, you know, chat GPT, make me a reservation, are there reservations at XYZ at four o'clock? And it just knows to like invoke open table or whatever. And it go there and look, say, oh, nothing's available. There's one at six, do you want to do it now? Now you can get into this idea like, well, why don't you just open the app and choose a time? And I actually do think that is going to continue to be the best thing to do. Because once you're, the whole aspect in which this works is if you can maintain a sort of like flow state almost, where you're not mentally context switching, the AI is doing the context switching for you. It's basically interfacing with all the right things and you can stay in sort of a consistent frame of mind. If you are context switching sort of mentally, you might as well just go to an interface optimized for the particular task. So there's like this sort of trade off there. Or to open table, for example. Just, yeah, if I'm going to switch out."
  },
  {
    "file": "9.mp3",
    "seconds": 480,
    "content": "If I'm going to switch apps, why am I going to switch to another GPT when I just go to OpenTable.com and go choose whatever it is or Resi or whatever it might be? And so once you're into the mental state of let me find the right tool for the job, then go to the tool that's optimized in that particular way. Where AI, I think, is going to be compelling is when you get to a universal interface where you don't think to switch contexts. You're just already in sort of the context and it just does the right thing along the way. And again, I can't overemphasize, I think the closer these things get to feeling like a real conversation, to feeling like a real back and forth, the more essential it's going to be to not have any sort of rough edges. Because the magic comes when you get tricked into feeling like it's real. Like this applies in the metaverse, right? When you get that sense of presence, it's super compelling. The moment you're in the metaverse, you're having a meeting, you have some sort of like you're "
  },
  {
    "file": "10.mp3",
    "seconds": 540,
    "content": "of like, you want to look at something, right? Or, or don't you, or you're like, it's like the whole thing where you bring the computer into the space has always been kind of buggy. The first time it sort of messes up and screws up, you're like, Oh, why do I have this headset on? This is ridiculous. I could just be on a zoom call. Right. And, and so there is a bit where that interruption of immersion, even if the interruption is sort of on an absolute level, very small, relatively speaking, it feels massive. And I think that applies to these sort of conversations. If you're sort of locked in and going sort of back and forth, then the interruption feels large. Now, as long as we're typing text in a box, we're probably not quite at this state just because it's slow, right? It's slow to type. It's slow to respond. I do think this is an aspect where getting closer to voice, just where you start, you talk and you have that sort of conversation. That's where this immersive sense of immersion, I think is going to be super."
  },
  {
    "file": "11.mp3",
    "seconds": 600,
    "content": "I think is going to be super sort of compelling. As long as it's tech space, it's only going to ever feel like a tool. But once you can start talking, it's really, really compelling. And this gets to the broader point, which is to get into that state right now is really hard. You have to open the app. You have to invoke the voice thing. And then it's still a little slow. It takes a while to get started. And then even then, I actually want an A.I. that talks at me at like three X speed, right? Like I want it to be like super fast and sort of be a lot of that back and forth. That will take me out of the moment. Just for the record, I don't want a robot talking at three X speed to me. Right. Well, I'm an insane person. Yeah, but like listening to podcasts at three X speed before you go any further. Can you explain what the product is now? What chat GPT is today as of this week with Sam Altman's announcement of GPT for turbo? And like it seems like we've taken a step toward the future that you're describing, but."
  },
  {
    "file": "12.mp3",
    "seconds": 660,
    "content": "describing, but that product is not available today to date. You said chat GPT, which had a knowledge cutoff of September 2021. It's now updated to April, 2023. And so the default experience, which by the way, most people also do not have the default experience or the optimal experience because they're using the free version, which is right. They're not TPT three base. Yeah. 3.5. And so this is GPT four, which is better in a lot of ways. It's been a little slow today. Now it's like, it's being sped up. That is going to, that is going to help. And, but the other thing is if you wanted to do anything different, you had to invoke it. And so say you wanted to generate a picture and I ran into this a couple of times. Oh, imagine a picture, blah, blah, blah. And it's like, I can't do this, blah, blah, blah. But here's a prompt you might use. I'm like, oh, shoot. You have to go up, click a thing and said, switch it to drop down thing. Right. And then, or you, you want to find current information. You want to use, use a search engine. Oh, you have to invoke that mode and sort of go, go into that mode. And so."
  },
  {
    "file": "13.mp3",
    "seconds": 720,
    "content": "And so the big meaningful shift to me this week is that stuff is now by default. If you ask it to create an image, it will just create an image. It knows to use Dolly understands on the back. That's right. If you ask for current information, it knows to search and sort of sort of find that and that I think it sounds like a small thing, but I think it's a huge thing. I think these these these nicks on the user experience and the sense of immersion are limiting. They limit how much you want to use it again. It's stuck in your mind as a tool like or GPT would be good for this. Let me go to GPT and use it as opposed to having an ongoing sort of continuous dialogue throughout the day. And so is your concern that as long as it's a tool, it's competing with every other tool that we already have on our cell phone or on our computer for instance, where suddenly yeah, Google's calendar may be superior as a tool doing that specific task relative to what GPT"
  },
  {
    "file": "14.mp3",
    "seconds": 780,
    "content": "to what GPT is offering you. But once it becomes immersive and you can just do everything on there and basically have a stand-in personal assistant that you can talk to all day, suddenly it blows everything out of the water. Right. I think so. This Google Calendar one is a good one because it hits on a point that I've made again and again. Every time we have a new technological paradigm, all of the initial use cases are doing things that you could do in the old paradigm worse, right? Because part of the problem is you're not sure what you can do with this. So it's like, well, we use calendars for our computer. Let's do a calendar and chat GPT. And it's like, why am I reading through a text list representation of my calendar when I could look over one window over and there is like blocks and I can visually see what's going on. And it's all the sort of integrations that I want instead of tie all these crazy things together. And so Ben's skepticism here is completely correct."
  },
  {
    "file": "15.mp3",
    "seconds": 840,
    "content": "correct. However, it's been one year. That's it. Right. And so, so you, you have to look at technology in what you have to look at the trajectory and where it might go. And there's so many people I talked to that are so skeptical about this and they just bring up example over example of how it fails today. And it's like, yeah, but can you imagine a scenario where that works better? Now, some of the examples are, might be fatal, right. In the question, particularly of, you know, I was talking to a developer friend who wants really high level thinking out of like sort of chat GPT. And that's tapping into some sort of creative aspects where I'm not sure it's going to get there. Right. And, you know, and I personally, you know, they're like, it's limited to the knowledge that it has. Now that's basically, that's a massive amount of knowledge, but to create, you know, it can identify patterns and find stuff. You might not have realized before, but there is an asset."
  },
  {
    "file": "16.mp3",
    "seconds": 900,
    "content": "But there is an aspect in my estimation of sort of the creative prospect where you process, where you use all the knowledge that you have, which may be less than just GPT, but the creativity comes in the creating new connections that didn't exist before, which again, GPT rests on stuff that existed before. It may find stuff that's super buried in connections that no one ever thought existed. But I do believe there is a possibility to create new connections in sorts of ways, and it may never get there. That's a fair point. But there's also lots of stuff that it sort of fails at today that you can say, oh, well, that's going to get better. That'll be resolved. Yeah. And I think a lot of stuff is actually UI specific. It's not necessarily a technological sort of thing. This calendar thing is a great example. This concept that it's going to display my calendar in a list of bullet points is obviously ridiculous. What's not ridiculous is say you're driving in your car and you say, hey, chat GPT, what's my calendar look like today?"
  },
  {
    "file": "17.mp3",
    "seconds": 960,
    "content": "to look like today, or what's a good time for me and Andrew to have, have a call in the next three days. And it has access to our calendars and it says, well, you have this time available here, or maybe it gets really smart. Cause I've been using it for a while. It's like, you don't have any time. However, there's this call here that you might want to be able to move XYZ. And it starts, you don't like this person. I can tell, I've read your notes. Yeah, no, but it's like, Oh, I have a meeting with Dominic or something. It's like, you know, you could probably move that around. Right. It's something you meet with all the time. There's probably some flexibility there. And I think all that is, is sort of viable. And now this idea that it can integrate with your calendar makes so much more sense because the UI is right. And it's actually enhancing your sort of ability to communicate. Now, again, we're still limited though, in the examples we can give of how this might work. Because the real magic comes when use cases and products are created that were not."
  },
  {
    "file": "18.mp3",
    "seconds": 1020,
    "content": "that were not possible previously. And the go-to example I bring up again and again is the feed, right? Like everyone thought that the internet monetized terribly compared to print because it's like, well, we just get so much more money for ads placed next to an article in a newspaper. We're trying to put ads next to articles on the internet and they monetize like crap. It's like, well, yeah, because you're on a computer, like it just doesn't make sense as opposed to having a paper there. And the ad is like much more unavoidable and compelling, whatever it might be. Suddenly you get a feed where it's perfectly customized to you. Every item is, including the ads, you can insert stuff dynamically because it's continually being loaded. It's infinite. It goes forever. You could not make a feed using paper. You could not make a feed in a newspaper. It had to be, it was a product that was uniquely enabled by the internet. And it turns out it monetizes pretty well. So I think a lot of the people putting forward these arguments are stuck in, they're the people that were writing articles circa 2000."
  },
  {
    "file": "19.mp3",
    "seconds": 1080,
    "content": "circa 2000, talking about print dollars and digital dimes. That was an actual phrase, which is the internet is never going to monetize as well as print because all these limitations, blah, blah, blah, blah. And you fast forward to now it's like, what an insane take that was. Right. And it's been, you know, but it's been 23 years, right. There were 20 years, however you want to measure it. It, this stuff takes time and we're only a year in, you have to think forward. Do does Ben really think that if you fast forward to 2035 are these AI assistants are going to be limited to putting out bullet points about your calendar that you have to read in the text box, do you think that's where we're just going to end here? I, I don't think so. I think it's going to progress and it's going to gain more capabilities and the UI is going to get figured out and there's going to be possibilities that were not possible previously. Yeah, that seems like a fair assumption. So as we imagine that future, strategically speaking, are they?"
  },
  {
    "file": "20.mp3",
    "seconds": 1140,
    "content": "Are there advantages open AI and chat GPT have beyond just sort of name recognition early on here? Because that's... Name recognition, this is the key thing, is the biggest strategic advantage. It is, so here's the thing, it is, but I see Sam Altman, I'm a little bit skeptical of Sam Altman, okay? First of all, he tweets in all lowercase letters and I'm skeptical of anybody who tweets in all lowercase letters and people talk about him in these hallowed terms. I'm sure he's a nice enough guy, hopefully I run into him somewhere along the way, but I look at chat GPT, it's a really impressive product that most people don't use on a regular basis and so the name recognition is recognition of like a novel, fun product that hasn't necessarily transformed society as much as people predicted it would a couple weeks after it launched. Granted, I know it's only been one year, I'm not setting the bar that high. There's a hundred million people using it."
  },
  {
    "file": "21.mp3",
    "seconds": 1200,
    "content": "a hundred million people using it after a year. I, yeah, but I, I look at it and it's like, seems to me to be a worse version of Google. So is it just that they're gonna have superior technology? Like, are there other advantages they have that give them a leg up on everybody else? And maybe this is a stupid question. I've just, as I sit, as I sit here and look at like the massive players in tech, it's hard for me to imagine OpenAI sort of crowding their way into that big five and, and establishing itself without a significant leap forward in terms of the tech that they're bringing to market. I mean, I just disagree with the premise of your question. ChatGPT's recognition, and the fact that it has a hundred million users after a year and is reportedly doing a billion dollars a year in revenue or whatever it is, is extraordinary. Like this, you're dismissing it as is."
  },
  {
    "file": "22.mp3",
    "seconds": 1260,
    "content": "it as is, as if it's some sort of also ran. And I just like, and I'm having a hard time squaring, or maybe this explains like some of the skepticism you have of, of, of the big companies that nothing will ever sort of be created again. And your sense of scale is completely warped. I mean, Twitter has what like a 200 million, 300, who knows what the actual numbers is like. Right. You talk about it all the time as this great, you know, force and irritation and frustration because you're on Twitter all the time. Sure. You do not use chat GPT, but right now it is the worst. The product will ever be. It is as, as I just articulated, the user interface is not an optimal interface. It's a thing where you have to go and explicitly choose to use it because it's stuck in this sort of tool sort of mindset. There's no, there's no ease of use or seamlessness in accessing it. And despite the fact it has been so useful to folks that it again has extraordinary usage numbers."
  },
  {
    "file": "23.mp3",
    "seconds": 1320,
    "content": "usage numbers for only being a year old. I, I just, I think it is a big deal. And I do have questions about, is the technology actually sustainable as a moat in the long run? I am somewhat skeptical that skepticism fuels our discussion last week, which is if you are worried about a long-term moat, it would be nice if an important factor in being a player in this space is sort of that you have to deal with like 37, you know, federal agencies and whatever it might be and all that sort of stuff, right? Which Microsoft is very good at. Well, that's sort of what I'm asking. Like they're clearly ahead of everybody technologically now, but I was wondering whether there are other structural advantages because I understand the story that you're telling, which is that there are 100 million people using it after a year. That's obviously remarkable. It does feel like the momentum has slowed a bit and the traffic plateaued earlier this year. I don't know where it is today, but as recently as September, it had been sort of flatlining for a little while. Right. And then once kids got back to school, it took..."
  },
  {
    "file": "24.mp3",
    "seconds": 1380,
    "content": "school it took it went up again. It hasn't necessarily taken the world by storm um in in my eyes and look you people can define it differently. What what defines taking the world by storm? I would love a reason to use it more than once every six weeks. So it's you that is the problem. I don't use it every week so it is not actually that popular and compelling. Correct I'm not a coder. I cannot look I'm sure it's useful for coders. I'm sure it's useful for large chunks of our audience but I also am a stand-in for normal people and I actually do think that my use cases are more reflective than yours in terms of how the general public receives this technology. So I feel confident being like all right Sam Altman want to impress me make a product that I use more than once every six weeks. That's where I am today and who knows what he'll come up with or what other entrants may come up with that it's more about."
  },
  {
    "file": "25.mp3",
    "seconds": 1440,
    "content": "more about projecting forward 5 or 10 years. I'm wondering like how much of an advantage open AI and chat GPT actually have right now. Are AirPods a success? AirPods are unfortunately a success, but I am staying strong skeptic Island here. Another question about let me get to the point about why I do think the brand the brand sort of matters. I like when it comes to you know, there are very few long-term boats built around technological differentiation. It can happen argue, you know, but it's it's pretty rare and this is a mistake that technologists do make an engineers make sort of again and again is getting hung up on what's the technical reason that it succeeds. This is why half the tech industry and it used to be like 90% of the tech industry could not understand Apple because you get stuck on sort of the numbers and the feeds and speeds and the technical characteristics and underestimate."
  },
  {
    "file": "26.mp3",
    "seconds": 1500,
    "content": "underestimate the fact of what actually appeals to consumers broadly and also the fact that consumer preferences are very difficult to change and customer acquisition is the hardest problem in tech. And so that's why that's the root of the sort of aggregator sort of powers that we talk about all the time is once you get customers accustomed to your platform and you get them in the habit of using it, you get monopoly like power without there being any of the structures of a monopoly. They're not locked in. A competitor really is, you know, a one click away, like all that stuff. The reason why, as I say again and again, that that phrase drives people up the wall is because it's true. You really could go to bing.com. You really could go to walmart.com. You really could go to another internet service and people don't because they like the one that they use and they don't see a reason to change and it's hard to change habits."
  },
  {
    "file": "27.mp3",
    "seconds": 1560,
    "content": "habits. That is a moat. It doesn't feel like a moat because it's so trivial to change, but the reality is that it actually is sort of very, very compelling. That's why there is actually much more of a moat than appreciated in controlling and capturing consumer preference and behavior and demand. Now, there is no one that is remotely close to OpenAI as far as doing this to date. Now, I will grant and agree with you and argue against myself. In that context, in the context of aggregators, 100 million is not that much. Aggregators, we're talking about billions, right? Like that's sort of where you want to get. Everything you're describing explains why so many people go back to Google, even as the product degrades and everything else, and you search for... I literally, the other day, I searched for like a specific hotel name, and it showed me four other hotels that weren't the hotel name I was searching for in Las Vegas."
  },
  {
    "file": "28.mp3",
    "seconds": 1620,
    "content": "Still, there's like a preference and a comfort level that keeps me coming back regardless and that's true for billions of people. So that's what open AI is up against. And they are slowly putting sort of generative AI in search and that is the reason to sort of be optimistic in Google's sake is they can do enough to sort of keep it in a level that sort of makes sense. The product is good enough. When you want users to change products, the delta of how much better your product is has to be like 10x because the pain of changing is significant. Like just changing your habits and just sort of getting people to do stuff different. It has to be so compelling. It has to be Google in 1999 or whenever it came out where it was just so much astronomically better than every other search engine out there that people just changed. Now that was easier in some respects because part of it was putting a bookmark and then"
  },
  {
    "file": "29.mp3",
    "seconds": 1680,
    "content": "bookmark. And then once browsers started including default searches, you could change sort of, you just sort of be in the browser. But Google is really the shining example of winning by just having better tech and sort of never being good at marketing, never bothering to understand consumers in any meaningful way, never doing any customer acquisition. It just all happened for them. And this has been hard for Google in that they're actually terrible at developing new products because they never developed the capability of understanding customers and meeting where they were. They had product market fit from day one, the product market fit was perfect. And then number two, so much of the valley copied Google and took inspiration from Google about all sorts of things, from the way you treat employees, from culture to the way you launch products. And it just, it validated this sort of mindset that if we just make better tech, we will win. And it turns out, no, you won't. In the vast majority of markets, you have to actually sell. You have to actually build a channel. You have to efficiently acquire customers."
  },
  {
    "file": "30.mp3",
    "seconds": 1740,
    "content": "acquire customers. And people in tech would get so upset, particularly in like the enterprise era, why is Microsoft doing so well? Why are they cutting you and killing our markets? Are you guys so superior? What the hell is wrong with people? We make a better product. It's like, sorry, that doesn't matter. You are unable to acquire customers efficiently. There's all sort of requirements that, you know, that you have to actually fulfill to serve large customers. All these sorts of things. We've talked about a million times. Dropbox, Slack, like a million sort of examples. And Microsoft just comes in. And part of these markets is you're selling to the CTO. Like you're selling to one person. You have that singular point of leverage. You just have to convince them. And then they will say, you know, and then everyone in the base will complain, I can't believe I have to use Teams. It sucks. Which it does. The chat experience remains terrible, right? But like you also, you're going to have one chat product for the company and you're not the one deciding what it is. So you're going to have to like suck up and use it, right? Like that's just sort of the reality of the space."
  },
  {
    "file": "31.mp3",
    "seconds": 1800,
    "content": "space, the consumer space is different consumers choose. And so what wins of the consumer space is different. And, and, and what maintains in that space is sort of different. So in the long run, this is why I do think like, you know, will chat GPT be ultimately sort of a defensible app, you know, as sort of an MC, as a company, you know, in sort of the enterprise space, I think they're going to be in good shape because of Microsoft, like, like Microsoft brings a lot to the table for open AI. This is not a one way relationship. If you're trying to build something sort of at scale, it's a real chicken and egg problem. How do you get enough people like talk about like Intel, like, for example, right? They want to build the foundry business. One of the challenges of building a foundry business is you have to get customers because for a fab, if you're going to invest $20 billion in a fab, Reckless to do it without built in customers. Yeah, you need, right. That's why Intel still needs their chip business. Like, now there's all sorts of problems of Intel having their own chip is trying to build a foundry."
  },
  {
    "file": "32.mp3",
    "seconds": 1860,
    "content": "is to try to build a foundry, which is like, you know, you have a conflict of interest sort of inherently sort of built in, you, you, you, you have a tendency to cheat on the manufacturing because you can fix it in design or sort of vice versa or whatever it might be. But the reason why it's hard for Intel to, to split, like which people talk about, should they split up these sorts of things is Intel at the end of the day is the first customer for the Intel foundry, you know, it gives volume and you just have to have volume in this space. And the costs of investment are so large that you need something upfront to sort of make this happen. This applies to infrastructure for AI at this, at this stage, the way it's being built out, it was especially for the consumer space. You need all these ridiculously expensive NVIDIA GPUs sort of in your data center. You need them for, for training. And for now you need them for inference. That's what's used for, for, you know, we'll get to how much that will change in the long run. But what is going on is Microsoft isn't just building this because open AI has been"
  },
  {
    "file": "33.mp3",
    "seconds": 1920,
    "content": "OpenAI has been successful. And they're not just building it because Azure is also selling access to the OpenAI API with all the assurances and niceties that come from being a Microsoft customer with it. Microsoft is also using it in their products. They have visions of charging $30 extra per user, an incremental increase of $30 a month because you get access to this co-pilot. That's a pretty good incentive to spend a lot of money, to get an infrastructure, to optimize that infrastructure in a way you can only optimize once you're at volume. And so you start getting a cost advantage. And so this week, one of the big announcements is OpenAI cutting their pricing. They can only cut their prices if Microsoft is actually figuring out a way to be more optimized in their stack. And they can be more optimized in their stack because they're basically running the same stack for OpenAI, for Azure, and for Microsoft itself. They are bringing a first best customer mentality where they actually have multiple first..."
  },
  {
    "file": "34.mp3",
    "seconds": 1980,
    "content": "have multiple first best customers. They have ChatGPT. They have the OpenAI API and all these startups that are probably wasting tons of money on futile attempts to build something that OpenAI is going to obliterate in like three months. And you have Microsoft itself sort of doing this. And that gives, so you have this situation where they're not just, you know, have the name recognition. They also have a cost advantage because we're being first to market. Okay. So another question about their future model. Grant says, Ben and Andrew, something that piqued my interest this week on the heels of OpenAI's demo day is the business strategy of OpenAI all up. Ben has noted in the past that it's hard to serve both B2B and B2C markets given the delta in what it takes to serve each effectively. And that Ben, parentheses, hopefully I'm representing his view correctly, initially saw the B2C market and ChatGPT as the biggest opportunity. Given the news from this week and the various updates that have come over the past few months to ChatGPT, DALI, and their enterprise and developer tools."
  },
  {
    "file": "35.mp3",
    "seconds": 2040,
    "content": "developer tools. Does it seem like they're threading the needle here? Do you think there might come a time when they'll be forced to choose one or the other between B2B and B2C? Is there something unique about the services they offer that could make them an exception to the list of companies who have struggled with this in the past? What do you think downstream from everything we were just talking about? Yeah, I don't think anything this week meaningfully changed my perspective, which is leaving aside the fundamental issues of OpenAI's weird structure and their stated goal of going for AGI, and all those sorts of things. If you were to sort of analyze, I had a whole section in there about my article this week that ultimately cut the article as pretty long as it was and I didn't want to sort of get into the weeds. But if you just think about OpenAI as a classic sort of Silicon Valley startup, and you think about it as like a venture sort of thing, and what would I as an investor want them to do to sort of reach for the optimum outcome? To my mind, the long term most sustainable moat and the biggest upside is becoming a major consumer internet company."
  },
  {
    "file": "36.mp3",
    "seconds": 2100,
    "content": "consumer Internet company, and that is that's the hardest thing to do. Right. There's the most startups. Everyone wants to build a consumer startup. And you look around and there's just not that many that actually succeed. Well, and by the way, you referenced me earlier, you know, lionizing the big five. I think it's more recognition that it is so much harder to do that today than it was 25 years ago. In keeping with your end of the beginning theme from a couple of years back, like the major players seem pretty entrenched right now. So it's a really tall order to become another consumer behemoth like that. But maybe they can pull it off. Well, it the new behemoths come at paradigms, right? The last big paradigm. So there's there's two sorts of paradigm. It's almost like a tick tock sort of thing. There's a hardware shift and there's a services shift. So you have like the PC comes along and then obviously the dominant player was Microsoft. And the Mac comes along and would actually, you know, become meaningful sort of later."
  },
  {
    "file": "37.mp3",
    "seconds": 2160,
    "content": "meaningful sort of later. Then we can go back to the mainframe and all this sort of stuff. Let's start with the PC. So you start with the PC, then the internet comes along. And the internet, the big winners were Google and Facebook. Like those were the two, and Amazon, I guess you'd say, would also come along. And Amazon is unique because it deals with the real world, physical services, but Google, Facebook, and Amazon. And so you have Microsoft and Apple in that paradigm. And the next paradigm, you have Google, Facebook, Amazon. The next paradigm was mobile, and we didn't get anyone new. We got Google and Apple. And so this concern about it's all sort of big was actually a concern that was probably better articulated 15 years ago. Because the reality is, is to bring that paradigm to market, those with existing resources were the best place to capture that opportunity. There wasn't a disruptive startup that came in in sort of one mobile. And you would say, oh, well, Android was a startup. Maybe if they were alone, if they had stayed alone, they would have not gotten anywhere. You needed the heft and push of Google behind it to sort of make that happen, in my estimation."
  },
  {
    "file": "38.mp3",
    "seconds": 2220,
    "content": "my estimation. So you had a shift. If you want to talk about being disruptive, it was disruptive. It was disruptive to Microsoft and windows. Cause you actually ended up using a phone for far more things. It was not as good as a PC, but it won on other attributes. So it like it was disruptive to the PC, but amongst the big tech players, it was a shift in power. Apple took over that dominant sort of position and Microsoft was nowhere to be seen. So you, you move to sort of the next stage, which is, you know, what, what do you want to put it as you could argue that SAS was sort of the next stage or the enterprise space again, who are the big players, Amazon, Microsoft, and Google, right? Like, and then you go to AI and, and if there is ever going to be the emergence of another player, it is going to be around some sort of shift like this. And part of the case is you go back to the internet era in the nineties and thousands, there were only like you could measure the number of people online in the hundreds of millions, right?"
  },
  {
    "file": "39.mp3",
    "seconds": 2280,
    "content": "of millions, right? You go back and you have a hundred million user company in 1996 or whatever you want to say, it's the biggest company in the world, you know? Right. Like, like it would have been sort of an absolutely massive deal. And so part of the issue is just the scales are, the scale is so much different today that the challenge and the path from being a startup to getting there is so long that yes, it is exceptionally difficult and it's hard to see sort of what might succeed otherwise, which makes, in my estimation, chat GPT success to date, all the more remarkable at some point, I need to answer this question. So I appreciate it. We're just going to be mostly GPT and open AI theme today. Yeah. We've got like two questions. Sorry about that. Um, uh, I'm just filibustering to avoid the questions about the, the regulation stuff, I guess later. No, so, okay. So, so w where's their, their, their strategy sort of today? So their goal, you have their."
  },
  {
    "file": "40.mp3",
    "seconds": 2340,
    "content": "you have, their goal was to, we want to build AGI and we need to make money on the way. So we'll just have an API and people can sort of use our stuff, right? And they kind of threw out ChatGPT as like a tech demo and it blew up in a way they never sort of intended. I don't think they had any goal or thought of being a consumer tech company in October of 2022. Like ChatGPT has pulled them, kicking and screaming into being the most compelling consumer AI tech product. And one of the most compelling products basically in the consumer space since the iPhone. And it was almost all sort of an accident. So they have this vestige of this alternative strategy but that alternative strategy is, I think, it's not complimentary to what they're trying to do. So number one, you have this, every time they add capability to ChatGPT, they're killing a bunch of developers, right? Like who, like they did a bunch of stuff this week about having statefulness as far as, as like these Japanese go, they have this sort of thread pair primitive which I think is pretty interesting."
  },
  {
    "file": "41.mp3",
    "seconds": 2400,
    "content": "interesting. So it keeps the context sort of fresh when you're having an ongoing conversation. And just to clarify, to make sure I'm understanding properly, the reason they kill developers or make developers lives three times as complicated in that scenario is because the ground upon which the developers are developing shifts underneath them, right? And suddenly you have to rework all of your plans for the future. No, the issue is, yeah, so you say like, well, ChatGPT can't do this. Let me build an app that does this capability. Imagine if you could put a PDF in, it would give you a summary, blah, blah, blah. That'd be super compelling and interesting and easy to sell. People can get that. And then two months later, you can upload a PDF and we'll output it. And what's the difference? The difference is that ChatGPT has a hundred million users and you have like a hundred, right? And so you're dead, it's over. And maybe some like, I mean, I'm sure it's only a matter of time until we get through our regulatory investigation of ChatGPT killing innovation, which I..."
  },
  {
    "file": "42.mp3",
    "seconds": 2460,
    "content": "which I think would be a massive mistake because to your point, we will clip your recording on here. This is very early days. They are a small player, sort of relatively speaking. No one important uses them. Like Andrew Sharp goes there once every three months. If I don't use your product, you do not matter. That is the sharp tech law here from day four. That's right. And so you need to tell me to come back so you can check in with me. Right, and so they should be making the product better. Right? I mean, this gets back into some of my frustration around Google regulation and like the EU or whatever, you have like the shopping case. There's this mentality, and part of it was just because Google was so successful so quickly, they got very large, that Google should only ever be 10 blue links, right? And so in this Google shopping case, the case was based on the shopping comparison sites that it used to be when you search for athletic shoes, the top link."
  },
  {
    "file": "43.mp3",
    "seconds": 2520,
    "content": "the top link would be a shopping comparison site where you went to that link and that would list a bunch of options where you could buy the particular shoes and their prices and they would make money from like affiliate fees or something. At the end of the day, I did not go to Google to ask for a shopping comparison site. If I want a shopping comparison site, I would have typed shopping comparison site. What I want are the shoes. And so if Google gets better and puts the shoes that I want as the first shop result, that is in my mind a completely valid improvement. We should want products to get better. But there's this like, I actually think this is quite pertinent. The reason I found that case in particular with Google and the EU so frustrating is the equivalent today would be suing OpenAI because they added the ability to interpret a PDF to chat GPT. It's like, hey, this company started when you could only do text. You are killing competition by making your product better. And"
  },
  {
    "file": "44.mp3",
    "seconds": 2580,
    "content": "And, and obviously chat GPT should interpret a PDF just as obviously Google should show me shoes, not a site. I didn't ask for when I searched for shoes. So this is the challenge though, for so many of these startups is there's obvious holes in chat GPT capabilities. They are filling, they are building products that fill those holes and then chat GPT gets better and it kills them. And I don't think that's bad. I think that's good. That's exactly what chat GPT should be doing. It should be getting better and improving. We should not want a world where the first product you launch, you are regulatory locked into never, ever getting better. Okay. So one counterpoint to that argument would be Microsoft office. A lot of their apps win because Microsoft office as a product, as a bundle has more appeal than individual products that are superior. So to analogize it to the present circumstances of the PDF maker could do a better job delivering."
  },
  {
    "file": "45.mp3",
    "seconds": 2640,
    "content": "delivering PDF readability in ChatGPT, again, a product no one on earth actually uses. And in that scenario, ChatGPT and OpenAI ultimately win because they've got the scale even if their product is actually inferior, I guess would be the devil's advocate argument to what you're saying. Does that make sense as a concern? It does, but I will, you know, I think, you know, to take the Microsoft Office 1 head on, which is definitely a case of bundling and hey, we're already paying for Teams, we might as well use it, is just sort of a, you know, a case that Slack has made very sort of vociferously. There's also the bit that I think all these companies stink at actually understanding their customers and solving their problems. I don't get a chat program or a Word document program because, man, you know what my hobby is, Andrew? Hmm, what? Word processing. I just, you know, I just want the, I just really want to, you know- I wasn't sure where you were going with that one. I just want to see the-"
  },
  {
    "file": "46.mp3",
    "seconds": 2700,
    "content": "to see the things on the screen. And you know what? I really go through my word processor to find the one that really is the best. And that's why I use Obscure Product X, because they really think about just 10 percent better than Microsoft Word. Yeah, well, that's fair. I think that that's reasonable. We use office stuff here. After techery or sharp tech in our sort of little empire, we have. Please get all six. Fix the search function. And there's so much easier to build. There's so much stuff that is terrible. I could sit here all day and do a thousand hour podcast on all my irritations and annoyances with with all these apps. We can go through them sort of one by one. No, we're not going to do that. Don't email and ask. You're going to save the thousand hours for the EU regulators out there. Shout out to those guys who suddenly somehow they get 10 minutes of every sharp tech episode. They're ham. What I want. What I watch. What is much worse is when I get in a."
  },
  {
    "file": "47.mp3",
    "seconds": 2760,
    "content": "is when I get in a situation and I'm trying to get something over here into something on another side. And like, how do I tie this together? And this is a big problem that we had when we used to use sort of Google app stuff and then Dropbox and Slack and tie together. It's like, everything is in three different silos and I could probably theoretically create a way for all to work together nicely, but I am busy trying to actually run a business, trying to actually write multiple articles a week, do interviews, interface with a podcast editor, interface with you, interface with an assistant. And I am spending more time trying to figure out how to get this stuff to work, including working with people who are less technical than I am. And it's a waste of time. Look, you get all the Microsoft stuff and the individual experience of using any single one has tons of problems. I can sit here and point them all out, but you know what? You have this article here, guess what? It is in OneDrive and it's saved and you drop a link to me, I open it up and you make a change. Yeah."
  },
  {
    "file": "48.mp3",
    "seconds": 2820,
    "content": "And I, I, I don't like using web apps for various reasons. Lots of things like the email is super easy to do, like as assistants or checking my email and we want to go through stuff that needs to get done and we're, it's in one note and it's sort of all, it just works together. And I, and I will put up with the, you know, this is counter-argued my argument at the beginning, I will put up with all these little nicks and annoyances in the UI, but that's because the job that I care about is not word processing. The job that I care about is getting this podcast out. Like that's the goal. And in my estimation, having it all integrated and, and part of the same experience, that makes sense to me. Exactly. And I think that value of integration is underrated and we're way off, Bob, but that is always my defense is sort of the office bundling strategy. I think that's under, and it's not just a defense of Microsoft. It is an exhortation to the tech industry to figure this shit out. This is what, this is where Google has dropped the ball to an astronomical extent. They built up Google docs to a certain level, and then they just quit."
  },
  {
    "file": "49.mp3",
    "seconds": 2880,
    "content": "just quit. And it's, it's like, it's, it's a fine product, but there there's this gaping hole in the ecosystem to build, to bring in all these best of breed apps and get them to all work together to build sort of the API's into the center. And Google was the obvious candidate to do it. And they just didn't have it in them to do that. They completely abdicated the responsibility. And the reason why apps like Slack or Dropbox get murdered by Microsoft is because of Google because Google didn't actually build up sort of the, the seamlessness and integration and touch points for all these things to plug into so that you could say, look, sure, go with Microsoft. It all will kind of work together or come over here and all this stuff will work together. Once you link it all to your Google apps account, all this sort of thing and tie together. And you know, I mean, I have a story here where one of the reasons I'm, I I'm struggling right now to get the trajectory handle back on YouTube. And the reason is I used to own it. And what happened was I wanted"
  },
  {
    "file": "50.mp3",
    "seconds": 2940,
    "content": "is I wanted to integrate something with Google Docs and Slack, because I wanted to have a channel where I could talk about changes and sort of XYZ. I can't remember exactly what the specification was. And so you looked online and said, yes, this feature is here. We're watching this feature, and they announced it. And I'm like, great. This is the sort of integration I've been waiting for for ages. And so I turned it on. I couldn't get it to work. What's going on? Now, it turned out my trajectory sort of domain on Google was on this old, grandfathered-in Google app sort of thing, like the one that was free for ages and this sort of thing. I'm like, well, OK. It's probably only for the actual real one they actually pay for. And for some reason, I couldn't transfer it. I don't remember what the issue was. It's like, oh, I need to start a new Chatechery account that's a true enterprise account and do it on here. So I stupidly nuked the whole thing and then tried to do it again. And what happened was, actually, they announced the feature, and they never shipped it. And so it never actually ended up working."
  },
  {
    "file": "51.mp3",
    "seconds": 3000,
    "content": "actually ended up working. And in the meantime, this checkery handle on YouTube has got, I lost all these videos on checkery. That's when I shifted to like self-hosting a lot of this sort of stuff. So I'm like, I can't have a dependency sort of elsewhere and like all this sort of stuff. And, and like, again, I can't remember the specific use case. I'm pretty sure it never shipped. I actually ended up talking to someone in one of the companies that explained what the issue was or whatever it was, but that was around the time I switched to Microsoft. I'm like, look, I will deal with the rough edges, at least the stuff works together and you could actually, they will generally keep to what they promise you they're going to deliver, right? Like the whole one throat to choke is exactly what I sort of wanted and needed. We are wildly based out as well. So answer Grant's question B to B and B to C and how to balance the two priorities. So number one, you just have this conflict and you're pursuing the same customers in some respects than your developers. That's always a problem. Uh,"
  },
  {
    "file": "52.mp3",
    "seconds": 3060,
    "content": "problem. Number two, you have a resource conflict, right? I think ChatGPT should be attributing all of their excess GPU capacity to making ChatGPT better, faster, getting more people on a GPT-4 because it's a much better product, right? Any capacity they are allotting to their developers is competing with their consumer product as to what is actually more sort of more compelling. Then just sort of generally speaking, they're competing against Azure. The same APIs end up on Azure that OpenAI makes available, but Azure is bringing to the table that Microsoft guarantee I referred to, the Microsoft-like Salesforce and data all being on sort of Azure for a lot of these enterprise companies. So you're stepping into the same sort of competitive landscape that all these companies have died on once they try to extend beyond startups. Yeah, sure. Startups don't use Azure, but startups, you know,"
  },
  {
    "file": "53.mp3",
    "seconds": 3120,
    "content": "startups, you know, but what happens to all these startups is at some point your business to grow beyond startups. You can't just sell slack to start forever. You have to actually sell it into companies and that's when you hit the Microsoft wall. And so open AI is in some respects setting themselves up to hit the Microsoft wall sort of at some point. And again, they're not owned by them. I'm not saying they should initially make decisions to accommodate Microsoft. I just, I think that the fact that you should be broke out to the extent it did is remarkable. I think that is a opportunity worth pursuing. I think if they pull it off, it will be far more valuable and defensible than sort of this ecosystem. And it actually, I think will free them to like, how many things do they not do or think about where like, Oh, we have developers working on that sort of X, Y, Z to the extent they're throwing the needle is the extent to which they seem willing to kill startups in their ecosystem, right? Which is what they should be doing. But I do worry about a company having mixed incentives and there's a resource issue."
  },
  {
    "file": "54.mp3",
    "seconds": 3180,
    "content": "My whole belief is that if you're in the consumer space being fully integrated, which means not worrying about an API that you have to maintain, or like there's a controversy earlier this year where they were going to kill a particular model and its API, because it was like old, and then there was a big stink raise, which is wait, we're, we built on this API. You can't kill it. And eventually I go, well, we'll maintain in sort of XYZ mode or whatever that's resources and from that you have to, you're, you have to bear and you can't focus on blazing ahead as fast as possible. Look at Apple versus Microsoft. Apple is a consumer company. They push forward, they will abandon stuff like if you like, and that is good. That's what you need in the consumer space. You need to always be pushing forward. What's their suite of products called like pages and, and they're little doesn't matter. No one cares about that crap. I'm talking about like, like, you know, where it'd be about the Max and ,and cutting features and cutting."
  },
  {
    "file": "55.mp3",
    "seconds": 3240,
    "content": "features and cutting support for Intel, which hasn't happened yet, but it's probably gonna happen soon. Like they just, they move forward and they cut ties with the past because cutting ties with the past gives you more freedom of movement. It lets you make a better product because you're not weighed down by decisions that you made before. Go to Windows. You can run a program that was written in 1985 in all likelihood. They, their backwards compatibility is incredible. And that is part of why Microsoft products are clunky because they are trying to maintain this broad-based support and compatibility for stuff that was written decades ago. And that's admirable. That's what they should do because they are asking companies to build software on top of their platforms and to be confident that that software will work for years and years and years. And Microsoft is going to bend over backwards to sort of make it happen. That is the mindset of a developer company. Just the mindset and approach of a developer company has to be fundamentally different than the mindset and approach of a consumer company."
  },
  {
    "file": "56.mp3",
    "seconds": 3300,
    "content": "And my concern is, if I believe, and I do, that there is a consumer opportunity, that OpenAI is uniquely positioned to seize it because of the mindshare that they already have. Every moment and month and year they spend on this developer ecosystem is not just an opportunity cost, but a direct cost on their ability to sort of seize the day, to seize that sort of opportunity. So yes, they're doing great things with the API. That's great. I still am not sure that it's the right thing to do. Interesting. Okay. So as you watch Sam Altman at this Developers Day, do you have a sense that there's recognition on OpenAI's side or is it too early to tell whether they're going the direction you think they should be going? I mean, I don't know. It's hard. It's hard to say. I mean, like I said, they do keep shipping stuff and making chat to be better in a way that obliterates a lot of startups and which I think they should be doing. I think that ideally, if OpenAI were say owned by Microsoft, which I'm glad is not the case."
  },
  {
    "file": "57.mp3",
    "seconds": 3360,
    "content": "is not the case. I want them to be independent and pursue this. But if they were, the obvious answer would be kill the OpenAI API and only have the Azure API. This is like, look, if you're a developer, don't be crazy and build on this. This is going to be stable and changing and could be abandoned. We're Microsoft. You can trust our freaking API. It's not going to go anywhere. We're going to support it for as long as possible. But as long as they're where they are, again, this is where they started, right? So what I'm asking for and hoping for is a fundamental pivot in what they are, is a consumer company and not sort of a developer company. And so I think they're doing the right things by and large. They clearly, they've seized on this space. ChatGPT might've been a demo, but now there's an app and now they're adding the multi-modalities and now they're adding all these sort of capabilities. And so that's good. Could they go further? I think so. And by the way, these, these GPTs thing, I'm skeptical of the current implementation. I think it's just too, it requires too much cognitive."
  },
  {
    "file": "58.mp3",
    "seconds": 3420,
    "content": "cognitive decision-making on the side of the user to be sort of viable. Explain what you mean by these GPTs. No, where you can use other services, like the plug-in replacement, where I want to make a poster. So I go to the Canva GPT and I ask it to make a poster. Again, though, it's this decision-making ahead of time of what you want to do. It's not a universal interface. It's a choice. It's a decision-making interface. Distinct tool. That's right. Yeah, that's right. And so, but generally speaking, so there's two developer issues. There's the API and developers that are building apps on top of the API. Then there's this developer opportunity, which is actually integrating with GPT. And that's a consumer type developer opportunity. That's like apps in an app store, right? It's making the core product sort of better and more functional and accessible. I think that makes more strategic sense from an open AI perspective. I'm skeptical. Again, though, for the reasons I talked about the universal interface, I'm somewhat skeptical how big an opportunity this is."
  },
  {
    "file": "59.mp3",
    "seconds": 3480,
    "content": "how big an opportunity this is going to be. I just think the functionality to make chat GPT actually a dominant and useful thing has to be seamless and fully integrated and kind of invisible to the user. Like to what extent is this sort of choice making stuff gonna matter? But I do think it's a worthwhile thing to experiment with, to try, maybe it ends up being huge. Maybe I sort of missed the boat on this and people will happily choose the sort of appropriate GPT for the task. The real friction though, the real issue for them and the real obstacle and reason to not put all your chips on being a consumer tech company is the biggest friction of all is they don't have hardware, right? You're always gonna have to go to a webpage or on a phone where the modality is much more compelling. You can use the camera, you can talk to it, all these sorts of things. You have to open the app and you have to invoke it. And it's kind of gets, can get in weird states. The phone locks and is it still going and sort of X, Y, Z. You have to like baby it to make sure that I can keep doing it. It's, can they actually be a meaningful consumer service that scales to billions, not just hundreds of millions."
  },
  {
    "file": "60.mp3",
    "seconds": 3540,
    "content": "unless there is hardware involved and that is like hardware companies fail. They fail all the time. Google and Apple seem so dominant. You're always going to carry a phone. There's things that can do that will maintain important for a long time. And that is a reason to sort of hedge your bets. Is it fair to wonder whether they have enough capital to invest in hardware and try to develop something on their own? Yeah, that's an excellent question. I think it's a super important issue, which is what is Microsoft interested in opening? I doing this. I open Microsoft, you know, they're they're putting money in for the compute, which redounds to their products, a chat GPT hardware device doesn't do anything for Microsoft. The whole point is it's going to be nothing but chat GPT, right? So then they have to bring other investors. How do they can they bring in other investors under this crazy structure that they have that isn't sort of like this is where I wish it was a traditional startup. Like I wish for philosophical reasons. I don't I think having to ultimately answer."
  },
  {
    "file": "61.mp3",
    "seconds": 3600,
    "content": "to ultimately answer to shareholders and to be ultimately incentivized by making money is actually a good constraint on companies. I worry that Sam Altman's like, I have no equity, messianic complexes where I'm just doing it for the good of the world are much more terrifying to me than someone wanting to get very rich. Look, the raison d'etre of their company, which is we're going to pursue AGI, but we're going to do it safely, and it's going to be open, which all of which appears to have been abandoned. No, but you talk to them and it's like, what does that mean? It's like, well, we will be in charge of it. Just trust us. Exactly. It's fine. Whatever. Right. Exactly. Again, all lowercase. Always sort of cock your head at the all lowercase folks. But yeah, well, that was my question. No, so how do they raise money to do it? No, it's a totally valid question. It's a big thing. I wish they were just a normal company and they go out and they raise a hundred million dollars or whatever it is, and it's like, like, it may be."
  },
  {
    "file": "62.mp3",
    "seconds": 3660,
    "content": "Like, and maybe you'll do us, they'll probably set up some weird subsidiary that is able to be invested in, like the weird, crazy structure that they have, but like, this is like a hardware division and we're like doing this and we're like, by the way, did we talk about Johnny Ive on this podcast? I wrote about the fact that we did a couple of months ago. Yeah. I mean, this is where this is exactly, you know, Johnny Ives last five to 10 years at Apple were pretty rough. Like he would like all the products had the right form factor, right? Like in the tip over of like, they moved away from utility to like this fantastical view of a computer. What if there was zero ports? Right. I'm sure he could have done it if he would have like, and so the first, this MacBook pro I'm looking at lots of ports, a little bulkier, like, you know, I have an SD card sticking out right here that I used for him the other day. It was great to have the reader there. Like it's a, it's a functional object. I want utility. I don't want an obsession with sort of usability. What is Johnny Ive good at? The reason I think he."
  },
  {
    "file": "63.mp3",
    "seconds": 3720,
    "content": "The reason I think he got stuck in this sort of vortex of making things beautiful when they're already functional is because the functionality had been figured out. Right. But what's the functionality of an AI centric device? Like w how does it actually work? Like we have the idea of you have her, you have this earpiece in, but he never charges it. Like there there's no like wire, like what's it actually connecting to? Is it all self-contained? It like, there's tons of constraints. Like, what does this actually look like? Is it actually just a phone with, with an AirPod? Is it the glasses sort of thing? There's there, there's a real opportunity for exploration and starting from first principles of. If we're starting from scratch and optimizing around this, not being hung up on what came before, not trying to adapt what exists to this new use case, which is what if, if the solution is to adapt the phone to this world, Google and Apple will win. They already dominate that space. If this is ever going to succeed, it's going to be a form factor."
  },
  {
    "file": "64.mp3",
    "seconds": 3780,
    "content": "going to be a form factor that actually makes more sense for the use case and that Apple and Google will never pursue because they're just gonna try to cram into the phone. So that's what Johnny Ive is amazingly gifted at. And I haven't heard any more of those rumors if they're gonna work with them or not. I hope they're true, because I think it's an incredible sort of opportunity and possibility to reimagine what an interface for AI actually looks like. If the goal is this ongoing immersion where suddenly it makes sense to have your calendar as bullet points. Yeah, Johnny Ive, late stages Apple Johnny Ive, correct me if I'm wrong, but one of the things that I think certain artists run into, like with Netflix, for instance, they go out and hire, you know, Martin Scorsese to direct certain things or big name established legends. And then they give them carte blanche to do whatever they want. And there's like no gating function, no editor."
  },
  {
    "file": "65.mp3",
    "seconds": 3840,
    "content": "no editor around to sort of rein in their craziest instincts. And sometimes it works, like the Irishman was great. So no shots at Marty, but a lot of legends end up kind of making mediocre work for under those circumstances. Is that essentially what was happening with Johnny Ive? Yeah, I think so. I think, you know, Steve Jobs was the editor, right? And Steve Jobs and Johnny Ive was the most incredible creative team the tech industry has ever seen. Because you need both. You need the creative thinking and you also need the ability to say no. Say no, yeah. Yeah, and, you know, design, Steve Jobs, famous maxim, design is how it works, you know? And that kind of got forgotten. Like Apple had six years of just horrible laptops. Like the most important computing product in the company and they were terrible. And it was downstream from obsessing over their form instead of their function. And now their laptops are amazing. And I think."
  },
  {
    "file": "66.mp3",
    "seconds": 3900,
    "content": "And I think that's directly connected to Johnny Ives' presence or not. Does a butterfly keyboard get past Steve Jobs? That was the magic. And I think if you only had one or the other, it was more challenging. And you had that situation where when Steve Jobs died, Apple, just from a stock market perspective, investors were like, look, we still have Johnny Ives. And he kind of became the face of, we can still be innovative. This is what we're going to be. And unfortunately, you ended up with $17,000 gold Apple Watches. Well, look, without a doubt, some of the funniest products Apple has dropped on the market came during that three or four year trip through no man's land. Yeah, I mean, we'll always be glad. We can always point to the butterfly keyboard and the $17,000 gold Apple Watch. That's sort of a parting gift. All right. Well, thank you for joining me here on Sharp Tech Dev Day, our entire episode."
  },
  {
    "file": "67.mp3",
    "seconds": 3960,
    "content": "entire episode wound up being dedicated to open AI. We will revisit some of the feedback on AI regulation. We also got some feisty pushback from the real estate agents of the world. Yes, that was great. I'm sad we didn't get to that. I was looking forward to that more than the regulation, but to be totally honest, but we'll hit both. Yes, and we'll circle back next week. Until then, Ben, I hope you have a great weekend and enjoy the Milwaukee Bucks four and two. Nobody believes in them anymore, but hopefully the Sharptech audience will be on the right side of history with that one. Trust the Bucks and do not trust the Boston Celtics. I mean, do you want to be right or do you want to be disappointed? Celtics got their ass kicked by the Sixers tonight. So a great start to the weekend for all of us. All right. I will talk to you next week. Talk to you later."
  },
  {
    "file": "68.mp3",
    "seconds": 4020,
    "content": "you"
  }
]