[
    {
        "timestamp_start_of_possession_seconds": 0.578,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 0, France in possession, possession number 2",
        "description": "First Half, Argentina 0 - 0 France, minute 0, France in possession, possession number 2\nGriezmann kicks off for France, passing 13 yards to Tchouameni in the central defensive half. Tchouameni carries the ball a short distance before attempting a long 62-yard switch pass to Giroud on the opposition's left flank, but it goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 16.423,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 0, Argentina in possession, possession number 3",
        "description": "First Half, Argentina 0 - 0 France, minute 0, Argentina in possession, possession number 3\nMolina of Argentina executes a 14-yard throw-in to De Paul on the defensive right flank. De Paul carries the ball a yard further in the same area. Rabiot from France commits a foul on the opposition's left flank. Consequently, De Paul wins a foul for Argentina on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 31.843,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 0, Argentina in possession, possession number 4",
        "description": "First Half, Argentina 0 - 0 France, minute 0, Argentina in possession, possession number 4\nDe Paul takes a 21-yard free kick on Argentina's defensive right flank, finding Romero. Romero carries the ball 4 yards, then sends a 27-yard pass from the right half space to Otamendi in the central defensive half. Otamendi carries for 6 yards, then passes 22 yards back to Romero. Romero carries a yard, then passes 23 yards to Otamendi on the left half space. Otamendi carries 4 yards, then passes 22 yards to Tagliafico on the left flank. Tagliafico carries 3 yards, then passes 16 yards to MacAllister. MacAllister carries a yard before being fouled by Tchouameni of France."
    },
    {
        "timestamp_start_of_possession_seconds": 61.29,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 1, Argentina in possession, possession number 5",
        "description": "First Half, Argentina 0 - 0 France, minute 1, Argentina in possession, possession number 5\nTagliafico takes a 25-yard free kick on Argentina's defensive left flank, finding Otamendi. Otamendi passes 16 yards to Romero in the central defensive half. Romero carries the ball 14 yards, then passes 20 yards to Otamendi on the defensive half left half space. Otamendi carries 7 yards, then passes 17 yards back to Romero in the central defensive half. Romero carries 10 yards to the defensive half right half space, then passes 24 yards back to Otamendi in the central defensive half. Otamendi carries 3 yards, then sends a 23-yard pass to Martinez in the defensive box. Martinez carries 2 yards, then attempts a 57-yard aerial pass, but it's incomplete on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 90.41,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 1, France in possession, possession number 6",
        "description": "First Half, Argentina 0 - 0 France, minute 1, France in possession, possession number 6\nHernandez recovers the ball on the opposition's left flank. He carries it a short distance before passing to Rabiot. De Paul attempts a block from the defensive right flank but fails. Rabiot receives the pass, holds his position, then returns the ball to Hernandez. Hernandez carries it a yard, then sends a ground pass across the pitch. De Paul commits a foul on the defensive right flank, resulting in Rabiot winning a foul on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 115.993,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 1, France in possession, possession number 7",
        "description": "First Half, Argentina 0 - 0 France, minute 1, France in possession, possession number 7\nHernandez takes a 35-yard free kick from the opposition's left flank, finding Varane in the central defensive half. Varane carries the ball 12 yards within the same area before passing it 24 yards to Kounde on the defensive right flank. Kounde maintains possession, carrying the ball 4 yards before passing it 17 yards to Dembele, who holds position on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 131.124,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 2, Argentina in possession, possession number 8",
        "description": "First Half, Argentina 0 - 0 France, minute 2, Argentina in possession, possession number 8\nTagliafico throws in to MacAllister on Argentina's left flank. MacAllister passes to Messi in the central attacking half. Messi carries briefly, then sends a long pass to Di Maria on the opposition's left flank. Di Maria attempts a cross into the box, but it's incomplete. Rabiot of France clears from the defensive box. De Paul recovers for Argentina in the right half space, carries, then passes back to Messi. Messi carries, then passes to De Paul in the central attacking half. De Paul attempts a through ball to Alvarez in the box, but it's offside."
    },
    {
        "timestamp_start_of_possession_seconds": 181.468,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 3, France in possession, possession number 9",
        "description": "First Half, Argentina 0 - 0 France, minute 3, France in possession, possession number 9\nLloris launches a 64-yard free kick from France's defensive box to Giroud in the attacking half. MacAllister loses a header for Argentina. Giroud quickly passes 8 yards to Griezmann on the right flank. Griezmann carries the ball, maintaining position on the right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 186.108,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 3, Argentina in possession, possession number 10",
        "description": "First Half, Argentina 0 - 0 France, minute 3, Argentina in possession, possession number 10\nMacAllister recovers the ball on Argentina's defensive left flank, passes to Otamendi. Otamendi carries it a few yards, then sends a 15-yard pass to Romero. Romero carries briefly, then launches a 39-yard aerial pass to Messi in the central attacking half. Upamecano fouls Messi, giving Argentina a free kick."
    },
    {
        "timestamp_start_of_possession_seconds": 219.15,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 3, Argentina in possession, possession number 11",
        "description": "First Half, Argentina 0 - 0 France, minute 3, Argentina in possession, possession number 11\nDe Paul kicks off with a free kick from the central attacking half, finding Otamendi in the defensive half. Otamendi passes to Fernandez in the central defensive half. Fernandez carries, then sends a long pass to Romero on the right. Romero carries, then passes to Molina on the opposition's right flank. Molina's ground pass to Messi is intercepted by Tchouameni. Rabiot recovers for France, but Messi quickly regains possession. Messi carries, then passes back to Romero. Romero carries, then launches a long pass to Di Maria on the opposition's left flank. Di Maria passes to Tagliafico, who finds MacAllister. MacAllister passes back to Di Maria, who carries and attempts a dribble. Kounde fails to tackle, leaving Di Maria in possession."
    },
    {
        "timestamp_start_of_possession_seconds": 253.891,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 4, Argentina in possession, possession number 12",
        "description": "First Half, Argentina 0 - 0 France, minute 4, Argentina in possession, possession number 12\nTagliafico, from Argentina, executes a 17-yard throw-in to MacAllister on the opposition's left flank. MacAllister carries the ball 6 yards further along the same flank. He then attempts a 28-yard aerial pass towards Messi in the central attacking half, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 259.139,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 4, France in possession, possession number 13",
        "description": "First Half, Argentina 0 - 0 France, minute 4, France in possession, possession number 13\nMbappe recovers the ball in France's central defensive half. He carries it a short distance before passing it 18 yards to Rabiot, still in the central defensive half. Rabiot carries the ball into the defensive half left half space, then sends a 20-yard pass down the defensive left flank to Hernandez. Hernandez's ground pass to Rabiot is incomplete. \n\nMessi recovers the ball for Argentina on the opposition right flank and passes to De Paul. De Paul carries the ball 23 yards into the central attacking half, but his aerial pass to Di Maria on the opposition left flank is incomplete. \n\nKounde recovers the ball for France on the defensive right flank and heads it to Dembele. Kounde receives the ball back from Dembele and passes it to Griezmann, still on the defensive right flank. Griezmann's aerial pass into the defensive half right half space is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 278.391,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 4, Argentina in possession, possession number 14",
        "description": "First Half, Argentina 0 - 0 France, minute 4, Argentina in possession, possession number 14\nJulian Alvarez of Argentina recovers the ball, covering 7 yards in the attacking half left half space. He passes to Alexis MacAllister. MacAllister carries the ball forward 9 yards in the same area. He takes a shot, but it's saved."
    },
    {
        "timestamp_start_of_possession_seconds": 289.234,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 4, France in possession, possession number 15",
        "description": "First Half, Argentina 0 - 0 France, minute 4, France in possession, possession number 15\nLloris attempts a long aerial pass from the defensive box, but it's incomplete. Romero clears for Argentina. MacAllister recovers the ball and carries it a short distance. Griezmann loses a tackle for France, Fernandez recovers for Argentina. Rabiot recovers for France, carries the ball a yard, then passes to Upamecano. Upamecano carries, then sends a long pass to Hernandez on the left flank. Hernandez carries, passes to Mbappe, who returns the pass. Hernandez passes to Upamecano, who carries and passes to Tchouameni. Tchouameni's long ground pass is intercepted by Tagliafico. Kounde recovers for France, passes to Lloris, who passes to Varane. Varane carries, passes to Upamecano, who carries and passes to Hernandez. Hernandez carries, dribbles past Fernandez, carries again, and passes to Kounde. Kounde carries, passes to Varane, who passes to Hernandez. Messi commits a foul on Hernandez, who wins the foul for France."
    },
    {
        "timestamp_start_of_possession_seconds": 359.455,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 5, France in possession, possession number 16",
        "description": "First Half, Argentina 0 - 0 France, minute 5, France in possession, possession number 16\nRabiot of France takes a free kick from the central defensive half, sending it 29 yards to Dembele on the defensive right flank. Dembele passes it 21 yards to Kounde, who carries it 6 yards before passing it 14 yards to Varane. Varane carries it 23 yards, then passes 8 yards to Upamecano. Upamecano carries it 8 yards, then passes it 18 yards back to Varane. Varane carries it 13 yards, then passes it 24 yards back to Upamecano. Upamecano passes it 13 yards back to Varane, who carries it 17 yards before passing it 25 yards back to Upamecano. Upamecano passes it 46 yards to Dembele on the defensive right flank. Dembele passes it 9 yards to Griezmann, who carries it 6 yards before passing it 14 yards to Tchouameni. Tchouameni carries it 35 yards to the opposition left flank, then passes it 8 yards to Rabiot. Rabiot carries it 3 yards before being fouled by Alvarez of Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 410.482,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 6, France in possession, possession number 17",
        "description": "First Half, Argentina 0 - 0 France, minute 6, France in possession, possession number 17\nRabiot kicks a 13-yard free kick from France's defensive left flank to Tchouameni in the defensive half left half space. Tchouameni carries the ball 7 yards within the same area, then passes it 24 yards to Varane in the central defensive half. Varane advances 21 yards into the attacking half right half space, but his ambitious 54-yard switch pass to the opposition's left flank is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 424.008,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 7, Argentina in possession, possession number 18",
        "description": "First Half, Argentina 0 - 0 France, minute 7, Argentina in possession, possession number 18\nDe Paul intercepts for Argentina, passing to Molina who fails to complete his pass. Upamecano recovers for France. Fernandez recovers for Argentina, carries, and passes to Messi. Messi carries and passes to MacAllister. MacAllister carries, dribbles past Kounde, and passes to Di Maria. Di Maria carries and passes back to MacAllister. MacAllister carries and passes to Fernandez. Fernandez's pass is intercepted by Griezmann. Fernandez tackles Griezmann, Alvarez recovers and passes to Di Maria. Di Maria dribbles past Kounde, carries, and passes to De Paul. De Paul's shot is blocked by Varane."
    },
    {
        "timestamp_start_of_possession_seconds": 502.688,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 8, Argentina in possession, possession number 19",
        "description": "First Half, Argentina 0 - 0 France, minute 8, Argentina in possession, possession number 19\nMessi of Argentina takes a corner from the opposition's right flank into the box. Griezmann of France clears it. De Paul recovers for Argentina, passing to Messi on the right flank. Messi carries the ball, maintaining position. Griezmann loses a tackle on the defensive left. Messi recovers again, passing to De Paul on the right flank. De Paul carries the ball, but his cross into the box is incomplete. Romero of Argentina loses a header in the opposition box. Rabiot of France clears it. Romero commits a foul in the opposition box, which Lloris of France wins. Lloris is injured, causing a stoppage, as is Martinez of Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 664.971,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 11, France in possession, possession number 20",
        "description": "First Half, Argentina 0 - 0 France, minute 11, France in possession, possession number 20\nLloris kicks a 74-yard free kick from France's defensive box to Giroud in the attacking half. Giroud passes 15 yards to the opposition right flank. MacAllister from Argentina loses a header in the defensive half. Tagliafico recovers, passing 22 yards to Alvarez. Dembele of France loses a header on the opposition right flank. Rabiot recovers, passing 14 yards to Griezmann. Griezmann heads a 7-yard pass to Giroud, who fails to complete a 10-yard header in the central attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 676.43,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 11, Argentina in possession, possession number 21",
        "description": "First Half, Argentina 0 - 0 France, minute 11, Argentina in possession, possession number 21\nRomero recovers the ball in Argentina's central defensive half, carries it a short distance, but his pass to Fernandez is intercepted by Griezmann. Romero blocks an attempt in the defensive half left space, leading to De Paul's recovery and pass to MacAllister. MacAllister and Di Maria exchange passes, moving the ball to the defensive left flank. Tagliafico and Otamendi continue the play, ending with a pass to Martinez in the defensive box. Romero receives a pass from Martinez, sends it to Fernandez who carries it towards the right half space. Fernandez's long aerial pass to Alvarez is incomplete. Varane recovers for France, but his pass is intercepted by Molina. Fernandez carries the ball, passes to De Paul who finds Messi in the central attacking half. Messi's long pass to Di Maria on the left flank is followed by an incomplete cross. After a brief interception by Tchouameni, Di Maria recovers the ball, carries it, and passes to De Paul. De Paul's pass to Messi is blocked by Rabiot, leading to a clearance by Hernandez. Alvarez blocks an attempt but commits a foul in the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 756.23,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 12, France in possession, possession number 22",
        "description": "First Half, Argentina 0 - 0 France, minute 12, France in possession, possession number 22\nLloris kicks a free 70-yarder from France's defensive box to the central attacking half. Otamendi recovers for Argentina, moving 39 yards into the attacking half. Varane regains possession for France, carries a yard, then passes 28 yards to Griezmann on the right flank. Griezmann carries 3 yards, passes 11 yards to Kounde. Kounde carries 6 yards, passes 18 yards to Dembele. Dembele carries 2 yards, dribbles, recovers from MacAllister's failed tackle, carries 15 yards, then passes a long 47-yarder to Hernandez. Hernandez carries 2 yards, passes 7 yards to Mbappe. Mbappe carries 5 yards, passes 9 yards to Rabiot. Rabiot's 17-yard pass to Mbappe in the box is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 804.189,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 13, Argentina in possession, possession number 23",
        "description": "First Half, Argentina 0 - 0 France, minute 13, Argentina in possession, possession number 23\nMartinez starts the play with a 25-yard pass from the defensive box to Otamendi in the defensive half. Otamendi then passes to Fernandez, who returns the ball back to him. Otamendi carries the ball a short distance before launching a 31-yard pass to Romero in the defensive box. Romero carries the ball and sends a long 43-yard pass to Alvarez in the central defensive half. Alvarez heads the ball to Messi, who returns the favor with another headed pass. Alvarez then passes to Messi again. \n\nMeanwhile, Upamecano from France loses a header in the attacking half. Argentina's MacAllister recovers the ball and sends it to Di Maria on the opposition's left flank. Di Maria dribbles past Rabiot, carries the ball, and sends a long cross-field pass to Messi. Messi carries the ball towards the opposition box but his pass to Alvarez is intercepted and cleared by Kounde. Tagliafico recovers the ball for Argentina and passes to Di Maria in the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 866.466,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 14, France in possession, possession number 24",
        "description": "First Half, Argentina 0 - 0 France, minute 14, France in possession, possession number 24\nLloris launches a 64-yard free kick from France's defensive box to Giroud on the opposition's right flank. Otamendi of Argentina loses a header on their defensive left. Giroud passes 16 yards to Dembele, still on the right flank. Dembele carries the ball a short distance, then passes it back to Giroud. Giroud holds position, then sends a 12-yard pass to Griezmann. Griezmann carries the ball 4 yards into the attacking half, then starts a dribble."
    },
    {
        "timestamp_start_of_possession_seconds": 874.981,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 14, Argentina in possession, possession number 25",
        "description": "First Half, Argentina 0 - 0 France, minute 14, Argentina in possession, possession number 25\nFernandez wins a tackle in Argentina's defensive left half. Alvarez recovers the ball, carries it for 2 yards, then passes it to De Paul in the central defensive half. De Paul carries it 9 yards, then sends a 19-yard pass to MacAllister in the attacking left half. MacAllister carries it 3 yards, then passes to Di Maria on the opposition's left flank. Di Maria carries it 3 yards, then sends a 21-yard pass to Tagliafico in the defensive left flank. Tagliafico carries it 2 yards, then passes back to MacAllister on the opposition's left flank. MacAllister carries it 4 yards, then sends an 18-yard pass to Fernandez in the central defensive half. Fernandez carries it 4 yards, then sends a long 36-yard pass to Molina on the opposition's right flank. Molina passes to Romero in the defensive right half. Romero carries it 4 yards, then sends a 32-yard pass to Otamendi in the defensive left half. Otamendi carries it 12 yards, then sends a 23-yard pass to Di Maria on the opposition's left flank. Di Maria carries it a yard, then passes to Tagliafico on the same flank. Tagliafico passes to Fernandez in the defensive left flank. Fernandez passes to Otamendi in the defensive left half. Otamendi carries it a yard, then passes to Fernandez. Fernandez sends a 19-yard pass to Romero in the central defensive half. Romero carries it 12 yards, then sends a long 52-yard pass to Di Maria on the opposition's left flank. Di Maria passes to Otamendi in the defensive left flank. Otamendi carries it 5 yards, then attempts a switch pass out of play to Molina on the opposition's right flank, but it's too long."
    },
    {
        "timestamp_start_of_possession_seconds": 943.025,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 15, France in possession, possession number 26",
        "description": "First Half, Argentina 0 - 0 France, minute 15, France in possession, possession number 26\nHernandez initiates with an 8-yard throw-in to Rabiot on France's defensive left flank. Rabiot passes 14 yards to Upamecano, who carries the ball 6 yards further. Upamecano then sends an 18-yard pass to Varane in the central defensive half. Varane carries the ball 26 yards to the right half space, then passes 15 yards to Kounde on the right flank. Kounde carries 3 yards before launching a 38-yard pass back to Upamecano in the central defensive half. Upamecano carries 3 yards, then sends a 31-yard pass to Hernandez on the left flank. Hernandez carries 4 yards, but his 5-yard ground pass to Mbappe is incomplete. De Paul intercepts for Argentina on their right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 970.569,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 16, Argentina in possession, possession number 27",
        "description": "First Half, Argentina 0 - 0 France, minute 16, Argentina in possession, possession number 27\nMessi recovers the ball on the opposition's right flank. He carries it 4 yards into the attacking half right half space. Messi then passes the ball 21 yards to De Paul in the opposition box. De Paul returns a 12-yard pass to Messi in the same area. Di Maria recovers the ball in the opposition box and takes a shot, but it's off target."
    },
    {
        "timestamp_start_of_possession_seconds": 1010.313,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 16, France in possession, possession number 28",
        "description": "First Half, Argentina 0 - 0 France, minute 16, France in possession, possession number 28\nLloris kicks a 61-yard goal from the defensive box to the attacking half. Griezmann loses a header. MacAllister recovers for Argentina, moving 29 yards. Varane recovers the ball for France, carries it 10 yards, then passes 15 yards to Upamecano. Upamecano holds, then passes back to Varane. Varane carries 12 yards, then sends a 31-yard pass to Dembele. Dembele carries 13 yards, passes 14 yards to Rabiot. Rabiot carries 8 yards, then sends a long 41-yard pass to Hernandez. Hernandez carries 2 yards, passes 11 yards to Mbappe. Mbappe carries 2 yards, passes back to Hernandez. Hernandez carries 11 yards, passes 14 yards to Upamecano. Upamecano carries 4 yards, sends a long 34-yard pass to Varane. Varane carries 17 yards, passes 15 yards to Kounde. Kounde carries 2 yards, passes 15 yards to Dembele. Dembele carries 2 yards, passes 8 yards to Kounde. Kounde holds, then passes 18 yards to Dembele. Dembele carries 10 yards, but his action is incomplete. MacAllister blocks for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 1078.049,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 17, France in possession, possession number 29",
        "description": "First Half, Argentina 0 - 0 France, minute 17, France in possession, possession number 29\nKounde throws in from the opposition's right flank, finding Varane in the attacking half. Varane carries the ball a short distance before passing it centrally to Upamecano. Upamecano advances, then sends a long pass to Hernandez on the opposition's left flank. Hernandez holds position, then passes to Mbappe. Mbappe returns the ball to Hernandez, who carries it further down the flank. Suddenly, De Paul from Argentina commits a foul on Hernandez, who wins a free kick for France."
    },
    {
        "timestamp_start_of_possession_seconds": 1141.54,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 19, France in possession, possession number 30",
        "description": "First Half, Argentina 0 - 0 France, minute 19, France in possession, possession number 30\nGriezmann takes a 30-yard free kick from the opposition's left flank, aiming for the box. In the ensuing chaos, Giroud commits a foul in the opposition box. Play shifts as Di Maria wins a foul in Argentina's defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 1162.128,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 19, Argentina in possession, possession number 31",
        "description": "First Half, Argentina 0 - 0 France, minute 19, Argentina in possession, possession number 31\nMartinez kicks off with a 12-yard free kick to Romero in Argentina's defensive box. Romero passes to Fernandez, moving the ball 15 yards into the central defensive half. Fernandez carries the ball a short distance before passing it 25 yards to Otamendi on the left. Otamendi carries, then passes to Tagliafico, who returns the ball. Otamendi then sends a long 28-yard pass to Romero in the central defensive half. \n\nRomero carries the ball to the right, passing to De Paul, who returns the ball. Romero then sends a 24-yard pass to Molina on the right flank. Molina passes to De Paul, who sends a long 38-yard pass across the pitch to Otamendi. \n\nOtamendi carries the ball 22 yards up the left flank, passing to Di Maria. Di Maria passes back to Otamendi, who sends the ball back to the central defensive half to Romero. Romero carries, then passes to De Paul, who returns the ball. Romero then sends a 21-yard pass to Otamendi on the left. \n\nOtamendi carries, then passes to Fernandez in the central defensive half. Fernandez sends a long 27-yard pass to Messi in the attacking half. Messi carries the ball 20 yards up the right flank, passing to Molina. Molina passes to De Paul, who sends a long 35-yard pass to Otamendi in the central attacking half. \n\nOtamendi carries, then passes to Fernandez, who returns the ball. Otamendi then sends a 10-yard pass to Fernandez on the left. Fernandez sends the ball back to the central defensive half to Romero. Romero carries, then sends a 19-yard pass to De Paul on the right flank. De Paul passes to Fernandez in the attacking half. \n\nFernandez carries the ball, but is tackled by Giroud. MacAllister recovers the ball, passing to Alvarez. Alvarez sends a long 40-yard pass to Di Maria on the left flank. Di Maria dribbles past Dembele, carrying the ball 10 yards into the opposition box. Dembele concedes a penalty, giving Argentina a chance to score."
    },
    {
        "timestamp_start_of_possession_seconds": 1344.114,
        "possession_details": "First Half, Argentina 0 - 0 France, minute 22, Argentina in possession, possession number 32",
        "description": "First Half, Argentina 0 - 0 France, minute 22, Argentina in possession, possession number 32\nLionel Messi of Argentina confidently scores a penalty goal from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 1420.42,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 23, France in possession, possession number 33",
        "description": "First Half, Argentina 1 - 0 France, minute 23, France in possession, possession number 33\nGiroud kicks off, passing to Rabiot in France's central defensive half. Rabiot sends a 13-yard pass to Tchouameni, who carries the ball 4 yards. Tchouameni then passes to Kounde on the defensive right flank. Kounde carries the ball a short distance before passing to Varane in the defensive half right half space. Varane carries the ball 6 yards, then sends a long 40-yard pass to Hernandez on the defensive left flank. Hernandez attempts a 59-yard aerial pass to Mbappe on the opposition's left flank, but it's incomplete. Romero of Argentina clears the ball from the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 1443.362,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 24, France in possession, possession number 34",
        "description": "First Half, Argentina 1 - 0 France, minute 24, France in possession, possession number 34\nMbappe executes a 13-yard throw-in to Rabiot on the opposition's left flank. Rabiot carries the ball a short distance before passing it back to Mbappe. Mbappe then advances 9 yards, but his 23-yard ground pass into the opposition box is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 1453.985,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 24, Argentina in possession, possession number 35",
        "description": "First Half, Argentina 1 - 0 France, minute 24, Argentina in possession, possession number 35\nRomero recovers the ball in Argentina's defensive box, carries it a short distance, then passes it 13 yards to Di Maria in the central defensive half. Di Maria carries it a few yards, outmaneuvers Tchouameni, and continues his run. Alvarez receives a pass, then sends it 15 yards to MacAllister. MacAllister carries the ball 8 yards towards the left flank, then passes it 20 yards to Tagliafico. Tagliafico's action is incomplete due to a block by Dembele."
    },
    {
        "timestamp_start_of_possession_seconds": 1492.417,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 24, Argentina in possession, possession number 36",
        "description": "First Half, Argentina 1 - 0 France, minute 24, Argentina in possession, possession number 36\nTagliafico of Argentina executes a 16-yard throw-in from the defensive left flank, finding teammate MacAllister."
    },
    {
        "timestamp_start_of_possession_seconds": 1493.492,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 24, France in possession, possession number 37",
        "description": "First Half, Argentina 1 - 0 France, minute 24, France in possession, possession number 37\nTchouameni of France intercepts on the opposition's right flank. He holds position, not gaining yards. Attempts a short pass to Kounde, but it's incomplete. Alvarez of Argentina intercepts on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 1500.941,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 25, France in possession, possession number 38",
        "description": "First Half, Argentina 1 - 0 France, minute 25, France in possession, possession number 38\nVarane initiates with a 20-yard throw-in to Upamecano on the defensive right flank. Upamecano carries the ball 15 yards towards the defensive half right half space. He then passes 6 yards to Rabiot in the central defensive half. Rabiot carries the ball 5 yards back to the defensive half right half space, then sends a 12-yard pass to Tchouameni. Tchouameni shifts the play to the defensive right flank, then launches a 19-yard pass to Dembele on the opposition right flank. Unfortunately, Dembele's 10-yard ground pass to Rabiot is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 1517.885,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 25, Argentina in possession, possession number 39",
        "description": "First Half, Argentina 1 - 0 France, minute 25, Argentina in possession, possession number 39\nAlvarez recovers the ball on the opposition's left flank, passes to MacAllister. MacAllister carries it 4 yards, then passes to Fernandez. Fernandez sends it to Tagliafico, who carries it a yard before passing to Di Maria. Di Maria dribbles past Dembele, carries the ball 12 yards but his pass to MacAllister is intercepted by Rabiot. Dembele recovers, passes to Giroud who carries it 2 yards before being fouled by Romero."
    },
    {
        "timestamp_start_of_possession_seconds": 1608.448,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 26, France in possession, possession number 40",
        "description": "First Half, Argentina 1 - 0 France, minute 26, France in possession, possession number 40\nGriezmann fires a free kick from the right half space, aiming for the opposition box. Giroud loses a header in the opposition box. Romero clears the ball from Argentina's defensive box. Hernandez commits a foul in the central attacking half. Messi wins a foul in Argentina's defensive half. Play stops for injuries to Hernandez and Messi. Messi is taken off the field."
    },
    {
        "timestamp_start_of_possession_seconds": 1698.355,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 28, Argentina in possession, possession number 41",
        "description": "First Half, Argentina 1 - 0 France, minute 28, Argentina in possession, possession number 41\nMartinez of Argentina launches a 64-yard free kick from the central defensive half to the opposition's right flank, finding Alvarez. Messi enters the game for Argentina. Alvarez loses a header on the opposition's right flank. Hernandez of France recovers, moving the ball 16 yards from the defensive left flank to the defensive half left half space. Fernandez of Argentina recovers the ball in the attacking half right half space, carries it 4 yards, then passes it 17 yards to Messi on the opposition's right flank. Messi carries the ball 32 yards along the same flank, then starts a dribble. Hernandez attempts a tackle but fails."
    },
    {
        "timestamp_start_of_possession_seconds": 1742.137,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 29, Argentina in possession, possession number 42",
        "description": "First Half, Argentina 1 - 0 France, minute 29, Argentina in possession, possession number 42\nMessi of Argentina delivers a corner from the opposition's right flank into the box. Giroud of France clears it from the defensive box. Alexis MacAllister from Argentina blocks in the opposition box. Messi, again from Argentina, is caught offside on the opposition's right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 1778.625,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 29, France in possession, possession number 43",
        "description": "First Half, Argentina 1 - 0 France, minute 29, France in possession, possession number 43\nLloris launches a 64-yard free kick from the defensive left flank to Kounde in the central attacking half. Kounde heads a 21-yard pass to Dembele in the attacking half right half space. Dembele carries, but his 7-yard ground pass to Griezmann in the same area is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 1783.765,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 29, Argentina in possession, possession number 44",
        "description": "First Half, Argentina 1 - 0 France, minute 29, Argentina in possession, possession number 44\nMacAllister intercepts, passes to Tagliafico. Tagliafico finds Fernandez, who carries forward before sending a long pass to Molina. Molina carries it up the right, passes to Alvarez in the center. Alvarez feeds Messi, who carries, then finds MacAllister on the left. MacAllister advances, passes to Di Maria on the flank. Di Maria's cross goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 1825.286,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 30, France in possession, possession number 45",
        "description": "First Half, Argentina 1 - 0 France, minute 30, France in possession, possession number 45\nHernandez of France executes a 28-yard throw-in to Giroud on the defensive left flank. Fernandez from Argentina loses a header on the opposition right flank. Giroud passes to Mbappe, a short 9-yard pass, still on the defensive left flank. Molina recovers for Argentina, moving 14 yards from the opposition right flank to the attacking half right half space, passing to Alvarez. Alvarez loses a header in the attacking half right half space. Tchouameni recovers for France, moving 12 yards to the defensive left flank, passing to Giroud. Molina loses another header on the opposition right flank. Giroud passes again to Mbappe, another 9-yard pass on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 1832.654,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 30, Argentina in possession, possession number 46",
        "description": "First Half, Argentina 1 - 0 France, minute 30, Argentina in possession, possession number 46\nEnzo Fernandez intercepts the ball on the opposition's right flank. He carries it 40 yards to the attacking half left half space. Fernandez passes to Nicolas Tagliafico on the opposition's left flank. Tagliafico carries the ball 5 yards, then passes it 31 yards to Nicolas Otamendi on the defensive left flank. Otamendi carries the ball 9 yards, then passes it 24 yards to Emiliano Martinez in the defensive box. Martinez carries the ball 2 yards, then passes it 16 yards to Cristian Romero. Romero carries the ball 11 yards, then passes it 17 yards to Rodrigo De Paul. De Paul dribbles past Adrien Rabiot, carries the ball 7 yards, then passes it 8 yards to Lionel Messi. Messi passes the ball 23 yards back to De Paul on the opposition's right flank. De Paul dribbles past Theo Hernandez, recovers the ball, and passes it 10 yards to Messi. Messi carries the ball 1 yard, then passes it 28 yards to Alexis MacAllister. MacAllister carries the ball 2 yards, then passes it 14 yards to Messi. Messi carries the ball 12 yards, then passes it 47 yards to Angel Di Maria on the opposition's left flank. Di Maria carries the ball 9 yards, then passes it 17 yards to MacAllister. MacAllister carries the ball 2 yards, then passes it 9 yards to Enzo Fernandez. Fernandez carries the ball 1 yard, then passes it 16 yards back to MacAllister. MacAllister passes the ball 18 yards to Nicolas Tagliafico. Tagliafico passes the ball 10 yards back to MacAllister, who takes a shot from the attacking half left half space."
    },
    {
        "timestamp_start_of_possession_seconds": 1924.504,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 32, France in possession, possession number 47",
        "description": "First Half, Argentina 1 - 0 France, minute 32, France in possession, possession number 47\nTheo Hernandez of France executes a 27-yard throw-in from the defensive left flank, finding teammate Kylian Mbappe in the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 1926.316,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 32, Argentina in possession, possession number 48",
        "description": "First Half, Argentina 1 - 0 France, minute 32, Argentina in possession, possession number 48\nMolina recovers the ball on Argentina's right flank, passing it to Messi. Messi carries it 34 yards into the central attacking half. Upamecano loses a tackle for France, and MacAllister recovers for Argentina. MacAllister carries the ball a yard, then passes to Fernandez. Fernandez carries it 4 yards, then passes to Alvarez on the right half space. Alvarez returns the pass to Fernandez, who then sends a 20-yard pass to De Paul on the right flank. De Paul carries it 2 yards, then attempts a cross to Di Maria in the box, but it's incomplete. Kounde clears for France, and Dembele recovers, carrying it 33 yards to the central defensive half. Otamendi recovers for Argentina, carries it 2 yards, then passes to Romero. Romero carries it 7 yards, then passes to De Paul. De Paul passes to Fernandez in the central attacking half. Fernandez carries it 6 yards, then passes to Otamendi. Otamendi sends a 24-yard pass to Tagliafico on the left flank. Tagliafico carries it 2 yards, then passes to Di Maria. Di Maria carries it 2 yards, then passes to MacAllister. MacAllister carries it 5 yards, maintaining possession on the left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 1979.699,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 32, France in possession, possession number 49",
        "description": "First Half, Argentina 1 - 0 France, minute 32, France in possession, possession number 49\nKounde of France executes a 20-yard throw-in from the defensive right flank, finding Giroud in the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 1981.273,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 33, Argentina in possession, possession number 50",
        "description": "First Half, Argentina 1 - 0 France, minute 33, Argentina in possession, possession number 50\nTagliafico intercepts for Argentina on the left flank, quickly passing to MacAllister who carries forward. MacAllister finds Di Maria with a short pass, but the play is disrupted by Dembele's recovery for France. \n\nTagliafico regains possession with a tackle, carries, but his pass to Alvarez is incomplete. Varane recovers for France, but Otamendi intercepts for Argentina. \n\nThe ball is worked back to Argentina's goalkeeper, Martinez, who passes to Molina on the right flank. Molina and De Paul exchange passes, moving the ball centrally to Fernandez. \n\nFernandez launches a long pass to Molina on the right flank, who finds De Paul. De Paul's pass to Romero initiates a series of passes between Romero, Otamendi, and Fernandez, maintaining possession in Argentina's defensive half. \n\nDe Paul then sends a long pass to Otamendi on the left flank. Otamendi and Fernandez exchange passes before Fernandez finds Romero centrally. Romero passes to De Paul, who sends a long ball to Messi on the right flank. \n\nMessi carries, then sends a cross-field pass to Di Maria on the left flank. Di Maria carries and passes to Fernandez, who finds Tagliafico. Tagliafico and Fernandez exchange passes before Fernandez sends a long pass back to Romero. \n\nRomero finds Martinez, who passes to Otamendi. Otamendi and Martinez exchange passes before Martinez finds Romero. Romero passes to Molina on the right flank, but the ball goes out of play, ending the possession."
    },
    {
        "timestamp_start_of_possession_seconds": 2101.859,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 35, France in possession, possession number 51",
        "description": "First Half, Argentina 1 - 0 France, minute 35, France in possession, possession number 51\nHernandez throws in to Mbappe on France's left flank. Mbappe carries the ball, dribbles past Romero of Argentina. Molina recovers for Argentina in the box, passes to Martinez. Martinez's aerial pass from the box is incomplete. Upamecano recovers for France on the left flank, carries the ball, but his aerial pass is also incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 2112.89,
        "possession_details": "First Half, Argentina 1 - 0 France, minute 35, Argentina in possession, possession number 52",
        "description": "First Half, Argentina 1 - 0 France, minute 35, Argentina in possession, possession number 52\nMolina recovers the ball on Argentina's defensive right flank, advancing 20 yards before passing to MacAllister. MacAllister, stationed in the defensive half right half space, sends a 12-yard pass to Messi. Messi holds the ball momentarily before threading a 12-yard pass to Alvarez on the opposition's right flank. Alvarez carries the ball a yard before launching a 38-yard pass to MacAllister in the attacking half right half space. MacAllister then delivers a 26-yard pass into the opposition box, where Di Maria scores."
    },
    {
        "timestamp_start_of_possession_seconds": 2213.175,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 36, France in possession, possession number 53",
        "description": "First Half, Argentina 2 - 0 France, minute 36, France in possession, possession number 53\nGiroud kicks off from the central attacking half, passing to Tchouameni in the central defensive half. Tchouameni sends a long pass to Mbappe on the defensive left flank. Mbappe carries the ball upfield, then passes to Upamecano in the central defensive half. Upamecano briefly carries before passing back to Tchouameni. Tchouameni advances towards the defensive right flank, but is fouled by Alvarez of Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 2234.048,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 37, France in possession, possession number 54",
        "description": "First Half, Argentina 2 - 0 France, minute 37, France in possession, possession number 54\nTchouameni of France takes a 19-yard free kick from the defensive right flank, finding Dembele on the opposition's right flank. Dembele then carries the ball another 8 yards along the same flank."
    },
    {
        "timestamp_start_of_possession_seconds": 2237.179,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 37, Argentina in possession, possession number 55",
        "description": "First Half, Argentina 2 - 0 France, minute 37, Argentina in possession, possession number 55\nTagliafico wins a tackle on Argentina's defensive left flank, carries for 3 yards, then passes to Di Maria. Di Maria sends an 11-yard pass to Fernandez. Fernandez holds, then passes to MacAllister. MacAllister carries for 9 yards, then passes to Fernandez in the defensive half left half space. Fernandez carries for a yard, then sends an 18-yard pass to Messi in the central defensive half. Messi passes to De Paul, who passes to Otamendi. Otamendi carries for a yard, then sends a 23-yard pass to Romero. Romero holds, then passes to Fernandez. Fernandez carries for a yard, then sends a 20-yard pass to Otamendi. Otamendi carries for a yard, then passes to Tagliafico. Tagliafico carries for 3 yards, then passes to Otamendi. Otamendi carries for 2 yards, then passes to Tagliafico. Tagliafico carries for a yard, then sends a 16-yard pass to MacAllister. MacAllister carries for 3 yards before being fouled by Kounde of France."
    },
    {
        "timestamp_start_of_possession_seconds": 2292.836,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 38, Argentina in possession, possession number 56",
        "description": "First Half, Argentina 2 - 0 France, minute 38, Argentina in possession, possession number 56\nDi Maria launches a 57-yard free kick from Argentina's defensive left flank to the defensive right flank, finding Molina. Molina then passes 15 yards to De Paul in the central defensive half. De Paul carries the ball 2 yards into the defensive half right half space, before passing 17 yards back to Romero in the central defensive half. Romero holds position, then sends a 12-yard pass to Fernandez, still in the central defensive half. Fernandez attempts a 14-yard ground pass to De Paul in the defensive half right half space, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 2302.192,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 38, France in possession, possession number 57",
        "description": "First Half, Argentina 2 - 0 France, minute 38, France in possession, possession number 57\nHernandez recovers the ball, moving it 12 yards from the left attacking half to the center. He passes to Griezmann. Griezmann heads the ball 15 yards to Mbappe on the left. Mbappe carries it 12 yards to the opposition's left flank, then passes 13 yards to Rabiot. Rabiot holds position. Romero of Argentina intercepts, carries 9 yards, then passes 25 yards to Messi on the right. Messi advances 17 yards before Upamecano tackles, carries 9 yards, then passes 39 yards to Lloris. Lloris moves 6 yards, passes 22 yards to Varane. Varane carries 24 yards, passes 12 yards to Griezmann. Griezmann passes 23 yards to Kounde. Kounde moves a yard, passes 7 yards to Varane. Varane moves 2 yards, passes 19 yards to Tchouameni. Tchouameni advances 8 yards, passes 15 yards to Varane. Varane carries 13 yards, passes 16 yards to Kounde. Kounde holds position, passes 16 yards to Griezmann. Griezmann's 5-yard pass to Mbappe is blocked by MacAllister."
    },
    {
        "timestamp_start_of_possession_seconds": 2346.912,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 39, Argentina in possession, possession number 58",
        "description": "First Half, Argentina 2 - 0 France, minute 39, Argentina in possession, possession number 58\nDi Maria recovers the ball on Argentina's defensive left flank, quickly passing to Alvarez. Alvarez then sends a short pass to Fernandez in the defensive half. Fernandez finds De Paul centrally, who carries before passing to Messi. Messi drives forward, then passes to Otamendi on the left. Otamendi carries, then sends a long pass to Tagliafico on the left flank. Tagliafico returns the ball to Otamendi, who carries before sending a long pass to Romero in the central defensive half. Romero carries, then passes back to Otamendi on the left. Otamendi finds Fernandez centrally, who then sends a long pass to Molina on the right flank. Molina carries, but his pass is blocked by Hernandez of France."
    },
    {
        "timestamp_start_of_possession_seconds": 2375.793,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 39, France in possession, possession number 59",
        "description": "First Half, Argentina 2 - 0 France, minute 39, France in possession, possession number 59\nTchouameni recovers the ball in France's central defensive half, carries it 12 yards into the attacking half. He passes to Rabiot. Rabiot, from the left half space, sends it back 11 yards to Tchouameni in the defensive half. Tchouameni holds position, then launches a 24-yard pass to Upamecano on the defensive left flank. Upamecano attempts a long 48-yard aerial pass into the attacking half, but it's incomplete. Giroud loses a header in the attacking left half space."
    },
    {
        "timestamp_start_of_possession_seconds": 2383.536,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 39, Argentina in possession, possession number 60",
        "description": "First Half, Argentina 2 - 0 France, minute 39, Argentina in possession, possession number 60\nRomero recovers the ball for Argentina, passing it to Molina. Molina and De Paul exchange passes on the defensive right flank. De Paul's pass to Alvarez is incomplete. Tchouameni recovers for France, but Romero regains possession for Argentina, passing to Fernandez. Fernandez and Molina continue the passing sequence, ending with De Paul. De Paul launches a long pass to Otamendi in the central defensive half. Otamendi carries the ball, passing it to Di Maria on the defensive left flank. Di Maria is fouled by Kounde, winning a foul for Argentina. Meanwhile, France substitutes Dembele for Giroud."
    },
    {
        "timestamp_start_of_possession_seconds": 2466.74,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 41, Argentina in possession, possession number 61",
        "description": "First Half, Argentina 2 - 0 France, minute 41, Argentina in possession, possession number 61\nOtamendi of Argentina takes an 18-yard free kick from the defensive left flank, finding Tagliafico in the defensive half left half space. Kolo from France commits a foul on the defensive right flank. Tagliafico wins a foul for Argentina on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 2487.642,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 41, Argentina in possession, possession number 62",
        "description": "First Half, Argentina 2 - 0 France, minute 41, Argentina in possession, possession number 62\nDi Maria launches a 65-yard free kick from Argentina's left flank to Molina on the right. Molina carries the ball a short distance before sending a 31-yard pass across to Otamendi. Otamendi advances slightly, then dispatches a 24-yard pass down the left flank to Tagliafico. Tagliafico is fouled by Kolo of France, winning a free kick for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 2532.605,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 42, Argentina in possession, possession number 63",
        "description": "First Half, Argentina 2 - 0 France, minute 42, Argentina in possession, possession number 63\nDi Maria takes a 30-yard free kick on Argentina's defensive left flank, finding Otamendi. Otamendi carries the ball 4 yards into the defensive half left half space, then passes 27 yards to Romero in the central defensive half. Romero carries the ball 5 yards into the defensive box, then passes 29 yards back to Fernandez in the central defensive half. Fernandez carries the ball 11 yards, then sends a long 59-yard pass to Di Maria on the opposition's left flank. Di Maria carries the ball 12 yards along the flank, then attempts a dribble. Kounde of France wins a tackle, carries the ball 8 yards along the defensive right flank, then passes 9 yards to Kolo. Kolo carries the ball 2 yards. Di Maria blocks an action on the opposition's left flank, but Tagliafico loses a tackle in the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 2584.319,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 43, France in possession, possession number 64",
        "description": "First Half, Argentina 2 - 0 France, minute 43, France in possession, possession number 64\nLloris of France launches a 66-yard goal kick from the defensive box into the attacking half. Fernandez clears for Argentina. Romero recovers, passing to Molina who carries the ball 4 yards. Molina's ground pass to De Paul is incomplete. Rabiot intercepts for France, passing to Thuram who carries the ball a short distance. Fernandez recovers for Argentina, passing to Alvarez. Tchouameni recovers for France, dribbles past Fernandez, and passes to Rabiot. Rabiot passes to Thuram who dribbles past De Paul."
    },
    {
        "timestamp_start_of_possession_seconds": 2611.591,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 43, France in possession, possession number 65",
        "description": "First Half, Argentina 2 - 0 France, minute 43, France in possession, possession number 65\nHernandez throws in to Tchouameni on the opposition's left flank. Tchouameni holds, then passes back to Hernandez. Hernandez sends a long pass to Upamecano on the defensive left flank. Upamecano carries forward, then passes back to Hernandez. Hernandez returns the pass, and Upamecano advances slightly before sending a long pass to Varane on the right. Varane carries into the attacking half, then passes to Tchouameni in the central defensive half. Tchouameni passes to Upamecano, who carries to the defensive left flank before making a ground pass into the attacking half. Alvarez commits a foul on Hernandez, ending the possession."
    },
    {
        "timestamp_start_of_possession_seconds": 2662.692,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 44, France in possession, possession number 66",
        "description": "First Half, Argentina 2 - 0 France, minute 44, France in possession, possession number 66\nHernandez kicks a free 21-yard pass from the defensive left flank to Tchouameni. Tchouameni carries the ball a yard, then passes it 21 yards to Varane in the central defensive half. Varane carries it 2 yards, then passes it 18 yards to Upamecano. Upamecano carries it 2 yards, then sends a long 40-yard pass to Kounde on the defensive right flank. Kounde carries the ball 30 yards into the opposition's right flank, then passes it 11 yards to Kolo. Kolo carries it 12 yards, but his ground pass to Mbappe is intercepted by Otamendi. Otamendi passes the ball to De Paul. Tchouameni recovers the ball and carries it 2 yards, dribbling past Fernandez. Tchouameni passes the ball 9 yards to Kolo in the central attacking half. Kolo carries the ball 12 yards, but is tackled by Messi. Kolo recovers the ball, but Messi clears it. Fernandez recovers the ball and passes it to De Paul. Rabiot intercepts the pass."
    },
    {
        "timestamp_start_of_possession_seconds": 2694.781,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 44, Argentina in possession, possession number 67",
        "description": "First Half, Argentina 2 - 0 France, minute 44, Argentina in possession, possession number 67\nMolina recovers the ball in Argentina's central defensive half, passing it to Messi. Messi carries it 7 yards into the right half space, then sends a 22-yard pass down the right flank to Molina. Molina advances 12 yards but his ground pass to Messi is incomplete. Rabiot recovers for France on the left flank, passing to Thuram."
    },
    {
        "timestamp_start_of_possession_seconds": 2723.875,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 45, Argentina in possession, possession number 68",
        "description": "First Half, Argentina 2 - 0 France, minute 45, Argentina in possession, possession number 68\nMolina initiates with a 9-yard throw-in to De Paul on Argentina's defensive right flank. De Paul carries the ball 2 yards before passing it 19 yards to Romero, still on the right flank. Romero advances 6 yards and then sends a long 37-yard pass across the field to Otamendi in the left half space. Otamendi carries for 2 yards, then passes 28 yards down the left flank to Tagliafico. Tagliafico attempts a 71-yard aerial pass to Di Maria in the opposition box, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 2740.654,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 45, France in possession, possession number 69",
        "description": "First Half, Argentina 2 - 0 France, minute 45, France in possession, possession number 69\nLloris recovers the ball in France's defensive box, passes it 29 yards to Upamecano in the central defensive half. Upamecano carries it 12 yards, then passes to Tchouameni in the defensive half left half space. Tchouameni carries it 11 yards, passes 17 yards to Hernandez on the opposition left flank. Hernandez carries it a yard, sends it back 27 yards to Upamecano in the defensive left flank. Upamecano carries it a yard, passes it 34 yards to Rabiot in the central defensive half. Rabiot carries it 37 yards to the opposition right flank, passes 8 yards to Kounde. Kounde carries it a yard, passes it 28 yards to Tchouameni in the central attacking half. Tchouameni carries it 9 yards, passes it 35 yards to Hernandez on the opposition left flank. Hernandez carries it a yard, passes it 14 yards to Tchouameni. Tchouameni carries it a yard, passes it 15 yards to Upamecano in the defensive half left half space. Upamecano carries it 2 yards, attempts an aerial pass but it's incomplete. Fernandez of Argentina clears it. Mbappe recovers it on the opposition left flank, carries it 5 yards, passes it 10 yards to Thuram. Thuram carries it 3 yards, dribbles past Molina of Argentina, carries it 13 yards, attempts a ground pass but it's blocked by Romero of Argentina. Hernandez commits a foul on De Paul of Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 2863.074,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 47, Argentina in possession, possession number 70",
        "description": "First Half, Argentina 2 - 0 France, minute 47, Argentina in possession, possession number 70\nMartinez of Argentina launches a 70-yard free kick from the defensive right flank to the attacking half. Tchouameni of France recovers the ball, moving it 19 yards towards the defensive left flank. Molina of Argentina regains possession on the opposition right flank, carries it a yard, then passes 17 yards to Messi. Messi carries the ball 2 yards, attempts a 21-yard aerial pass to Alvarez, but it's incomplete. Varane of France clears the ball from the defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 2898.508,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 48, Argentina in possession, possession number 71",
        "description": "First Half, Argentina 2 - 0 France, minute 48, Argentina in possession, possession number 71\nMolina throws in to De Paul on Argentina's right flank. De Paul returns the pass to Molina, who then finds Alvarez. Alvarez's ground pass to De Paul is incomplete. Rabiot recovers for France on their left flank, carries, and sends a long pass to Mbappe. Romero recovers for Argentina, moving the ball to Martinez in the central defensive half. Martinez carries briefly, then passes to Otamendi on the left. Otamendi carries up the left flank, passes to Di Maria who carries and then dribbles."
    },
    {
        "timestamp_start_of_possession_seconds": 2921.525,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 48, France in possession, possession number 72",
        "description": "First Half, Argentina 2 - 0 France, minute 48, France in possession, possession number 72\nKolo wins a tackle on the opposition's right flank, carries for 3 yards, then passes 25 yards to Varane in the defensive half. Varane carries 18 yards centrally, passes 19 yards to Tchouameni. Tchouameni carries a yard, then passes 28 yards to Upamecano on the left. Upamecano carries 10 yards, passes 18 yards back to Varane centrally. Varane carries 5 yards, passes 10 yards to Tchouameni. Tchouameni carries 6 yards, passes 21 yards to Upamecano on the left. Upamecano carries 11 yards into the attacking half, passes 24 yards to Thuram on the left flank. Thuram carries 10 yards, Molina of Argentina loses a tackle."
    },
    {
        "timestamp_start_of_possession_seconds": 2960.777,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 73",
        "description": "First Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 73\nHernandez initiates with a 20-yard throw-in to Upamecano on the opposition's left flank. Upamecano swiftly passes it 28 yards to Varane in the defensive half. Varane carries the ball 7 yards into the central defensive half before sending a 26-yard pass to Kounde in the attacking half. Kounde advances 9 yards on the opposition's right flank, then passes 17 yards to Griezmann. Griezmann carries the ball a short distance before passing it 20 yards back to Varane. Varane moves 5 yards into the attacking half, then attempts a 38-yard aerial pass to Thuram in the central attacking half, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 2979.731,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 49, Argentina in possession, possession number 74",
        "description": "First Half, Argentina 2 - 0 France, minute 49, Argentina in possession, possession number 74\nRomero recovers the ball for Argentina, passing it to Fernandez in the central defensive half. Fernandez carries it a short distance before sending a 10-yard pass to MacAllister on the left. Meanwhile, Kolo from France loses a tackle in the attacking half. Fernandez recovers again for Argentina, while Griezmann attempts a block for France."
    },
    {
        "timestamp_start_of_possession_seconds": 3011.074,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 75",
        "description": "First Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 75\nTagliafico of Argentina executes an 18-yard throw-in to Messi on the opposition's left flank. Varane from France swiftly intercepts on their defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3030.601,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 76",
        "description": "First Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 76\nTagliafico throws in to Alvarez for Argentina on the opposition's left flank. Tchouameni recovers the ball for France, carries it a short distance, then passes to Upamecano. Upamecano carries it further, attempts an aerial pass, but it's incomplete. Otamendi recovers for Argentina, passes to Fernandez. Fernandez's ground pass is incomplete. Griezmann carries for France, passes to Kounde. Kounde's action is incomplete, blocked by Fernandez. Kounde also blocks on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3056.003,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 77",
        "description": "First Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 77\nDi Maria initiates with a 19-yard throw-in to Fernandez on the opposition's left flank. Fernandez carries the ball a short distance before passing it 12 yards to Messi in the attacking half. Messi, maintaining position, sends a 9-yard pass back to Fernandez. Fernandez carries the ball further into the attacking half before making a long 27-yard pass to Romero in the central defensive half. Romero advances slightly before attempting a 46-yard switch pass to Di Maria, which unfortunately goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 3075.139,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 51, France in possession, possession number 78",
        "description": "First Half, Argentina 2 - 0 France, minute 51, France in possession, possession number 78\nKounde initiates with a 7-yard throw-in to Tchouameni on France's defensive right flank. Tchouameni carries the ball a short distance before delivering a 15-yard pass to Kolo, still on the defensive right. Kolo then advances 17 yards into the opposition's right flank, where Fernandez of Argentina commits a foul. Kolo wins the foul for France."
    },
    {
        "timestamp_start_of_possession_seconds": 3143.736,
        "possession_details": "First Half, Argentina 2 - 0 France, minute 52, France in possession, possession number 79",
        "description": "First Half, Argentina 2 - 0 France, minute 52, France in possession, possession number 79\nGriezmann of France takes a 59-yard free kick from the opposition's right flank, targeting the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 3155.431,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 45, Argentina in possession, possession number 80",
        "description": "Second Half, Argentina 2 - 0 France, minute 45, Argentina in possession, possession number 80\nMessi kicks off, passing to Fernandez in the central defensive half. Fernandez carries the ball, then passes to De Paul. De Paul carries, then switches play to Otamendi on the left. Otamendi passes to Tagliafico, who sends a long ball to Di Maria. Di Maria carries, then passes back to Tagliafico. Tagliafico passes to Otamendi, who sends the ball to Martinez in the box. Martinez's aerial pass is incomplete. Di Maria loses a header.\n\nKounde recovers for France, passing to Tchouameni. Tchouameni's action is blocked by MacAllister. Messi recovers the ball for Argentina, carries, then passes to Alvarez. Alvarez carries, then switches play to De Paul. De Paul passes to Alvarez in the box. Alvarez carries, then passes to Fernandez. Fernandez's through ball to MacAllister is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 3212.794,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 45, France in possession, possession number 81",
        "description": "Second Half, Argentina 2 - 0 France, minute 45, France in possession, possession number 81\nHugo Lloris of France executes a 35-yard pass from the defensive box to the defensive left flank, finding teammate Theo Hernandez."
    },
    {
        "timestamp_start_of_possession_seconds": 3241.619,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 46, Argentina in possession, possession number 82",
        "description": "Second Half, Argentina 2 - 0 France, minute 46, Argentina in possession, possession number 82\nMolina of Argentina executes a 15-yard throw-in to Alvarez on the opposition's right flank. Tchouameni from France intercepts on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3243.762,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 46, France in possession, possession number 83",
        "description": "Second Half, Argentina 2 - 0 France, minute 46, France in possession, possession number 83\nThuram recovers the ball for France, moving it 34 yards from the defensive left flank to the central defensive half, passing to Kounde. Kounde carries the ball 30 yards towards the defensive half right half space. Di Maria of Argentina is dribbled past. Kounde continues his run, dribbling from the defensive half right half space and carries the ball 20 yards to the opposition right flank. His ground pass, however, is incomplete. \n\nTchouameni recovers the ball for France, moving it 22 yards from the defensive right flank to the defensive half right half space, passing to Varane. Varane carries the ball 5 yards within the same area. He then passes the ball 25 yards to Upamecano in the central defensive half. Upamecano carries the ball 8 yards within the same area, then passes it 14 yards to Tchouameni. \n\nTchouameni carries the ball 7 yards within the central defensive half, then passes it 29 yards to Hernandez on the defensive left flank. Hernandez carries the ball 2 yards, then passes it 18 yards to Thuram on the opposition left flank. Thuram passes the ball 19 yards back to Hernandez on the defensive left flank. Hernandez carries the ball 1 yard, then passes it 34 yards to Varane in the central defensive half. \n\nVarane carries the ball 5 yards within the same area, then passes it 14 yards to Kounde in the defensive half right half space. Kounde passes the ball 7 yards within the same area to Varane. Varane carries the ball 7 yards to the central defensive half, then passes it 28 yards to Upamecano in the defensive half left half space. Upamecano carries the ball 8 yards within the same area, then attempts an aerial pass of 55 yards to Thuram on the opposition left flank, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 3293.055,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 47, Argentina in possession, possession number 84",
        "description": "Second Half, Argentina 2 - 0 France, minute 47, Argentina in possession, possession number 84\nRomero intercepts on Argentina's defensive right flank, swiftly passing to De Paul. De Paul heads a 29-yard pass from the same flank into the defensive box to Martinez. Martinez carries the ball 17 yards within the box before launching an 84-yard aerial pass out of play towards Alvarez on the opposition's right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3329.901,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 47, France in possession, possession number 85",
        "description": "Second Half, Argentina 2 - 0 France, minute 47, France in possession, possession number 85\nTheo Hernandez of France executes a 25-yard throw-in from the defensive left flank, finding teammate Marcus Thuram. Thuram maintains possession, carrying the ball a further 2 yards along the same flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3352.227,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 48, Argentina in possession, possession number 86",
        "description": "Second Half, Argentina 2 - 0 France, minute 48, Argentina in possession, possession number 86\nMolina throws in to Messi on Argentina's right flank. Messi passes into the opposition box. Hernandez loses a header for France, Varane recovers the ball and carries it to the central defensive half before passing to Lloris. Lloris' aerial pass to Kolo is incomplete. Tagliafico intercepts for Argentina and carries the ball to the opposition's left flank, but his aerial pass is also incomplete. Kounde recovers for France, passes to Kolo who loses possession. Di Maria intercepts for Argentina, carries the ball but is tackled by Kolo. Fernandez recovers for Argentina, but is tackled by Griezmann. Kounde recovers for France, carries the ball but his pass to Mbappe is intercepted by Romero. Romero passes to Messi who carries the ball and passes to Di Maria. Di Maria carries into the box and passes to De Paul whose volley is saved."
    },
    {
        "timestamp_start_of_possession_seconds": 3387.588,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 48, France in possession, possession number 88",
        "description": "Second Half, Argentina 2 - 0 France, minute 48, France in possession, possession number 88\nLloris, from France, delivers a 20-yard pass from the defensive box to the central defensive half, finding Griezmann."
    },
    {
        "timestamp_start_of_possession_seconds": 3389.082,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 48, France in possession, possession number 89",
        "description": "Second Half, Argentina 2 - 0 France, minute 48, France in possession, possession number 89\nGriezmann, from France's central defense, sends a 25-yard pass to Theo Hernandez on the defensive left flank. Hernandez carries the ball a short distance, maintaining position. Rodrigo De Paul of Argentina attempts a challenge, but Hernandez skillfully dribbles past him. Hernandez continues his run, carrying the ball another 17 yards down the left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3395.7,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 90",
        "description": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 90\nTheo Hernandez of France executes a short, 7-yard pass to Antoine Griezmann, maintaining control in their defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3396.436,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 91",
        "description": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 91\nGriezmann, from France, initiates with a 16-yard pass to Mbappe on the defensive left flank. Mbappe carries the ball a yard in the same area. He then outmaneuvers Argentina's De Paul, dribbling from the defensive left flank. Mbappe continues his run, carrying the ball 24 yards to the opposition's left flank, leaving MacAllister of Argentina behind. He maintains control, carrying the ball another 11 yards on the opposition's left flank. Griezmann recovers the ball in the same area, then carries it 6 yards into the attacking half left half space."
    },
    {
        "timestamp_start_of_possession_seconds": 3405.535,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 92",
        "description": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 92\nGriezmann attempts a ground pass from the left attacking half for France, but it's incomplete. Di Maria intercepts for Argentina in the central defensive half. Martinez recovers the ball in the defensive box, carries it a short distance, then passes it 25 yards to Molina on the defensive right flank. Molina carries it 14 yards, but his long pass to Alvarez is incomplete. \n\nMeanwhile, Upamecano recovers for France, passing the ball to Lloris in the defensive box. Lloris holds his ground, then sends a long pass to Rabiot in the left defensive half. Rabiot heads the ball to Griezmann, but Fernandez loses a header for Argentina in the attacking half. \n\nGriezmann passes the ball to Mbappe on the opposition's left flank. Molina recovers for Argentina, passing to De Paul, who loses a header. Griezmann recovers for France, passing to Rabiot who carries the ball towards the left flank. Rabiot's aerial pass to Mbappe is incomplete, intercepted by Molina on Argentina's right defensive flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3448.302,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 93",
        "description": "Second Half, Argentina 2 - 0 France, minute 49, France in possession, possession number 93\nTheo Hernandez of France executes a 21-yard throw-in from the opposition's left flank to the defensive left, finding teammate Marcus Thuram."
    },
    {
        "timestamp_start_of_possession_seconds": 3465.868,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 94",
        "description": "Second Half, Argentina 2 - 0 France, minute 50, Argentina in possession, possession number 94\nMolina throws in to Messi on Argentina's right flank. Messi returns the pass to Molina who carries it a short distance before sending a long pass to Martinez in the defensive box. Martinez passes to Otamendi in the left half space. Otamendi carries, then passes to Tagliafico on the left flank. Tagliafico carries briefly, then passes to MacAllister in opposition territory. MacAllister's ground pass to Tagliafico is blocked by Tchouameni of France, but MacAllister recovers the ball. He carries, then passes back to Otamendi. Otamendi loses a header, and Kolo of France recovers the ball. Kolo passes to Mbappe who carries it into opposition territory and attempts a dribble. Fernandez of Argentina fails to tackle Mbappe."
    },
    {
        "timestamp_start_of_possession_seconds": 3519.399,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 51, France in possession, possession number 95",
        "description": "Second Half, Argentina 2 - 0 France, minute 51, France in possession, possession number 95\nAntoine Griezmann of France takes a 44-yard corner from the opposition's right flank into the box."
    },
    {
        "timestamp_start_of_possession_seconds": 3520.952,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 51, Argentina in possession, possession number 96",
        "description": "Second Half, Argentina 2 - 0 France, minute 51, Argentina in possession, possession number 96\nMartinez, in Argentina's defensive box, carries the ball 8 yards before passing it 36 yards to Di Maria on the defensive right flank. Di Maria then carries the ball 36 yards up to the opposition's right flank, before passing it 22 yards to Messi in the attacking half right half space. Messi, without moving, passes the ball 22 yards back to the opposition's right flank, finding De Paul. De Paul carries the ball 3 yards on the opposition's right flank, then attempts a dribble. Hernandez of France loses a tackle on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3570.219,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 51, Argentina in possession, possession number 97",
        "description": "Second Half, Argentina 2 - 0 France, minute 51, Argentina in possession, possession number 97\nMolina of Argentina executes a throw-in to De Paul on the opposition's right flank. De Paul swiftly returns the pass to Molina, who carries the ball a yard further. Molina's subsequent action is incomplete, and Hernandez of France blocks on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3620.308,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 52, Argentina in possession, possession number 98",
        "description": "Second Half, Argentina 2 - 0 France, minute 52, Argentina in possession, possession number 98\nMessi takes a 30-yard corner for Argentina from the opposition's right flank into the box. Griezmann clears it from France's defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 3647.834,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 53, Argentina in possession, possession number 99",
        "description": "Second Half, Argentina 2 - 0 France, minute 53, Argentina in possession, possession number 99\nMolina of Argentina executes a 15-yard throw-in to Alvarez on the opposition's right flank. Alvarez carries the ball 4 yards, but his ground pass is blocked by Thuram of France. Alvarez recovers the ball, only for Thuram to regain possession. Thuram carries the ball 4 yards and attempts a long 58-yard aerial pass from the defensive left flank to the opposition's left flank, but it's incomplete. Otamendi of Argentina recovers the ball on the defensive right flank, carries it 4 yards, and passes it 19 yards to De Paul on the opposition's right flank. De Paul carries the ball 4 yards and sends a long 56-yard pass back to Martinez in the central defensive half. Martinez passes the ball 7 yards to Fernandez, who attempts a 31-yard aerial pass to the defensive left flank, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 3671.415,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 53, France in possession, possession number 100",
        "description": "Second Half, Argentina 2 - 0 France, minute 53, France in possession, possession number 100\nKounde recovers the ball, passes to Griezmann. Griezmann finds Tchouameni. Tchouameni carries, then sends a long pass to Upamecano. Upamecano advances, passes to Rabiot. Rabiot carries, passes back to Tchouameni. Tchouameni returns the pass to Upamecano. Upamecano advances, finds Mbappe on the left. Mbappe's pass is blocked by Messi. Tchouameni recovers, passes to Hernandez. Hernandez's pass to Tchouameni is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 3700.995,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 54, Argentina in possession, possession number 101",
        "description": "Second Half, Argentina 2 - 0 France, minute 54, Argentina in possession, possession number 101\nDe Paul intercepts on Argentina's defensive right flank. He carries the ball 7 yards, staying in the same area. De Paul passes to Fernandez, covering 11 yards. Fernandez carries the ball a yard, then returns the pass to De Paul, a 10-yard exchange. De Paul carries again, 6 yards this time. Rabiot of France commits a foul on the opposition's left flank. De Paul wins the foul on Argentina's defensive right flank. Play stops for an injury to De Paul."
    },
    {
        "timestamp_start_of_possession_seconds": 3808.442,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 55, Argentina in possession, possession number 102",
        "description": "Second Half, Argentina 2 - 0 France, minute 55, Argentina in possession, possession number 102\nDe Paul takes a 21-yard free kick on Argentina's defensive right flank, finding Romero. Romero carries the ball 3 yards in the same area before launching a 46-yard pass to MacAllister in the central attacking half. MacAllister's 17-yard aerial pass in the attacking half left space is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 3815.295,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 56, France in possession, possession number 103",
        "description": "Second Half, Argentina 2 - 0 France, minute 56, France in possession, possession number 103\nKounde intercepts, covering 15 yards in France's defensive right half. He passes to Kolo. Kolo carries the ball 4 yards into the attacking right half. Tagliafico of Argentina commits a foul on Kolo, who wins the foul in the attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 3827.84,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 56, France in possession, possession number 104",
        "description": "Second Half, Argentina 2 - 0 France, minute 56, France in possession, possession number 104\nKounde of France takes a free kick from the defensive half, finding Tchouameni on the opposition right flank. Tchouameni passes it back to the central defensive half to Upamecano, who carries it forward before sending it to Hernandez on the opposition left flank. Hernandez carries, then passes to Rabiot, who returns the favor. Hernandez sends it back to Upamecano in the defensive left flank, who carries and passes to Varane in the central defensive half. Varane finds Upamecano on the defensive half left, who carries and sends a long pass to Kounde on the opposition right flank. Kounde carries but his action is incomplete. MacAllister of Argentina blocks, Di Maria recovers the ball but loses it to Kolo of France. Kolo carries it into the opposition box, where Tagliafico of Argentina loses a tackle."
    },
    {
        "timestamp_start_of_possession_seconds": 3878.718,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 57, France in possession, possession number 105",
        "description": "Second Half, Argentina 2 - 0 France, minute 57, France in possession, possession number 105\nKounde initiates with a 17-yard throw-in to Kolo on the opposition's right flank. Kolo carries the ball a yard before passing it 22 yards to Rabiot in the attacking half. Rabiot, stationary, swiftly passes 23 yards to Varane on the opposition's right flank. Varane advances 9 yards before delivering a long 45-yard pass to Lloris in the defensive half. Lloris moves 2 yards and sends a 32-yard pass to Upamecano. Upamecano carries the ball 2 yards and passes 25 yards to Hernandez on the opposition's left flank. Hernandez drives 18 yards into the defensive left flank and passes 13 yards to Mbappe. Mbappe carries the ball 6 yards back into the opposition's left flank and begins a dribble."
    },
    {
        "timestamp_start_of_possession_seconds": 3899.064,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 57, Argentina in possession, possession number 106",
        "description": "Second Half, Argentina 2 - 0 France, minute 57, Argentina in possession, possession number 106\nEnzo Fernandez of Argentina wins a tackle on the defensive right flank. He carries the ball 3 yards within the same area. Fernandez then passes the ball 9 yards to Rodrigo De Paul on the opposition's right flank. De Paul carries the ball 3 yards within the same area. Suddenly, Kylian Mbappe of France commits a foul on De Paul in the same area. The game stops due to an injury to De Paul."
    },
    {
        "timestamp_start_of_possession_seconds": 3943.545,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 58, Argentina in possession, possession number 107",
        "description": "Second Half, Argentina 2 - 0 France, minute 58, Argentina in possession, possession number 107\nMessi takes a short free kick to Molina on Argentina's right flank. Molina carries the ball a bit further before attempting a long switch pass to the left flank, but it's intercepted by Kounde of France. Tagliafico quickly recovers for Argentina with an interception, passing to Di Maria on the left flank. Di Maria carries the ball into the attacking half, then sends a 15-yard pass to Alvarez. Alvarez drives into the opposition box and fires a shot, but it's saved."
    },
    {
        "timestamp_start_of_possession_seconds": 3970.903,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 109",
        "description": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 109\nHugo Lloris of France executes a 47-yard pass from the defensive box to the defensive half left half space, finding teammate Dayotchanculle Upamecano."
    },
    {
        "timestamp_start_of_possession_seconds": 3979.732,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 110",
        "description": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 110\nUpamecano, from France, delivers a 16-yard pass from the left defensive half to Varane in the central defensive half. Varane then carries the ball for 5 yards within the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 3983.585,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 111",
        "description": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 111\nVarane of France executes a 20-yard pass from the central defensive half to the defensive half left half space, finding Upamecano. Upamecano then carries the ball 2 yards within the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 3986.946,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 112",
        "description": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 112\nUpamecano, from France, delivers a 17-yard pass from the defensive left half space to Hernandez on the defensive left flank. Hernandez maintains possession, holding his ground on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 3990.049,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 113",
        "description": "Second Half, Argentina 2 - 0 France, minute 58, France in possession, possession number 113\nTheo Hernandez of France launches a 44-yard aerial pass from the defensive left flank, aiming for Kylian Mbappe in the attacking half left half space. However, the play is offside."
    },
    {
        "timestamp_start_of_possession_seconds": 4024.15,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 59, Argentina in possession, possession number 114",
        "description": "Second Half, Argentina 2 - 0 France, minute 59, Argentina in possession, possession number 114\nEmiliano Martinez of Argentina executes a 67-yard free kick from the central defensive half, landing it on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4027.615,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 59, France in possession, possession number 115",
        "description": "Second Half, Argentina 2 - 0 France, minute 59, France in possession, possession number 115\nKounde recovers the ball on France's defensive right flank, covering 12 yards. He passes to Kolo, still on the right flank. Kolo then moves the ball 5 yards into the defensive half right half space, finding Tchouameni. Tchouameni attempts a 20-yard aerial pass towards the opposition's right flank, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4032.399,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 59, Argentina in possession, possession number 116",
        "description": "Second Half, Argentina 2 - 0 France, minute 59, Argentina in possession, possession number 116\nTagliafico recovers the ball on Argentina's defensive left, swiftly moving it 20 yards up to Di Maria on the opposition's left flank. Di Maria then carries it a significant 38 yards, penetrating the opposition box. Without hesitation, he passes it 16 yards across to Messi, still within the box. Messi carries it a further 10 yards, but his shot misses the target."
    },
    {
        "timestamp_start_of_possession_seconds": 4074.177,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 60, France in possession, possession number 117",
        "description": "Second Half, Argentina 2 - 0 France, minute 60, France in possession, possession number 117\nLloris kicks an 83-yard goal from France's defensive box to the opposition's right flank, finding Kolo. Tagliafico recovers for Argentina, moving 8 yards from the defensive left flank to the half space. Fernandez receives and sends a 31-yard aerial pass from the defensive half to the attacking half, finding Alvarez. Alvarez commits a foul in the attacking half. Varane wins a foul for France in their defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 4104.309,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 60, France in possession, possession number 118",
        "description": "Second Half, Argentina 2 - 0 France, minute 60, France in possession, possession number 118\nUpamecano from France delivers a 51-yard free kick from the defensive right half space, finding Hernandez on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4125.566,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 61, Argentina in possession, possession number 119",
        "description": "Second Half, Argentina 2 - 0 France, minute 61, Argentina in possession, possession number 119\nMolina throws in to De Paul on Argentina's defensive right flank. De Paul returns the pass to Molina, who holds position. Molina then passes to Fernandez, who quickly sends it back to De Paul. De Paul carries it a short distance before attempting a long ground pass to Messi on the opposition's right flank, but it goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 4139.185,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 61, France in possession, possession number 120",
        "description": "Second Half, Argentina 2 - 0 France, minute 61, France in possession, possession number 120\nHernandez throws in to Upamecano on France's defensive left flank. Upamecano passes centrally to Varane, who then finds Kounde on the right. Kounde carries, then sends a long pass back to Lloris in the box. Lloris carries, then passes to Upamecano on the left. Upamecano carries, then sends it back to Hernandez on the left flank. Hernandez carries, then passes upfield to Thuram on the opposition's left flank. Thuram carries, then passes to Rabiot. Argentina's Fernandez recovers, but Thuram quickly regains possession. Thuram carries into the attacking half, then passes centrally to Griezmann. Griezmann carries, then sends a long pass to Hernandez on the opposition's left flank. Hernandez's cross into the box is cleared by Argentina's Romero."
    },
    {
        "timestamp_start_of_possession_seconds": 4179.069,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 62, France in possession, possession number 121",
        "description": "Second Half, Argentina 2 - 0 France, minute 62, France in possession, possession number 121\nHernandez executes an 18-yard throw-in to Tchouameni on France's left flank. Tchouameni holds position, then sends a 34-yard pass to Varane in the central attacking half. Varane carries the ball 15 yards towards the right half space, then passes 11 yards to Kolo, who maintains position."
    },
    {
        "timestamp_start_of_possession_seconds": 4189.932,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 62, Argentina in possession, possession number 122",
        "description": "Second Half, Argentina 2 - 0 France, minute 62, Argentina in possession, possession number 122\nMacAllister recovers the ball in Argentina's defensive left half. He carries it 27 yards to the central defensive half, then passes 10 yards to Messi in the same area. Messi carries the ball 7 yards into the central attacking half, then sends a 32-yard pass to Alvarez in the attacking left half. Alvarez attempts a 28-yard ground pass to MacAllister in the opposition box, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4201.014,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 62, France in possession, possession number 123",
        "description": "Second Half, Argentina 2 - 0 France, minute 62, France in possession, possession number 123\nKounde recovers the ball in France's defensive box. He passes it 28 yards across the defensive half to Rabiot. Rabiot then sends a 21-yard pass to Thuram, still in the defensive half. Thuram carries the ball 3 yards before passing it 6 yards to Griezmann in the central defensive half. Griezmann carries it 5 yards before being fouled by Tagliafico of Argentina. Griezmann wins the foul for France."
    },
    {
        "timestamp_start_of_possession_seconds": 4229.386,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 62, France in possession, possession number 124",
        "description": "Second Half, Argentina 2 - 0 France, minute 62, France in possession, possession number 124\nTchouameni of France takes a 15-yard free kick from the defensive half, finding Hernandez on the left flank. Hernandez passes 11 yards to Mbappe, who holds the ball before passing it 12 yards to Griezmann. Griezmann carries the ball 6 yards, then passes 11 yards to Rabiot. Rabiot holds, then passes 7 yards to Mbappe. Mbappe carries 11 yards, attempts a 5-yard pass to Griezmann, but it's blocked by Molina of Argentina. Rabiot recovers the ball, passes to Tchouameni who carries it 11 yards into the attacking half. Tchouameni then sends a long 55-yard pass to Kounde on the right flank. Kounde dribbles past Di Maria of Argentina, who is then substituted."
    },
    {
        "timestamp_start_of_possession_seconds": 4303.794,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 64, Argentina in possession, possession number 125",
        "description": "Second Half, Argentina 2 - 0 France, minute 64, Argentina in possession, possession number 125\nMartinez kicks from Argentina's box to the opposition's left flank. Acuna loses a header, Kolo recovers for France. Tagliafico recovers for Argentina, carries, then passes to Fernandez. Fernandez carries, passes to Otamendi. Otamendi carries, passes to Romero. Romero carries, passes back to Otamendi. Otamendi carries, passes to Tagliafico. Tagliafico carries, sends a long pass to Alvarez. Alvarez passes to Messi. Messi carries, passes to Acuna. Acuna carries, passes to MacAllister. Griezmann loses a tackle, MacAllister recovers. MacAllister carries, passes back to Acuna. Acuna carries, passes to Messi. Messi carries, passes to MacAllister. MacAllister's ground pass in the box is blocked by Upamecano."
    },
    {
        "timestamp_start_of_possession_seconds": 4336.907,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 64, France in possession, possession number 126",
        "description": "Second Half, Argentina 2 - 0 France, minute 64, France in possession, possession number 126\nTchouameni recovers for France in their box, passes to Lloris. Lloris attempts a long aerial pass from the box to the right flank, but it's incomplete. Tagliafico recovers for Argentina on their left flank. Kounde blocks an attempt on France's right flank, then recovers the ball. Acuna blocks for Argentina on their left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4374.922,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 65, France in possession, possession number 127",
        "description": "Second Half, Argentina 2 - 0 France, minute 65, France in possession, possession number 127\nLloris kicks a 76-yard goal from France's defensive box to the attacking half. Otamendi recovers for Argentina, covering 19 yards in their defensive half. Thuram loses a header for France. Tchouameni recovers, passing to Griezmann in the central attacking half. Griezmann heads a 13-yard pass to Rabiot, who carries the ball 10 yards before passing to Varane. Varane holds, then sends a 45-yard pass to Hernandez on the left flank. Hernandez carries, passes back to Rabiot who then passes to Upamecano. Upamecano's 55-yard aerial pass to Mbappe is incomplete. Molina clears for Argentina, De Paul recovers and passes back to Molina, whose aerial pass goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 4409.902,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 65, France in possession, possession number 128",
        "description": "Second Half, Argentina 2 - 0 France, minute 65, France in possession, possession number 128\nGriezmann initiates with a 17-yard throw-in to Hernandez on the left flank. Hernandez quickly passes it 6 yards to Rabiot, who carries it another 4 yards down the same flank. Rabiot then sends a 12-yard pass back to Griezmann. Griezmann carries it 4 yards before launching a long 72-yard pass across to Kolo on the right flank. Kolo passes it 12 yards to Kounde, who holds position. Kounde attempts a 4-yard ground pass to Kolo, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4423.362,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 66, Argentina in possession, possession number 129",
        "description": "Second Half, Argentina 2 - 0 France, minute 66, Argentina in possession, possession number 129\nTagliafico recovers the ball for Argentina, maintaining position on the defensive left flank. He passes to Acuna, who carries the ball a short distance. Kolo of France attempts a tackle but loses. Tagliafico recovers the ball again, holding his ground. Kolo makes another unsuccessful tackle attempt. MacAllister steps in for Argentina, recovering the ball and carrying it a bit further on the left flank. He attempts a long aerial pass, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4433.944,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 66, France in possession, possession number 130",
        "description": "Second Half, Argentina 2 - 0 France, minute 66, France in possession, possession number 130\nTchouameni recovers the ball in France's attacking half, carries it 5 yards, then passes it 25 yards to Varane on the opposition's right flank. Varane carries it 14 yards back into the defensive half, then sends a 35-yard pass to Lloris in the central defensive half. Lloris passes it 23 yards back to Varane, who carries it 2 yards before passing it 15 yards to Tchouameni on the defensive right flank. Tchouameni carries it 5 yards, then passes it 16 yards to Kounde on the opposition's right flank. Kounde passes it 28 yards back to Varane, who carries it 2 yards before passing it 13 yards to Griezmann. Griezmann sends a 27-yard pass across the pitch to Upamecano in the defensive half left half space. Upamecano carries it 1 yard, then passes it 17 yards to Griezmann in the attacking half left half space. Griezmann carries it 1 yard, then sends an 18-yard pass to Hernandez on the opposition's left flank. Hernandez passes it 6 yards back to Griezmann, who then sends a 20-yard pass back to Hernandez. Hernandez carries it 1 yard before attempting a 36-yard cross to Thuram in the opposition's box, but the cross is incomplete. Otamendi clears the ball from Argentina's defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 4488.14,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 67, France in possession, possession number 131",
        "description": "Second Half, Argentina 2 - 0 France, minute 67, France in possession, possession number 131\nGriezmann of France takes a corner from the opposition's left flank, sending the ball 35 yards into the box to Kolo. MacAllister from Argentina loses a header in the defensive box. Kolo, now with the ball, heads a shot off target from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 4536.585,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 68, Argentina in possession, possession number 132",
        "description": "Second Half, Argentina 2 - 0 France, minute 68, Argentina in possession, possession number 132\nMartinez of Argentina launches a 69-yard goal kick from the defensive box to the central attacking half. Tchouameni from France recovers, covering 24 yards from the defensive half right half space to the central attacking half, passing to Thuram. Alvarez of Argentina loses a header in the central attacking half. Romero of Argentina recovers, moving 13 yards from the central defensive half to the central attacking half, passing to De Paul."
    },
    {
        "timestamp_start_of_possession_seconds": 4544.554,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 68, France in possession, possession number 133",
        "description": "Second Half, Argentina 2 - 0 France, minute 68, France in possession, possession number 133\nRabiot recovers the ball in France's defensive half, swiftly moving it 15 yards to the opposition's left flank where Mbappe takes over. Mbappe carries it a short distance into the attacking half. He then passes it 6 yards to Griezmann, who remains in the attacking half. Griezmann attempts a long 22-yard ground pass, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4550.849,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 68, Argentina in possession, possession number 134",
        "description": "Second Half, Argentina 2 - 0 France, minute 68, Argentina in possession, possession number 134\nDe Paul recovers the ball on Argentina's defensive right flank, quickly passing it to Fernandez. Fernandez carries it 7 yards before sending a 17-yard pass to MacAllister in the central defensive half. MacAllister returns the favor with a 12-yard pass back to Fernandez, who carries it a yard and then passes to Messi on the defensive right flank. Messi carries the ball 6 yards, then passes it back to Fernandez. Fernandez carries it 7 yards into the central defensive half, then sends a long 19-yard pass to Otamendi. Otamendi carries it 3 yards, then passes to Tagliafico on the defensive left flank. Tagliafico carries it 4 yards, but his 17-yard ground pass to Acuna on the opposition's left flank is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4568.429,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 68, France in possession, possession number 135",
        "description": "Second Half, Argentina 2 - 0 France, minute 68, France in possession, possession number 135\nKounde intercepts on France's defensive right flank, carries for 8 yards. Acuna recovers for Argentina on their defensive left. Thuram recovers for France, passes to Kolo on the opposition right flank. Kolo holds, passes 5 yards to Kounde. Kounde holds, passes 15 yards to Thuram in the attacking half. Thuram carries a yard, dribbles. Fernandez of Argentina loses a tackle, commits a foul in the defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 4580.104,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 68, France in possession, possession number 136",
        "description": "Second Half, Argentina 2 - 0 France, minute 68, France in possession, possession number 136\nTchouameni of France takes a 30-yard free kick from the opposition's right flank to Rabiot in the central attacking half. Rabiot passes 18 yards to Mbappe on the opposition's left flank. Mbappe carries the ball 2 yards, then passes 33 yards to Hernandez, but the pass is incomplete. Romero of Argentina clears the ball from the defensive box. Upamecano recovers for France, passing to Rabiot. Alvarez intercepts for Argentina, but Rabiot recovers and passes to Tchouameni. Tchouameni carries the ball 13 yards, then passes to Mbappe. Mbappe passes back to Tchouameni, who carries the ball 17 yards before being blocked by Romero. De Paul recovers for Argentina, passing to Messi. Messi's pass is incomplete, and Hernandez recovers for France, passing to Lloris. Lloris carries the ball 8 yards, then passes to Varane. Varane carries 24 yards, then passes to Kounde. Kounde passes to Upamecano, who carries the ball 3 yards, then passes to Tchouameni. Tchouameni carries 10 yards, then passes to Hernandez. Hernandez's aerial pass to Griezmann is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4645.025,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 69, Argentina in possession, possession number 137",
        "description": "Second Half, Argentina 2 - 0 France, minute 69, Argentina in possession, possession number 137\nRomero intercepts, swiftly covering 11 yards on Argentina's defensive right flank. He finds Molina. Molina holds, no ground gained. He returns the ball to Romero. Romero attempts a long ground pass, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 4648.648,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 69, France in possession, possession number 138",
        "description": "Second Half, Argentina 2 - 0 France, minute 69, France in possession, possession number 138\nTchouameni recovers the ball on the opposition's left flank. He carries it 5 yards, then passes it 11 yards to Rabiot. Rabiot carries it 6 yards, then sends a 17-yard pass to Hernandez. Hernandez, stationary, passes it 17 yards to Mbappe. Mbappe carries it 5 yards, attempts a 4-yard pass to Rabiot, but it's blocked by Romero. Mbappe recovers the ball in the opposition box, carries it 8 yards, and takes a shot, but it's off target. Substitutions are made: Hernandez is replaced by Griezmann."
    },
    {
        "timestamp_start_of_possession_seconds": 4713.267,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 70, Argentina in possession, possession number 139",
        "description": "Second Half, Argentina 2 - 0 France, minute 70, Argentina in possession, possession number 139\nMartinez of Argentina launches a 77-yard goal kick from the defensive box to the opposition's left flank. France's Kounde recovers the ball, passing it to Coman who carries it a short distance. Argentina's Tagliafico intercepts with a successful tackle. Alvarez recovers for Argentina, passing to MacAllister who dribbles past Coman. MacAllister carries the ball 19 yards, then passes to Acuna. Acuna returns the pass to MacAllister who carries it further before passing to Messi. Messi advances into the opposition box, then passes centrally to Fernandez. Fernandez's shot from the central attacking half is saved."
    },
    {
        "timestamp_start_of_possession_seconds": 4758.372,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 141",
        "description": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 141\nLloris, from France, executes a 32-yard pass from the defensive box to Rabiot in the defensive half left half space."
    },
    {
        "timestamp_start_of_possession_seconds": 4763.507,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 142",
        "description": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 142\nRabiot of France initiates with a 10-yard pass from the defensive left flank to Camavinga on the opposition's left. Camavinga carries the ball 5 yards back to the defensive left flank. Alvarez from Argentina attempts a dribble but is outmaneuvered. Camavinga regains control, dribbling from the defensive left before carrying the ball another 13 yards within the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 4767.55,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 143",
        "description": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 143\nCamavinga of France delivers a 13-yard pass to Upamecano on the defensive left flank. Upamecano carries it forward 4 yards, maintaining position on the same flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4770.111,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 144",
        "description": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 144\nUpamecano, from France's defensive left flank, delivers a 24-yard pass to Varane in the central defensive half. Varane then carries the ball another 12 yards within the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 4773.535,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 145",
        "description": "Second Half, Argentina 2 - 0 France, minute 71, France in possession, possession number 145\nVarane, from France's central defense, delivers a 27-yard pass to Kounde on the defensive right flank. Kounde then carries the ball 12 yards into the opposition's right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4778.161,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 146",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 146\nKounde of France delivers a 15-yard pass from the opposition's right flank to Tchouameni in the attacking half right half space. Tchouameni then carries the ball 11 yards into the central defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 4784.496,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 147",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 147\nTchouameni of France delivers a 9-yard pass from the central defensive half to Rabiot in the central attacking half. Rabiot then carries the ball forward 2 yards, maintaining possession in the central attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 4785.49,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 148",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 148\nRabiot of France executes a 23-yard pass from the central attacking half to Varane in the defensive half right half space. Varane maintains possession, holding his ground in the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 4788.533,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 149",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 149\nVarane of France executes a 30-yard pass from the right to left defensive half. Upamecano receives and holds position."
    },
    {
        "timestamp_start_of_possession_seconds": 4790.669,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 150",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 150\nUpamecano, from France, delivers a 33-yard pass from the defensive half left half space to Kolo on the opposition's left flank. Kolo then carries the ball 9 yards, maintaining position on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4796.477,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 151",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 151\nKolo of France delivers a 17-yard pass from the opposition's left flank to Tchouameni in the attacking half left half space. Tchouameni maintains possession, carrying the ball a yard within the same area."
    },
    {
        "timestamp_start_of_possession_seconds": 4798.415,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 152",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 152\nTchouameni of France attempts a 33-yard ground pass from the left half space in the attacking half towards Mbappe in the opposition box, but it's incomplete. Tagliafico of Argentina clears the ball from the defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 4809.003,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 153",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 153\nCamavinga initiates with a 12-yard throw-in to Upamecano on France's defensive left flank. Upamecano carries the ball 7 yards, maintaining position. He then delivers a long 39-yard pass to Varane in the central defensive half. Varane advances 23 yards into the attacking half right half space, then sends a 24-yard pass to Kounde on the opposition's right flank. Kounde, without moving, passes 15 yards to Coman, still on the right flank. Suddenly, Tagliafico from Argentina loses a tackle on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4828.792,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 154",
        "description": "Second Half, Argentina 2 - 0 France, minute 72, France in possession, possession number 154\nComan of France executes a 17-yard throw-in to Rabiot on the opposition's right flank. Rabiot holds the ball, then passes it back to Coman. Coman carries it a short distance before sending a long 26-yard pass to Varane in the attacking half. Varane advances slightly, then delivers a 25-yard pass to Upamecano in the central attacking half. Upamecano drives the ball 24 yards into the left half space, but his ground pass to Mbappe is intercepted by Romero of Argentina in the defensive half. Romero carries the ball 15 yards towards the defensive right flank, where he is fouled by Tchouameni of France, winning a free kick for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 4905.147,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 74, Argentina in possession, possession number 155",
        "description": "Second Half, Argentina 2 - 0 France, minute 74, Argentina in possession, possession number 155\nMartinez of Argentina kicks a free 56-yarder from the defensive right flank to the opposition right flank. Upamecano recovers for France, covering 17 yards on the defensive left flank. Alvarez of Argentina loses a header on the opposition right flank, but Fernandez recovers the ball. \n\nMbappe recovers for France on the defensive left flank and carries the ball 16 yards to the opposition left flank. Romero recovers for Argentina on the defensive right flank, carries 12 yards, and passes 9 yards to Fernandez. Fernandez passes 15 yards to De Paul, who carries 13 yards and passes a long 46 yards to Alvarez on the opposition right flank. \n\nAlvarez carries 20 yards and passes 13 yards to Molina, who carries 3 yards before an incomplete 22-yard action. Coman recovers for France and carries 15 yards on the defensive half left half space, dribbling past Alvarez. Alvarez commits a foul, and Coman wins the foul. \n\nComan carries 4 yards and passes 21 yards to Varane on the defensive half right half space. Varane carries 26 yards into the attacking half right half space, but his 25-yard ground pass to Kounde goes out of play on the opposition right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4981.085,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 75, Argentina in possession, possession number 156",
        "description": "Second Half, Argentina 2 - 0 France, minute 75, Argentina in possession, possession number 156\nTagliafico of Argentina executes a 24-yard throw-in from the defensive left flank to Messi on the opposition's left. Varane from France intercepts on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 4992.689,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 75, Argentina in possession, possession number 157",
        "description": "Second Half, Argentina 2 - 0 France, minute 75, Argentina in possession, possession number 157\nTagliafico of Argentina executes a 34-yard throw-in from the opposition's left flank to Alvarez in the central defensive half. Thuram of France recovers the ball, moving it 27 yards from the central defensive half to the attacking half right half space. Otamendi of Argentina regains possession in the defensive half left half space, carries it 11 yards within the same area, but his 27-yard aerial pass to the central attacking half is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 5000.827,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 75, France in possession, possession number 158",
        "description": "Second Half, Argentina 2 - 0 France, minute 75, France in possession, possession number 158\nCamavinga recovers the ball in France's central defensive half. He carries it 8 yards, still within the central defensive half, then passes it 20 yards to Thuram in the defensive half left half space. Thuram carries the ball 9 yards to the opposition's left flank, then passes it 18 yards to Tchouameni in the central defensive half. Tchouameni carries it 23 yards to the attacking half left half space, but his 20-yard ground pass to Mbappe on the opposition's left flank is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 5016.559,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 76, Argentina in possession, possession number 159",
        "description": "Second Half, Argentina 2 - 0 France, minute 76, Argentina in possession, possession number 159\nMolina intercepts for Argentina on their defensive right flank, covering 16 yards to find Messi in the defensive half right half space. Messi carries the ball 7 yards along the defensive right flank before delivering a 25-yard pass to De Paul on the opposition's right flank. De Paul maintains possession, carrying the ball another 7 yards before being fouled by Camavinga of France. Argentina wins the foul on the opposition's right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 5054.929,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 76, Argentina in possession, possession number 160",
        "description": "Second Half, Argentina 2 - 0 France, minute 76, Argentina in possession, possession number 160\nMolina takes a free kick for Argentina, finding Messi on the right flank. Messi returns the pass to Molina, who carries before passing back to Messi. Messi then finds De Paul with a short pass. De Paul carries the ball into the attacking half, passing to MacAllister. MacAllister and Fernandez exchange passes before Fernandez finds Messi on the right flank. Messi carries, then sends a long pass into the box for De Paul. De Paul's cross is incomplete, and Lloris recovers for France. Lloris' aerial pass is incomplete, and Otamendi clears for Argentina. Fernandez recovers and carries the ball, passing to Acuna. Acuna and MacAllister exchange passes before MacAllister carries into the attacking half. Fernandez receives the ball and sends a long pass to De Paul on the right flank. De Paul and Molina exchange passes before Fernandez receives the ball again. Fernandez and De Paul continue to exchange passes on the right flank. Messi receives the ball and attempts a dribble, but is tackled by Camavinga. Camavinga's pass is blocked by Rabiot."
    },
    {
        "timestamp_start_of_possession_seconds": 5135.345,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 78, Argentina in possession, possession number 161",
        "description": "Second Half, Argentina 2 - 0 France, minute 78, Argentina in possession, possession number 161\nMolina of Argentina initiates with a 13-yard throw-in to Fernandez on the opposition's right flank. Fernandez carries the ball a short distance before passing it back to Molina, still on the right flank. Molina's subsequent action is incomplete, but he recovers swiftly. Thuram of France attempts a block from the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 5141.229,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 78, France in possession, possession number 162",
        "description": "Second Half, Argentina 2 - 0 France, minute 78, France in possession, possession number 162\nCamavinga recovers the ball in France's defensive left flank, swiftly moving it 21 yards to the opposition's left flank, where he finds Mbappe. Mbappe holds the ball, surveying the field before launching a 32-yard pass to Kolo in the attacking half left half space. Kolo carries the ball 18 yards into the opposition box where Otamendi from Argentina concedes a penalty. Kolo wins a penalty for France."
    },
    {
        "timestamp_start_of_possession_seconds": 5219.544,
        "possession_details": "Second Half, Argentina 2 - 0 France, minute 79, France in possession, possession number 163",
        "description": "Second Half, Argentina 2 - 0 France, minute 79, France in possession, possession number 163\nKylian Mbappe of France confidently scores a penalty from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 5243.946,
        "possession_details": "Second Half, Argentina 2 - 1 France, minute 79, Argentina in possession, possession number 164",
        "description": "Second Half, Argentina 2 - 1 France, minute 79, Argentina in possession, possession number 164\nAlvarez kicks off for Argentina, passing to De Paul in the central defensive half. De Paul sends a 26-yard pass to Molina on the defensive right flank. Molina passes to Romero, who carries the ball 6 yards before passing to Otamendi in the central defensive half. Otamendi carries the ball a short distance, then passes to Martinez in the defensive box. Martinez sends a long 56-yard pass to Acuna on the defensive left flank. Meanwhile, Kounde of France loses a header on the opposition right flank. Acuna then passes to Alvarez on the opposition left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 5267.89,
        "possession_details": "Second Half, Argentina 2 - 1 France, minute 80, France in possession, possession number 165",
        "description": "Second Half, Argentina 2 - 1 France, minute 80, France in possession, possession number 165\nKounde initiates with a 34-yard throw-in to Upamecano. Upamecano passes 24 yards to Camavinga, who holds position. Camavinga then sends a 14-yard pass to Thuram. Thuram carries a bit, then returns the ball to Camavinga. Camavinga passes 21 yards to Upamecano, who carries a significant 46 yards before an incomplete aerial pass. Romero recovers for Argentina, but Camavinga quickly regains possession for France. Messi recovers for Argentina, carries 35 yards, but is tackled by Coman. Coman carries 16 yards, passes to Rabiot who carries and then sends a long 33-yard pass to Mbappe. Mbappe passes to Thuram, who feeds it back to Mbappe for a volleyed goal. France scores."
    },
    {
        "timestamp_start_of_possession_seconds": 5402.316,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 82, Argentina in possession, possession number 166",
        "description": "Second Half, Argentina 2 - 2 France, minute 82, Argentina in possession, possession number 166\nMessi kicks off for Argentina, passing to Fernandez in the central defensive half. Fernandez sends a 14-yard pass to De Paul in the right half space. De Paul passes to Romero, still in the right half space. Romero sends it back to Fernandez in the central defensive half. Fernandez carries the ball a short distance before launching a long pass to Tagliafico on the left flank. Tagliafico carries the ball, then passes to Acuna, still on the left flank. Acuna's attempted pass to MacAllister is intercepted by Tchouameni of France."
    },
    {
        "timestamp_start_of_possession_seconds": 5433.2,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 82, Argentina in possession, possession number 167",
        "description": "Second Half, Argentina 2 - 2 France, minute 82, Argentina in possession, possession number 167\nTagliafico throws in to Alvarez on Argentina's left flank. Alvarez carries, passes back to Tagliafico, who returns the pass. Alvarez carries again, then sends a long pass to De Paul in the central attacking half. De Paul carries into the left half space, passes to Alvarez, whose ground pass is blocked by Coman. Alvarez recovers, carries, and passes to Acuna on the left flank. Acuna carries, then sends a long pass to Fernandez in the central attacking half. Fernandez carries, but his shot is blocked by Upamecano. Romero recovers the ball, passes to Molina on the right half space. Molina's aerial pass is incomplete. Camavinga recovers for France, but Otamendi regains possession for Argentina. Otamendi carries, passes to De Paul, who carries and attempts a dribble."
    },
    {
        "timestamp_start_of_possession_seconds": 5469.008,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 83, France in possession, possession number 168",
        "description": "Second Half, Argentina 2 - 2 France, minute 83, France in possession, possession number 168\nKolo from France wins a tackle in the defensive left half. Rabiot recovers the ball in the same area. He carries it 7 yards towards the defensive left flank, but his aerial pass fails. Molina from Argentina blocks on the right flank. Thuram from France recovers the ball on the defensive left flank and carries it 17 yards to the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 5479.613,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 83, Argentina in possession, possession number 169",
        "description": "Second Half, Argentina 2 - 2 France, minute 83, Argentina in possession, possession number 169\nRomero recovers the ball on Argentina's defensive right flank, quickly passing it to De Paul. De Paul carries it a short distance before sending it 11 yards further down the flank to Fernandez. Fernandez then advances into the attacking half, before passing to Alvarez in the same area. Alvarez swiftly redirects the ball to Messi on the opposition's right flank. Messi carries the ball forward, but his ground pass to Alvarez is blocked by Rabiot of France."
    },
    {
        "timestamp_start_of_possession_seconds": 5490.638,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 83, France in possession, possession number 170",
        "description": "Second Half, Argentina 2 - 2 France, minute 83, France in possession, possession number 170\nThuram recovers the ball on the opposition's left flank. He carries it 30 yards into the attacking half. He then passes it 18 yards to Mbappe, still on the left flank. Mbappe carries it 5 yards into the opposition box, but his 39-yard cross goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 5535.956,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 84, Argentina in possession, possession number 171",
        "description": "Second Half, Argentina 2 - 2 France, minute 84, Argentina in possession, possession number 171\nMartinez of Argentina launches a 68-yard goal kick from the defensive box into the attacking half. Alvarez, also of Argentina, commits a foul in the attacking half. Tchouameni of France wins a foul in his defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 5545.751,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 84, France in possession, possession number 172",
        "description": "Second Half, Argentina 2 - 2 France, minute 84, France in possession, possession number 172\nRabiot kicks off with a 16-yard free kick from the defensive half, finding Kounde on the right flank. Kounde passes back to Varane, who carries the ball before passing it back to Kounde. After a brief carry, Kounde sends the ball back to Varane, who then makes a long pass to Lloris in the defensive box. Lloris carries the ball left before launching a 58-yard pass to Thuram on the opposition's left flank.\n\nThe ball is lost in a header by Argentina's Molina, but Romero recovers it. France's Tchouameni regains possession and carries the ball before passing to Rabiot. Rabiot sends a long pass back to Upamecano, who carries the ball before passing it to Kounde. Kounde passes to Varane in the central defensive half, who then carries the ball before passing to Rabiot. Rabiot sends the ball back to Upamecano, who carries it before making a long pass to Kounde on the right flank.\n\nArgentina's Acuna blocks an attempt, but Kounde recovers the ball and carries it before making a ground pass to the opposition's right flank. Argentina's Otamendi commits a foul, and France's Kolo wins the foul on the opposition's right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 5627.712,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 86, France in possession, possession number 173",
        "description": "Second Half, Argentina 2 - 2 France, minute 86, France in possession, possession number 173\nMbappe takes a short free kick to Kounde on the right flank. Kounde carries the ball a yard before passing it back to Mbappe, who remains in the right half space. Mbappe attempts a long aerial pass but it's incomplete. MacAllister clears for Argentina, but Kolo recovers for France, advancing into the opposition box. Otamendi loses a header for Argentina, and Fernandez clears. Kolo recovers again for France, passing to Thuram on the left half space. Thuram passes to Rabiot in the box, who carries it before passing back to Thuram. Thuram commits a foul, ending the possession."
    },
    {
        "timestamp_start_of_possession_seconds": 5690.024,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 87, Argentina in possession, possession number 174",
        "description": "Second Half, Argentina 2 - 2 France, minute 87, Argentina in possession, possession number 174\nMartinez of Argentina launches a 69-yard free kick from the defensive right half space to the opposition's right flank. Julian Alvarez of Argentina commits a foul on the same flank. Meanwhile, Adrien Rabiot of France wins a foul on the defensive left flank. An injury stoppage occurs, involving both Alvarez and Rabiot."
    },
    {
        "timestamp_start_of_possession_seconds": 5814.449,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 89, France in possession, possession number 175",
        "description": "Second Half, Argentina 2 - 2 France, minute 89, France in possession, possession number 175\nCamavinga of France initiates with a 38-yard free kick from the defensive left flank to Varane in the central defensive half. Varane attempts a 62-yard aerial pass from the defensive half right half space towards the attacking half left half space, but it's incomplete. Thuram, in the attacking half left half space, loses a header. Romero of Argentina clears from the defensive half right half space."
    },
    {
        "timestamp_start_of_possession_seconds": 5835.357,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 89, France in possession, possession number 176",
        "description": "Second Half, Argentina 2 - 2 France, minute 89, France in possession, possession number 176\nCamavinga initiates with a throw-in to Rabiot on the opposition's left flank. Rabiot carries the ball, then attempts a cross, but it's incomplete. Kolo loses a header in the opposition box, leading to Otamendi's clearance for Argentina. De Paul recovers the ball, passing to Messi on the defensive right flank. \n\nThe ball returns to France's possession as Rabiot recovers it, passing to Mbappe in the attacking half. Mbappe sends a long pass to Coman on the opposition's right flank. Coman carries the ball, then passes to Kounde in the attacking half. \n\nKounde carries the ball, then passes to Varane in the central defensive half. Varane carries the ball, then passes to Upamecano on the defensive left flank. Upamecano carries the ball, then sends a long pass to Kounde in the defensive half. \n\nKounde carries the ball, then passes to Coman on the opposition's right flank. Coman carries the ball, maintaining France's possession."
    },
    {
        "timestamp_start_of_possession_seconds": 5869.973,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 90, Argentina in possession, possession number 177",
        "description": "Second Half, Argentina 2 - 2 France, minute 90, Argentina in possession, possession number 177\nRomero recovers the ball in Argentina's defensive half, carries it 37 yards into the attacking half. He passes to Alvarez. Alvarez carries the ball 8 yards into the central attacking half, attempts a ground pass to Messi, but it's incomplete. Upamecano intercepts for France, moving the ball 31 yards into the attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 5903.968,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 90, Argentina in possession, possession number 178",
        "description": "Second Half, Argentina 2 - 2 France, minute 90, Argentina in possession, possession number 178\nRomero of Argentina takes a 15-yard free kick in the defensive right half. The ball finds Fernandez. Fernandez attempts a long 48-yard aerial pass from the central defensive half to Acuna in the attacking left half, but it's incomplete. Kounde of France recovers the ball in the defensive right half. Tagliafico from Argentina regains possession with a 23-yard recovery in the attacking left half, passing to Acuna on the opposition's left flank. Acuna then sends the ball out of play from the opposition's box, aiming for Tagliafico."
    },
    {
        "timestamp_start_of_possession_seconds": 5941.66,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 91, France in possession, possession number 179",
        "description": "Second Half, Argentina 2 - 2 France, minute 91, France in possession, possession number 179\nLloris kicks a 71-yard goal from the defensive box to Kolo in the attacking half. Kolo passes 8 yards to Thuram, who carries the ball another 8 yards down the left flank. Romero commits a foul against Thuram, giving France a free kick."
    },
    {
        "timestamp_start_of_possession_seconds": 5990.708,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 92, France in possession, possession number 180",
        "description": "Second Half, Argentina 2 - 2 France, minute 92, France in possession, possession number 180\nMbappe of France takes a 23-yard free kick from the left half space in the attacking half, aiming for the opposition box. Molina from Argentina clears the ball from the defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 5994.304,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 92, Argentina in possession, possession number 181",
        "description": "Second Half, Argentina 2 - 2 France, minute 92, Argentina in possession, possession number 181\nDe Paul recovers the ball in Argentina's defensive left half. He carries it a short distance before passing it 14 yards down the left flank to Acuna. Acuna holds position, but his subsequent action is incomplete. Coman of France blocks on their right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 6013.657,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 92, Argentina in possession, possession number 182",
        "description": "Second Half, Argentina 2 - 2 France, minute 92, Argentina in possession, possession number 182\nTagliafico initiates with a 21-yard throw-in to Otamendi on Argentina's defensive left flank. Otamendi then sends a 34-yard pass across the field to Molina in the right half space. Molina carries the ball 7 yards down the right flank before delivering a 33-yard pass to De Paul in the opposition's territory. De Paul then carries the ball 9 yards back into Argentina's defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 6026.037,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 92, France in possession, possession number 183",
        "description": "Second Half, Argentina 2 - 2 France, minute 92, France in possession, possession number 183\nCamavinga of France wins a tackle on the opposition's left flank. The ball is swiftly recovered by teammate Mbappe in the same area. Mbappe then carries the ball, covering a distance of 32 yards, to the central attacking half. He attempts a shot, but it's blocked by Otamendi of Argentina in the central defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 6063.997,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 93, France in possession, possession number 184",
        "description": "Second Half, Argentina 2 - 2 France, minute 93, France in possession, possession number 184\nComan takes a corner from the opposition's left flank into the box. Tchouameni recovers the ball in the central attacking half, carries it a short distance, then passes to Camavinga in the left half space. Camavinga carries, then sends a long pass to Coman on the opposition's left flank. Coman dribbles past Fernandez twice, carrying the ball further down the flank each time. Fernandez fouls Coman. Camavinga passes from the box to Rabiot, whose shot is saved."
    },
    {
        "timestamp_start_of_possession_seconds": 6081.244,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 93, Argentina in possession, possession number 185",
        "description": "Second Half, Argentina 2 - 2 France, minute 93, Argentina in possession, possession number 185\nRomero recovers the ball in Argentina's defensive box, quickly passing it to Martinez. Martinez sends a 22-yard pass from the defensive box to Fernandez in the right half space. Fernandez then passes the ball 11 yards to Alvarez on the defensive right flank. Alvarez carries the ball 3 yards into the right half space before passing it back to Molina on the right flank. Molina carries the ball 2 yards, then sends a 13-yard pass to Messi on the opposition's right flank. Messi carries the ball 8 yards, maintaining possession. Meanwhile, Camavinga of France loses a tackle on the defensive left flank, and Giroud exhibits bad behaviour."
    },
    {
        "timestamp_start_of_possession_seconds": 6149.018,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 94, Argentina in possession, possession number 186",
        "description": "Second Half, Argentina 2 - 2 France, minute 94, Argentina in possession, possession number 186\nMolina of Argentina executes a 17-yard throw-in to Messi on the opposition's right flank. Messi carries the ball 4 yards into the attacking half right half space. He then passes 9 yards to Romero in the same area. Romero holds position, but his 13-yard ground pass to Molina on the opposition's right flank is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 6154.322,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 94, France in possession, possession number 187",
        "description": "Second Half, Argentina 2 - 2 France, minute 94, France in possession, possession number 187\nCamavinga recovers the ball on France's defensive left flank, passes to Mbappe. Mbappe carries the ball 35 yards up the same flank, then passes 23 yards to Kolo in the attacking half. Kolo carries it 12 yards into the opposition box, but loses it to Fernandez. Mbappe recovers the ball on the opposition left flank, dribbles past Fernandez in the box, and passes to Kolo. Otamendi clears the ball and recovers it for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 6170.116,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 95, Argentina in possession, possession number 188",
        "description": "Second Half, Argentina 2 - 2 France, minute 95, Argentina in possession, possession number 188\nMolina recovers the ball on Argentina's defensive right flank. He carries it 6 yards, then passes it 20 yards to De Paul, still on the right flank. De Paul holds position, then sends a 16-yard pass to Fernandez in the defensive half right half space. Fernandez advances 5 yards, then passes 11 yards to Messi on the right flank. Messi makes a 34-yard carry into the attacking half right half space, then sends a long 43-yard pass to Acuna on the opposition's left flank. Acuna carries the ball 13 yards into the attacking half left half space, then passes 13 yards to Tagliafico in the opposition box. Tagliafico's cross is incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 6198.138,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 95, France in possession, possession number 189",
        "description": "Second Half, Argentina 2 - 2 France, minute 95, France in possession, possession number 189\nRabiot intercepts in France's defensive box. He carries the ball 15 yards, moving to the defensive half right half space. Tagliafico of Argentina commits a foul in the attacking half left half space. Rabiot wins a foul in the defensive half right half space."
    },
    {
        "timestamp_start_of_possession_seconds": 6211.484,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 95, France in possession, possession number 190",
        "description": "Second Half, Argentina 2 - 2 France, minute 95, France in possession, possession number 190\nTchouameni kicks off with a free kick from France's defensive half, finding Kounde on the right flank. Kounde passes back to the half space, where Varane carries it forward. Varane then sends it centrally to Tchouameni. Tchouameni carries, then passes a long one to Lloris in the central defensive half. Lloris carries briefly, then launches a long pass to Thuram on the opposition's left flank. Thuram attempts a headed pass to Kolo in the central attacking half, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 6234.237,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 96, Argentina in possession, possession number 191",
        "description": "Second Half, Argentina 2 - 2 France, minute 96, Argentina in possession, possession number 191\nOtamendi recovers the ball in Argentina's central defensive half, passes 11 yards to Fernandez. Fernandez heads a 17-yard pass to MacAllister, still in the defensive half. MacAllister carries 5 yards, then sends a long 28-yard pass to Acuna on the opposition's left flank. Acuna carries a yard, then passes 25 yards to Alvarez, still on the left flank. Alvarez carries a yard, then sends a 24-yard pass to De Paul in the central attacking half. De Paul passes 24 yards to Messi in the right half space. Messi carries 14 yards into the central attacking half and takes a shot, but it's saved."
    },
    {
        "timestamp_start_of_possession_seconds": 6303.727,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 97, Argentina in possession, possession number 192",
        "description": "Second Half, Argentina 2 - 2 France, minute 97, Argentina in possession, possession number 192\nMessi takes a 36-yard corner from Argentina's left flank into the opposition box. Thuram clears it from France's defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 6306.551,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 97, France in possession, possession number 193",
        "description": "Second Half, Argentina 2 - 2 France, minute 97, France in possession, possession number 193\nComan recovers the ball in France's central defensive half. He carries it 5 yards towards the right half space. Acuna commits a foul in Argentina's left half space. Coman wins a foul in the right half space of France's defensive half."
    },
    {
        "timestamp_start_of_possession_seconds": 6326.461,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 97, France in possession, possession number 194",
        "description": "Second Half, Argentina 2 - 2 France, minute 97, France in possession, possession number 194\nVarane kicks a 24-yard free kick from the right defensive half to Tchouameni in the central defensive half. Tchouameni passes 16 yards to Rabiot, still in the central defensive half. Rabiot sends a 17-yard pass from the left flank to Tchouameni in the left attacking half. Tchouameni carries the ball 6 yards to the central attacking half, then passes 25 yards to Kounde on the right attacking half. Kounde carries 9 yards down the right flank, then passes 16 yards to Coman. Coman dribbles past Acuna, carries the ball 27 yards down the right flank, but his 11-yard attempt into the box is incomplete. Tagliafico clears the ball from the defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 6347.862,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 98, Argentina in possession, possession number 195",
        "description": "Second Half, Argentina 2 - 2 France, minute 98, Argentina in possession, possession number 195\nMacAllister recovers the ball in Argentina's defensive box, passes it 18 yards to Fernandez. Fernandez carries it 2 yards, then passes 14 yards to Messi in the central defensive half. Messi carries it 5 yards, then delivers a 52-yard pass to Alvarez on the opposition's left flank. Alvarez carries it 33 yards into the opposition box, passes it 15 yards back to Messi. Messi carries it 3 yards, then passes 13 yards to De Paul in the opposition box. Varane of France loses a header in the defensive box. De Paul passes it 11 yards to Messi in the opposition box, but Messi loses a header."
    },
    {
        "timestamp_start_of_possession_seconds": 6370.436,
        "possession_details": "Second Half, Argentina 2 - 2 France, minute 98, France in possession, possession number 196",
        "description": "Second Half, Argentina 2 - 2 France, minute 98, France in possession, possession number 196\nTchouameni recovers the ball in France's defensive box, advances 10 yards into the central defensive half, and passes to Camavinga. Meanwhile, Argentina substitutes Molina."
    },
    {
        "timestamp_start_of_possession_seconds": 6372.765,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 90, France in possession, possession number 197",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 90, France in possession, possession number 197\nKolo kicks off for France, passing to Tchouameni in the central defensive half. Tchouameni carries the ball a yard before passing to Rabiot. Rabiot carries the ball 11 yards to the left half space, then passes to Camavinga on the left flank. Camavinga carries the ball a yard, then passes to Upamecano in the left half space. Upamecano carries the ball 6 yards, then makes a long pass to Kounde in the right half space. Kounde carries the ball a yard, then attempts an aerial pass to Coman on the opposition right flank, but the pass is incomplete. Coman loses the header."
    },
    {
        "timestamp_start_of_possession_seconds": 6390.136,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 90, Argentina in possession, possession number 198",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 90, Argentina in possession, possession number 198\nTagliafico recovers the ball on Argentina's defensive left flank, passes to MacAllister. MacAllister sends it to Otamendi, who carries and passes it to Fernandez. Fernandez carries and passes back to MacAllister, who carries it up to the opposition's left flank. MacAllister's ground pass to Alvarez is incomplete. Varane clears for France. Romero recovers for Argentina, but Tchouameni recovers for France. Romero recovers again, passes to Fernandez. Fernandez heads it to De Paul. Rabiot commits a foul on De Paul, who wins the foul for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 6434.807,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 91, Argentina in possession, possession number 199",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 91, Argentina in possession, possession number 199\nRomero of Argentina launches a 53-yard free kick from the central defensive half to Acuna on the opposition's left flank. Acuna carries the ball 8 yards, staying on the left flank. He then sends a 25-yard pass to Otamendi on the defensive left flank. Otamendi carries for 3 yards, then passes 32 yards to Romero in the central defensive half. Romero carries 4 yards into the defensive half right half space, then sends a 40-yard pass to Montiel on the opposition's right flank. Montiel carries 6 yards before being fouled by Thuram of France, winning a foul for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 6470.361,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 91, Argentina in possession, possession number 200",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 91, Argentina in possession, possession number 200\nMontiel initiates with a free kick to Messi on the opposition's right flank. Messi passes to Fernandez, moving the ball 15 yards into the attacking half. Fernandez carries the ball, then passes back to Montiel on the right flank. Montiel carries, then finds Messi again. Messi carries, then passes to De Paul. De Paul carries, then sends the ball back to Fernandez in the attacking half. Fernandez carries, then delivers a long pass to Acuna on the opposition's left flank. Acuna carries, but his cross into the box is incomplete. Varane clears for France. MacAllister recovers for Argentina, but his shot is off target."
    },
    {
        "timestamp_start_of_possession_seconds": 6524.259,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 92, France in possession, possession number 201",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 92, France in possession, possession number 201\nLloris, France's keeper, launches an 85-yard goal kick from the defensive box to the opposition's right flank. Coman receives it skillfully."
    },
    {
        "timestamp_start_of_possession_seconds": 6529.513,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 92, Argentina in possession, possession number 202",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 92, Argentina in possession, possession number 202\nTagliafico recovers the ball, stays on the defensive left flank, and passes to MacAllister. MacAllister carries the ball a short distance before passing to Acuna, still on the defensive left flank. Acuna sends the ball to MacAllister, moving the play into the defensive half left half space. MacAllister carries the ball further in the same area before making a long pass to De Paul in the central defensive half. De Paul carries the ball into the central attacking half and passes to Messi in the attacking half right half space. Messi carries the ball, maintains position, and then initiates a dribble."
    },
    {
        "timestamp_start_of_possession_seconds": 6543.137,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 92, France in possession, possession number 203",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 92, France in possession, possession number 203\nCamavinga, for France, wins a tackle in the defensive left half space. He carries the ball 2 yards, moving to the defensive left flank. Messi of Argentina commits a foul on the right flank. Camavinga wins a foul on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 6555.833,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 93, France in possession, possession number 204",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 93, France in possession, possession number 204\nCamavinga kicks off for France, sending a 52-yard free kick from the defensive left flank to Kounde on the right. Kounde passes to Varane in the central defensive half. Varane carries briefly, then passes to Rabiot, who carries and passes back to Varane. Varane carries towards the right, then passes to Kounde on the right flank. Kounde and Tchouameni exchange passes, before Kounde sends a long pass to Lloris in the defensive box. Lloris launches a 71-yard pass to Thuram in the central attacking half, who passes to Mbappe.\n\nMeanwhile, Romero loses a header for Argentina, but Otamendi recovers and passes to Romero. Romero carries, but his pass is incomplete. Upamecano recovers for France, carries, and passes to Tchouameni on the left flank. Tchouameni carries into the attacking half and passes to Camavinga. Camavinga carries, then passes back to Upamecano, who carries and passes to Rabiot. Rabiot carries a significant distance and passes to Kolo in the attacking half.\n\nRomero recovers for Argentina, carries, and passes to De Paul. De Paul carries, but Kolo recovers for France. Kolo carries and attempts a dribble."
    },
    {
        "timestamp_start_of_possession_seconds": 6627.96,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 94, Argentina in possession, possession number 205",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 94, Argentina in possession, possession number 205\nEnzo Fernandez of Argentina wins a tackle in the defensive half right half space, carries for 3 yards, then passes 24 yards to Julian Alvarez in the central defensive half. Alvarez carries for 2 yards, then passes 20 yards to Marcos Acuna on the defensive left flank. Acuna carries for a yard, then passes 15 yards to Nicolas Otamendi in the defensive half left half space. Otamendi carries for 5 yards, then passes 11 yards back to Acuna on the defensive left flank. Acuna sends a 40-yard pass to Emiliano Martinez in the defensive box. Martinez carries for 3 yards, then launches a 68-yard aerial pass to the opposition left flank. Acuna commits a foul. Meanwhile, France's Jules Kounde wins a foul on the defensive right flank. Adrien Rabiot of France is substituted."
    },
    {
        "timestamp_start_of_possession_seconds": 6688.91,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 95, France in possession, possession number 206",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 95, France in possession, possession number 206\nVarane launches a 54-yard free kick from France's right flank to Camavinga in the left half space. Camavinga passes 12 yards to Fofana, who carries the ball a yard before passing it back to Camavinga on the left flank. Camavinga holds position, then sends a 22-yard pass to Thuram in the opposition's left flank. Thuram carries a yard, passes 8 yards back to Camavinga who carries 4 yards before being fouled by Fernandez. Camavinga wins the foul for France."
    },
    {
        "timestamp_start_of_possession_seconds": 6708.644,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 95, France in possession, possession number 207",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 95, France in possession, possession number 207\nTchouameni of France takes a 14-yard free kick from the attacking half, finding Fofana on the left flank. Fofana carries the ball, then sends a 19-yard pass back to Tchouameni in the central attacking half. Tchouameni carries, then switches play with a 23-yard pass to Kounde on the right flank. Kounde carries, then passes 17 yards to Varane in the defensive half. Varane carries, then finds Fofana in the central half with an 8-yard pass. Fofana carries, then passes 13 yards to Upamecano in the defensive half. Upamecano carries, then sends a 21-yard pass to Camavinga on the left flank. Camavinga carries, then passes 11 yards back to Upamecano in the defensive half. Upamecano carries, then attempts a 33-yard ground pass to Mbappe in the attacking half, but it's offside. Play is stopped due to an injury to Alvarez of Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 6763.788,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 96, Argentina in possession, possession number 208",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 96, Argentina in possession, possession number 208\nOtamendi kicks off with a 32-yard free kick from Argentina's defensive right flank to Fernandez in the central defensive half. Fernandez passes it 13 yards to De Paul on the right. De Paul carries it 3 yards, then sends a 28-yard pass across to Otamendi on the left. Otamendi carries it 3 yards, then passes 18 yards down the left flank to Tagliafico. Tagliafico carries it 2 yards, then passes back 13 yards to Otamendi. Otamendi carries it 3 yards, then passes 9 yards to Fernandez. Fernandez carries it 7 yards, then passes 15 yards to De Paul in the center. De Paul carries it a yard, then sends a 19-yard pass into the attacking half to Messi. Messi carries it a yard, then passes 17 yards to MacAllister. MacAllister carries it 2 yards, then sends a long 31-yard pass to Acuna on the opposition's left flank. Acuna carries it 14 yards, then attempts a 39-yard cross into the box, but it's cleared by Upamecano, Thuram, and Camavinga of France. De Paul recovers the ball 43 yards away in the opposition's box."
    },
    {
        "timestamp_start_of_possession_seconds": 6833.279,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 97, France in possession, possession number 209",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 97, France in possession, possession number 209\nLloris of France kicks a goal from the defensive box, sending it 80 yards to the attacking half. Otamendi recovers for Argentina, moving 20 yards to the defensive left flank and passes to Acuna. Acuna carries the ball 7 yards, staying on the defensive left flank. Kounde from France wins a tackle on the opposition right flank, with Coman recovering the ball. Coman carries the ball 13 yards along the right flank, but his 31-yard cross into the box is incomplete. Romero of Argentina clears from the defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 6848.413,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 97, Argentina in possession, possession number 210",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 97, Argentina in possession, possession number 210\nMartinez recovers the ball in Argentina's defensive box, passes to Otamendi. Otamendi switches play with a long pass to Romero. Romero holds, then finds Fernandez. Fernandez carries forward, passes to Montiel on the right flank. Montiel returns the ball to Fernandez, who advances further. \n\nSuddenly, Thuram tackles Fernandez, Kolo recovers for France. Kolo dribbles past Montiel, carries into Argentina's half. Fernandez recovers with a tackle, passes to MacAllister. MacAllister finds De Paul on the right flank. De Paul attempts a ground pass to Messi, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 6894.765,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 98, France in possession, possession number 211",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 98, France in possession, possession number 211\nCamavinga recovers the ball on France's defensive left flank. He carries it 5 yards, still within the same area. He then passes it 18 yards to Tchouameni in the attacking half left half space. Tchouameni carries it a yard, then sends a 23-yard pass to Mbappe in the same area. Mbappe dribbles past Romero, carries the ball 25 yards into the opposition box, and continues his dribble."
    },
    {
        "timestamp_start_of_possession_seconds": 6908.72,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 98, Argentina in possession, possession number 212",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 98, Argentina in possession, possession number 212\nMontiel of Argentina wins a tackle in the defensive box. Alvarez recovers the ball, moving it 21 yards from the defensive half right half space to the defensive right flank, passing it to De Paul. De Paul holds the ball in the defensive right flank, then passes it 17 yards to Alvarez. Alvarez carries the ball 3 yards in the defensive right flank. Fofana of France loses a tackle on the opposition left flank. Montiel recovers the ball in the defensive right flank, carries it 3 yards, but his ground pass is incomplete. Fofana blocks on the opposition left flank. Montiel commits a foul in the defensive right flank, which Fofana wins for France on the opposition left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 6962.467,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 99, France in possession, possession number 213",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 99, France in possession, possession number 213\nComan of France takes a free kick from the opposition's left flank, aiming for the box. Upamecano, also of France, loses a header in the opposition box. Romero of Argentina clears the ball from the defensive box. Fofana, from France, recovers the ball in the central attacking half, carries it for 3 yards, but his shot is blocked. MacAllister of Argentina blocks in the defensive box, and Messi recovers the ball there."
    },
    {
        "timestamp_start_of_possession_seconds": 6992.755,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 100, France in possession, possession number 214",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 100, France in possession, possession number 214\nComan of France takes a corner from the opposition's left flank, sending it 29 yards into the box. Fernandez of Argentina clears it from the defensive box. Fofana from France recovers the ball in the attacking half right half space, moving it 23 yards to the opposition's right flank and passes to Kounde. Kounde crosses from the right flank, 33 yards offside into the box, aiming for Varane."
    },
    {
        "timestamp_start_of_possession_seconds": 7033.248,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 101, Argentina in possession, possession number 215",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 101, Argentina in possession, possession number 215\nMartinez kicks a 17-yard free kick from Argentina's defensive box to Romero in the defensive half. Romero passes the ball 34 yards to Montiel on the defensive right flank. Montiel carries the ball 12 yards into the opposition's right flank, but his ground pass is blocked by Camavinga of France. Thuram recovers the ball for France and carries it 2 yards before passing it 23 yards to Kolo on the opposition's left flank. Kolo dribbles past Fernandez, but MacAllister recovers the ball for Argentina. Kolo commits a foul on MacAllister, resulting in a substitution for Argentina with De Paul replacing Alvarez."
    },
    {
        "timestamp_start_of_possession_seconds": 7109.735,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 102, Argentina in possession, possession number 216",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 102, Argentina in possession, possession number 216\nEnzo Fernandez of Argentina takes a 10-yard free kick from the defensive right flank, finding Cristian Romero. Romero passes it 30 yards across the pitch to Nicolas Otamendi. Otamendi carries the ball a yard before passing it back to Romero. Romero carries the ball 5 yards, then passes it to Enzo Fernandez. Fernandez carries the ball 2 yards, then passes it to Gonzalo Montiel. Montiel's pass to Fernandez is incomplete. \n\nYoussouf Fofana of France recovers the ball and carries it 10 yards. His aerial pass is incomplete. Emiliano Martinez of Argentina recovers the ball and passes it to Nicolas Otamendi. Otamendi carries the ball 2 yards, then passes it to Leandro Paredes. Paredes carries the ball 16 yards, then passes it to Cristian Romero. Romero's switch pass to Marcos Acuna is intercepted by Jules Kounde of France.\n\nAlexis MacAllister of Argentina recovers the ball and carries it 12 yards. He passes it to Leandro Paredes. Paredes carries the ball 5 yards, then passes it to Enzo Fernandez. Fernandez passes it to Alexis MacAllister. MacAllister carries the ball 4 yards, then passes it back to Fernandez. Fernandez passes it to Leandro Paredes. Paredes carries the ball 6 yards, then passes it to Marcos Acuna. Acuna's cross goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 7214.606,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 104, France in possession, possession number 217",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 104, France in possession, possession number 217\nLloris from France delivers a 61-yard goal kick from the defensive box to the central attacking half. Tchouameni, also from France, loses a header in the central attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 7217.94,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 104, Argentina in possession, possession number 218",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 104, Argentina in possession, possession number 218\nMacAllister recovers the ball in Argentina's defensive half, swiftly advancing it to Martinez. Martinez carries it further into the attacking half before passing to Fernandez on the right. Fernandez holds the ball, then sends it back to MacAllister in the center. MacAllister, without moving, passes to Acuna on the left. Acuna finds Tagliafico, who returns the ball to MacAllister. MacAllister advances slightly before passing to Messi. Messi carries the ball, then passes back to MacAllister who quickly finds Messi again. Messi moves into the opposition box, passing to Martinez. Martinez's shot is blocked by Upamecano. Montiel recovers the ball on the right, but his shot is also blocked by Varane."
    },
    {
        "timestamp_start_of_possession_seconds": 7283.79,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 105, Argentina in possession, possession number 219",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 105, Argentina in possession, possession number 219\nMessi, from Argentina, swiftly takes a 72-yard corner from the opposition's left flank to the right, finding Fernandez with precision."
    },
    {
        "timestamp_start_of_possession_seconds": 7294.278,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 105, France in possession, possession number 220",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 105, France in possession, possession number 220\nTchouameni throws in to Camavinga on France's defensive left flank. Camavinga carries briefly, then passes to Upamecano. Upamecano advances into the defensive box, then sends a long pass to Varane in the central defensive half. Varane, without moving, finds Fofana with a 15-yard pass. Fofana carries forward, then switches play to the defensive right flank with a long pass to Kounde. Kounde carries, then passes to Coman. Suddenly, Acuna of Argentina blocks on their left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7308.327,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 105, Argentina in possession, possession number 221",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 105, Argentina in possession, possession number 221\nTagliafico wins a tackle on the opposition's left flank. Acuna recovers the ball in the same area. He carries it forward 6 yards, still on the left flank. Acuna then sends a 36-yard pass to Martinez in the central attacking half. Martinez carries the ball 7 yards into the opposition box, but his shot misses the target."
    },
    {
        "timestamp_start_of_possession_seconds": 7332.56,
        "possession_details": "First Half Extra Time, Argentina 2 - 2 France, minute 106, France in possession, possession number 222",
        "description": "First Half Extra Time, Argentina 2 - 2 France, minute 106, France in possession, possession number 222\nLloris kicks from the defensive box, a 31-yard goal kick to Fofana in the defensive half left half space. Fofana then passes 12 yards to Camavinga on the defensive left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7337.758,
        "possession_details": "Second Half Extra Time, Argentina 2 - 2 France, minute 105, Argentina in possession, possession number 223",
        "description": "Second Half Extra Time, Argentina 2 - 2 France, minute 105, Argentina in possession, possession number 223\nMartinez kicks off for Argentina, passing to Paredes in the central defensive half. Paredes carries the ball, then sends a long pass to Montiel on the defensive right flank. Montiel carries, then passes back to Paredes in the central defensive half. Paredes carries, then switches play to Otamendi on the left. Otamendi carries, then sends a long pass to Tagliafico on the opposition left flank. Tagliafico carries, then passes to Acuna. Acuna carries, then attempts a dribble but is tackled by Kounde. Coman recovers for France, but Tagliafico quickly regains possession for Argentina. Tagliafico carries, then passes to MacAllister in the attacking half. MacAllister passes to Paredes, who sends a long cross-field pass to Messi. Messi carries, then passes to Montiel on the opposition right flank. Montiel attempts a cross, but it goes out of play."
    },
    {
        "timestamp_start_of_possession_seconds": 7402.064,
        "possession_details": "Second Half Extra Time, Argentina 2 - 2 France, minute 106, France in possession, possession number 224",
        "description": "Second Half Extra Time, Argentina 2 - 2 France, minute 106, France in possession, possession number 224\nHugo Lloris of France executes an 80-yard goal kick from the defensive box, landing it in the attacking half left half space."
    },
    {
        "timestamp_start_of_possession_seconds": 7405.7,
        "possession_details": "Second Half Extra Time, Argentina 2 - 2 France, minute 106, Argentina in possession, possession number 225",
        "description": "Second Half Extra Time, Argentina 2 - 2 France, minute 106, Argentina in possession, possession number 225\nRomero recovers the ball, passing it 19 yards to Montiel on the right flank. Montiel carries it a short distance before passing 11 yards to Paredes. Paredes carries the ball 8 yards, then switches play with a 34-yard pass to Tagliafico on the left. Tagliafico advances 8 yards, then passes to Otamendi. Otamendi carries the ball 6 yards, then sends a long 33-yard pass back to Romero on the right. Romero carries the ball 5 yards, then passes 20 yards to Fernandez. Fernandez carries the ball 5 yards, then attempts a 61-yard through ball to Montiel in the box, but it's incomplete."
    },
    {
        "timestamp_start_of_possession_seconds": 7449.986,
        "possession_details": "Second Half Extra Time, Argentina 2 - 2 France, minute 106, Argentina in possession, possession number 226",
        "description": "Second Half Extra Time, Argentina 2 - 2 France, minute 106, Argentina in possession, possession number 226\nMontiel of Argentina executes a 26-yard throw-in from the right flank, finding Messi in the opposition box. Messi takes a shot, but it's saved. Fernandez recovers the ball in the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 7494.62,
        "possession_details": "Second Half Extra Time, Argentina 2 - 2 France, minute 107, France in possession, possession number 227",
        "description": "Second Half Extra Time, Argentina 2 - 2 France, minute 107, France in possession, possession number 227\nLloris of France kicks a 62-yard goal from the defensive box to the central attacking half. Martinez of Argentina recovers the ball, moving it 16 yards within the central half. Upamecano from France recovers, passing to Tchouameni after an 11-yard move. Tchouameni, however, fails to complete his action in the central attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 7502.848,
        "possession_details": "Second Half Extra Time, Argentina 2 - 2 France, minute 107, Argentina in possession, possession number 228",
        "description": "Second Half Extra Time, Argentina 2 - 2 France, minute 107, Argentina in possession, possession number 228\nParedes recovers the ball in Argentina's defensive half. He carries it a short distance before launching a 32-yard pass to Montiel on the opposition's right flank. Montiel carries it slightly before sending a long 35-yard pass to Martinez in the attacking half. Martinez quickly passes to Messi, who then finds Fernandez in the central attacking half. Fernandez delivers a 16-yard pass into the opposition box to Martinez. Martinez's shot is saved, but Messi recovers the ball and scores."
    },
    {
        "timestamp_start_of_possession_seconds": 7636.042,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 109, France in possession, possession number 229",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 109, France in possession, possession number 229\nTchouameni kicks off from the central defensive half, passing 17 yards to Kounde in the right defensive half. Kounde then passes 19 yards to Varane on the right flank. Varane carries the ball 2 yards, staying in the right half space, before passing a long 30 yards to Lloris in the defensive box. Lloris carries the ball 16 yards to the left defensive half, then attempts a massive 100-yard aerial pass out of play towards the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7688.12,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 110, Argentina in possession, possession number 230",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 110, Argentina in possession, possession number 230\nEmiliano Martinez of Argentina launches a 73-yard goal kick from the defensive box to the opposition's right flank. Lautaro Martinez then loses a header on the same flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7691.831,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 110, France in possession, possession number 231",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 110, France in possession, possession number 231\nThuram recovers the ball for France, moving it 16 yards from the defensive left flank to the left half space. He passes to Varane who sends it 43 yards to the opposition's left flank. Thuram attempts an aerial pass but it's incomplete. Romero clears for Argentina, but Fernandez recovers the ball. Kolo recovers for France, passing to Thuram who carries it 4 yards. Thuram dribbles past Montiel, then carries the ball another 3 yards. Romero recovers for Argentina, moving the ball 77 yards to the central attacking half. Varane recovers for France, passing to Upamecano who carries it 3 yards then passes to Lloris. Lloris passes 42 yards to Camavinga who carries it 4 yards then passes to Fofana. Fofana carries the ball 11 yards into the central attacking half."
    },
    {
        "timestamp_start_of_possession_seconds": 7731.751,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 111, Argentina in possession, possession number 232",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 111, Argentina in possession, possession number 232\nMessi wins a tackle in Argentina's central defensive half. Paredes recovers the ball, passing it to Otamendi in the same area. Otamendi sends a pass to MacAllister, who carries the ball forward. MacAllister then passes to Fernandez, who sends a long ball to Acuna on the opposition's left flank. Acuna carries, then passes to Martinez in the attacking half. Varane of France recovers the ball, carries it towards the defensive right flank, but his pass goes out of play. Subsequently, Varane is substituted."
    },
    {
        "timestamp_start_of_possession_seconds": 7790.324,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 112, Argentina in possession, possession number 233",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 112, Argentina in possession, possession number 233\nAcuna of Argentina executes a 10-yard throw-in to Martinez on the opposition's left flank. Martinez attempts a short 3-yard pass, but it's incomplete. Coman of France blocks on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7811.388,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 112, Argentina in possession, possession number 234",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 112, Argentina in possession, possession number 234\nAcuna of Argentina executes an 11-yard throw-in to Martinez on the opposition's left flank. Martinez carries the ball 3 yards, maintaining position. He then passes back to Acuna, covering 5 yards. Acuna carries the ball a further 2 yards before attempting a dribble. Coman of France intercepts with a successful tackle on their defensive right flank, but only manages a 1-yard carry. Acuna quickly regains control with a tackle and carries the ball another yard on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7833.7,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 113, France in possession, possession number 235",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 113, France in possession, possession number 235\nLloris kicks from the defensive box, a 23-yard pass to Camavinga. Paredes commits a foul on the defensive right flank for Argentina. Camavinga wins a foul for France on the opposition's left flank."
    },
    {
        "timestamp_start_of_possession_seconds": 7894.389,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 114, France in possession, possession number 236",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 114, France in possession, possession number 236\nComan of France takes a free kick from the opposition's left flank, aiming for the box. Konate loses a header in the opposition box. Acuna of Argentina clears from the defensive box. Fofana recovers for France in the central attacking half, carries a short distance, then passes 20 yards to Kounde on the opposition's right flank. Kounde carries a few yards, attempts a ground pass to Tchouameni but it's blocked by Fernandez of Argentina. Fofana recovers the ball, passes back to Kounde who attempts another pass, this time to Konate. Konate carries, attempts a short pass but it's blocked by Tagliafico of Argentina. Substitution for Argentina, MacAllister comes on."
    },
    {
        "timestamp_start_of_possession_seconds": 7972.145,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 115, France in possession, possession number 237",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 115, France in possession, possession number 237\nComan of France delivers a 44-yard corner from the right flank to the opposition box, targeting Upamecano. Upamecano loses the header. Montiel of Argentina clears the ball from the defensive box. Mbappe of France recovers the ball in the opposition box, carries it 3 yards into the left half space, but his shot is blocked by Montiel. In the ensuing chaos, Montiel concedes a penalty in the defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 8062.327,
        "possession_details": "Second Half Extra Time, Argentina 3 - 2 France, minute 117, France in possession, possession number 238",
        "description": "Second Half Extra Time, Argentina 3 - 2 France, minute 117, France in possession, possession number 238\nKylian Mbappe of France expertly scores a penalty goal from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 8118.06,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 118, Argentina in possession, possession number 239",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 118, Argentina in possession, possession number 239\nEnzo Fernandez of Argentina kicks off, passing to Leandro Paredes. Paredes returns the pass to Fernandez, who carries the ball. Fernandez dribbles past Youssouf Fofana of France, then carries the ball further before passing to Gonzalo Montiel. Montiel carries the ball but his action ends incomplete. Lionel Messi recovers the ball for Argentina. Leandro Paredes also recovers the ball and carries it before passing to Fernandez. Fernandez's ground pass is incomplete. Eduardo Camavinga of France recovers the ball and dribbles. Paredes tackles Camavinga, recovers the ball, and passes to Messi. Messi carries the ball but is tackled by Aurelien Tchouameni of France. Ibrahima Konate and Jules Kounde of France recover and clear the ball respectively. Lautaro Martinez of Argentina recovers the ball, carries it, and passes to Fernandez. Fernandez passes to Marcos Acuna who carries the ball but his action ends incomplete. Jules Kounde of France blocks the action."
    },
    {
        "timestamp_start_of_possession_seconds": 8182.967,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 119, Argentina in possession, possession number 240",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 119, Argentina in possession, possession number 240\nMessi swings in a 41-yard corner from Argentina's left flank into the opposition box. Otamendi, also from Argentina, loses a header in the same area. France's Konate and Kounde respond with clearances from their defensive box."
    },
    {
        "timestamp_start_of_possession_seconds": 8198.098,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 119, Argentina in possession, possession number 241",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 119, Argentina in possession, possession number 241\nEnzo Fernandez of Argentina executes a 14-yard throw-in to Gonzalo Montiel on the opposition's right flank. Montiel then takes control and dribbles forward."
    },
    {
        "timestamp_start_of_possession_seconds": 8200.377,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 119, France in possession, possession number 242",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 119, France in possession, possession number 242\nCamavinga wins a tackle on France's defensive left flank, carries for 10 yards, then passes 4 yards to Thuram. Thuram, still on the defensive left, passes 16 yards to Fofana. Fofana carries a massive 36 yards from defensive to opposition left flank, then passes 16 yards to Mbappe. Mbappe carries a yard, then attempts a 60-yard switch pass to Kolo in the opposition box, but it goes out of play. Substitutions occur: Kounde for France, Tagliafico for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 8297.502,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 121, Argentina in possession, possession number 243",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 121, Argentina in possession, possession number 243\nMartinez of Argentina launches an 82-yard goal kick from the defensive box to the opposition's left flank, finding Dybala. Dybala carries the ball 4 yards, staying within the opposition's left flank. Attempting a further move, Dybala's action is incomplete, covering 19 yards within the same area. Konate of France intercepts on the defensive right flank."
    },
    {
        "timestamp_start_of_possession_seconds": 8324.169,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 121, Argentina in possession, possession number 244",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 121, Argentina in possession, possession number 244\nAcuna throws in to Otamendi on Argentina's left flank. Otamendi carries, then passes centrally to Pezzella. Pezzella holds, then returns the ball to Otamendi on the left. Otamendi carries, then passes to Acuna. Acuna carries, then passes back to Otamendi. Otamendi advances, but his pass to Acuna is incomplete. \n\nComan recovers for France, but Otamendi quickly regains possession for Argentina. He passes to Paredes, who finds Acuna. Acuna carries, then recovers a lost ball from Coman. Acuna carries again, then launches a long pass to Dybala on the opposition's left flank. \n\nDybala holds, but his pass to Martinez is intercepted by Upamecano. Coman recovers for France, but Paredes regains possession for Argentina. He passes to Fernandez, who finds Messi in the central attacking half. Messi attempts a through ball to Martinez, but it's offside."
    },
    {
        "timestamp_start_of_possession_seconds": 8391.786,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 122, France in possession, possession number 245",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 122, France in possession, possession number 245\nLloris of France launches a 62-yard free kick from the defensive right half into the attacking right half. Otamendi of Argentina recovers the ball, moving it 25 yards from the defensive left half to the central defensive half. Kolo of France loses a header in the attacking right half. Konate of France recovers the ball in the central attacking half, carries it a yard, then sends a 41-yard pass to Kolo in the opposition box. Kolo's shot is saved."
    },
    {
        "timestamp_start_of_possession_seconds": 8403.676,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 122, Argentina in possession, possession number 246",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 122, Argentina in possession, possession number 246\nOtamendi recovers the ball in Argentina's central defensive half. He carries it 6 yards before passing it 29 yards to Dybala, still in the central defensive half. Dybala carries it 5 yards, then passes it 6 yards to Fernandez in the defensive half right half space. Fernandez holds position, then sends a 17-yard pass to Messi on the defensive right flank. Messi carries the ball 9 yards into the opposition's right flank, then passes it 38 yards to Montiel. Montiel carries it 5 yards into the opposition's box, then passes it 20 yards to Martinez. Martinez attempts a headed shot, but it's off target."
    },
    {
        "timestamp_start_of_possession_seconds": 8453.527,
        "possession_details": "Second Half Extra Time, Argentina 3 - 3 France, minute 123, France in possession, possession number 247",
        "description": "Second Half Extra Time, Argentina 3 - 3 France, minute 123, France in possession, possession number 247\nLloris of France kicks a 72-yard goal from the defensive box to the attacking half. Acuna recovers for Argentina, moving 17 yards into the attacking half. Tchouameni recovers the ball for France. Paredes recovers for Argentina, passing to Fernandez. Fernandez carries, but Tchouameni recovers again for France. Tchouameni carries 20 yards, then passes 59 yards to Mbappe. Mbappe carries 6 yards, dribbles past Romero, carries another 5 yards into the box, dribbles past Paredes, and carries 7 more yards. Fernandez fails to tackle Mbappe, but Dybala clears for Argentina."
    },
    {
        "timestamp_start_of_possession_seconds": 8497.996,
        "possession_details": "Penalties, Argentina 3 - 3 France, minute 120, France in possession, possession number 248",
        "description": "Penalties, Argentina 3 - 3 France, minute 120, France in possession, possession number 248\nKylian Mbappe of France expertly scores a penalty from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 8546.801,
        "possession_details": "Penalties, Argentina 3 - 4 France, minute 121, Argentina in possession, possession number 249",
        "description": "Penalties, Argentina 3 - 4 France, minute 121, Argentina in possession, possession number 249\nLionel Messi of Argentina confidently scores a penalty goal from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 8586.633,
        "possession_details": "Penalties, Argentina 4 - 4 France, minute 121, France in possession, possession number 250",
        "description": "Penalties, Argentina 4 - 4 France, minute 121, France in possession, possession number 250\nKingsley Coman of France takes a penalty in the opposition box, but the shot is saved."
    },
    {
        "timestamp_start_of_possession_seconds": 8631.794,
        "possession_details": "Penalties, Argentina 4 - 4 France, minute 122, Argentina in possession, possession number 251",
        "description": "Penalties, Argentina 4 - 4 France, minute 122, Argentina in possession, possession number 251\nPaulo Dybala of Argentina scores a penalty goal from the opposition box."
    },
    {
        "timestamp_start_of_possession_seconds": 8693.899,
        "possession_details": "Penalties, Argentina 5 - 4 France, minute 123, France in possession, possession number 252",
        "description": "Penalties, Argentina 5 - 4 France, minute 123, France in possession, possession number 252\nTchouameni of France takes a penalty shot from the opposition box, but it's off target."
    },
    {
        "timestamp_start_of_possession_seconds": 8741.332,
        "possession_details": "Penalties, Argentina 5 - 4 France, minute 124, Argentina in possession, possession number 253",
        "description": "Penalties, Argentina 5 - 4 France, minute 124, Argentina in possession, possession number 253\nLeandro Paredes of Argentina scores a penalty from the opposition box. Meanwhile, Emiliano Martinez, also of Argentina, exhibits bad behaviour on the field."
    },
    {
        "timestamp_start_of_possession_seconds": 8794.392,
        "possession_details": "Penalties, Argentina 6 - 4 France, minute 125, France in possession, possession number 254",
        "description": "Penalties, Argentina 6 - 4 France, minute 125, France in possession, possession number 254\nRandal Kolo of France expertly slots a penalty into the opposition's box, scoring a crucial goal."
    },
    {
        "timestamp_start_of_possession_seconds": 8842.493,
        "possession_details": "Penalties, Argentina 6 - 5 France, minute 125, Argentina in possession, possession number 255",
        "description": "Penalties, Argentina 6 - 5 France, minute 125, Argentina in possession, possession number 255\nGonzalo Montiel of Argentina confidently scores a penalty goal from the opposition box."
    }
]